[
    {
        "title": "girl I'm dating makes really good food. I don't know how to ask for more",
        "post-author": "BlacksmithJealous409",
        "text": "I (30M) have been seeing this girl (25F) for a few months. she sometimes gives me extra food that she made and says \"it's too much\" so she \"needs help getting rid of it.\" but let me just say, it's the BEST food i've ever had. Her friends also always talk about how good her food is so i know i'm not biased. she hasn't had extra food to hand out in awhile. I really want to ask her for more food but I can't figure out a way to ask without sounding like a misogynist who believes women belong in the kitchen. She has opened up to me before and expressed her frustration with cooking because it always felt like a chore for her when she had to cook for her younger siblings every day till she graduated from high school. she's had a hard life and grew up in foster care so i don't want to overstep and remind her of trauma. how does one ask? or should i just forget about it?",
        "comments": [
            {
                "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "Tell her that her food is amazing, and ask if you could cook with her sometime. You will help her out with something she doesnt really enjoy doing, and will learn how to cook good food. Win win",
                "comment-author": "GladWolverine0",
                "replies": [
                    {
                        "body": "Offer to buy some of the fresh ingredients",
                        "comment-author": "halermine",
                        "replies": []
                    },
                    {
                        "body": "OP: building on this…\n\n1. Yes tell her she is an amazing cook and ask her how she learned.  Be curious and listen.  Be a person who praises her skill, training and expertise. A person who sees her and lifts her up. Tell her how fun it to watch her cook. Don’t fake this — be authentic. \n\n2. Suggest a date where you offer to bring a bottle of wine and pick up the groceries for any recipe she enjoys making.  Don’t ask her what is her “favorite” recipe, just what are some dishes she loves to cook would like to make. \n\n3. When she is finished cooking, or after dinner, or as she is mid-stream cooking but no longer needs some of the pots/pans/equipment, START DOING THE DISHES WITHOUT BEING PROMPTED AND WITHOUT BRINGING ATTENTION TO IT — just do it like you know it’s time to do it. This is literally one of the hottest forms of foreplay on the planet, so ideally find a way to learn to enjoy doing the dishes, but if not, fake it. You are relieving her of the big drawback of cooking…getting stuck w massive cleanup. (And if you roll up your shirt sleeves to visibly expose your forearms during the exercise, caution: extra powers may also be unleashed). \n\n4. Consider at some point gifting her a cookbook once you learn more about her style and approach to cooking.  PLENTY by Ottolenghi is an excellent candidate, bc if she starts cooking for you out of that particular book, every recipe is a guaranteed stone cold winner",
                        "comment-author": "SeksPositive",
                        "replies": [
                            {
                                "body": "This is amazing advice. Every man trying to woo a woman should pay extra attention to #3. It really is the fastest way to turn many of us on. And it's so simple, it doesn't cost a thing! But it can make all the difference in the world.",
                                "comment-author": "Blindtothesided",
                                "replies": []
                            },
                            {
                                "body": "The way I just did a little gasp at the thought of a man ever just spontaneously doing the dishes without being asked or drawing attention to it. OP, this!!!",
                                "comment-author": "amiescool",
                                "replies": []
                            },
                            {
                                "body": "You must be crazy!!\n\nDoing the dishes is the best! Less risky (if it’s clean, it’s clean, not about anyone’s taste), and you take something messy and dirty and you turn it into something clean and proper. You can do things at your pace. Chat while you do it.\n\nwho needs to fake enjoying the dishes?? Especially if they get to enjoy the delicious results!",
                                "comment-author": "my_n3w_account",
                                "replies": []
                            },
                            {
                                "body": "This person romances",
                                "comment-author": "Last-Bar-990",
                                "replies": []
                            },
                            {
                                "body": "First of all, a thousand percent this. Especially the exposed forearm part 🤭\n\nBut what I came to say is: if she doesn’t like cooking from recipes the book to get is the Flavor Bible. It tells you which ingredients are best together when you’re free styling in the kitchen.",
                                "comment-author": "effable37",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "And that you'll bring all the ingredients plus do the dishes afterwards.",
                        "comment-author": "contrary24",
                        "replies": [
                            {
                                "body": "Why do I feel like OP is not really going to follow all this good advice…I somehow feel like despite what he said he still just wants to get her to cook for him without having to feel guilty about it…\n\nI guess it’s because after all he’s mainly asking “how can I get more of her food” rather than “I’m dating this amazing girl who has had a hard life, how can I make her feel appreciated”",
                                "comment-author": "Bother_said_Pooh",
                                "replies": [
                                    {
                                        "body": "THIS! Something isn’t right about the picture he’s painting. If he’s seeing her for months why is he here,  asking how to get her to cook food? \n\nSo, she’s either stopped, so what’s going on with her, is she ok? \n\nOr she just stopped giving him food, which could indicate he’s a mooch and she’s a bit fed up of it and not getting much back.\n\nI know if i’m cooking and a man is not doing his part, I’d stop giving him any food too.",
                                        "comment-author": "DeeDeeNix74",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Ya this is what I was going to say-ask her if you can do it with her to learn.  Asking her to “teach” you could go either way, as in she doesn’t need another chore to do, or she might be flattered and like the experience of it.  So going about it in a way that isn’t causing extra work for her (not teaching you, just you helping out so you can learn) might be a good way to go about it.",
                        "comment-author": "Solar_kitty",
                        "replies": []
                    },
                    {
                        "body": "Totally agree with this comment.  \nLet her know how amazing you think her cooking is and that you'd love to learn from her. You could suggest making it a fun cooking date. Offer to buy the groceries, help with the parts she doesn't enjoy (like dishes or chopping onions, etc.) or maybe take charge of dessert. That way, it's not just about asking for food, it becomes something you do together, and you're showing appreciation without putting pressure on her. Win-Win!",
                        "comment-author": "unotthatspecial",
                        "replies": []
                    },
                    {
                        "body": "\"Let's go grocery shopping and cook together. I love the food you make\"",
                        "comment-author": "instinct7777",
                        "replies": [
                            {
                                "body": "No, if she’s cooking for you, especially on your request, you go shopping and take care of that aspect, unless it’s like a fun experience like going to a farmers market or something a bit out of the ordinary.",
                                "comment-author": "Open_Platform2533",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Make sure you tell her what a great cook she is. Maybe you can ask her to teach you how to cook some of her dishes. That seems more appropriate than asking her to cook for you.",
                "comment-author": "Fresh-Preference-805",
                "replies": []
            },
            {
                "body": "Here’s a perspective from someone in your girlfriends shoes: I also have to cook everything from scratch since I was 14 due to multiple food intolerances. It’s a chore that literally everything has to be cooked from scratch, even if it means u have become a really good chef over the past 20 years since. But it’s really exhausting when you’re tired from work and there’s just no shortcut.\n\nA few years ago i started seeing this guy, and because I can’t really eat out at restaurant’s either, I invited him over for dinner. Partly due to lack of alternatives like going out, as well as me being the significantly better chef between the two of us, this quickly became a dynamic where I ended up doing all the shopping, all the cooking, all the cleanup and twice the food bill. He thought he was really doing me a favour by telling me over and over how good my food is and that he can’t get enough. I know my food is top-notch, thank you. But ultimately, even genuine appreciation isn’t the same as reciprocation. I got tired of him real quick as this man added no value to my life beyond entertainment but became just one more chore for me. Thanks I’ll just take Netflix and chill by myself over that.\n\nSo of course you can tell her how much you appreciate her cooking, but ultimately, think about what you can offer in exchange.\n\n- while you mention how much you like her cooking, ask her what part she doesn’t like (other than the history of having to cook for her brother), then make a plan to take care of those parts. What I mean by that is that you should take care of getting the ingredients, and also give her a hand while she cooks. Chopping ingredients, doing the dishes as she’s busy with other things etc. get a nice bottle of wine and buy/contribute by making a dessert. That way it’s more reciprocal, you literally also “bring something to the table”, and it feels symbiotic that way.\n\n- like i have already commented on one of the other responses, make it a date. Cook together after perhaps going to a farmers market or making it part of a date. Strawberry picking? Wine tasting followed by some homemade food? \n\n- pay it forward: if you see she has little projects around the house (maybe checking something on her car, helping her mount that shelf that’s been standing in the corner for weeks, or just doing something meaningful to her like getting her that book she was talking about, she will probably be more than happy to thank you with a delicious home cooked meal, and she will even want to do it. \n\nIt’s ok for two people to have different skills and not being able to return a kindness in the exact same way, but make sure the effort you both put in stays balanced.",
                "comment-author": "Open_Platform2533",
                "replies": []
            },
            {
                "body": "Take her to dinner, and tell her you want to give her a break from cooking for herself sometimes since she always had to cook for her younger siblings . Tell her you’re buying her dinner and part and gratitude for the incredible leftovers.  Complement her her gifts to you just tell her thank you. If she feels moved, she’ll cook for you. \nMIf she really hates it and doesn’t want to cook for anyone , she won’t, and you’ll have had a nice dinner with her and she’ll also feel good.",
                "comment-author": "OriEri",
                "replies": []
            },
            {
                "body": "Are you buying the groceries she’s using to feed you? Cause honestly I’d get really annoyed if a guy kept eating all my food without chipping in. Groceries are expensive. I’m already having this issue with my roommate. Eats all my food and doesn’t chip in, and that’s not even a dog joke. My roommate is a real human.",
                "comment-author": "Basil_Bound",
                "replies": []
            },
            {
                "body": "Knowing cooking is a chore for her, I think it doesn't present you in a good light if you ask for more food. Don't. Just thank her for her food and tell her how much you enjoyed it.\n\nFor the record, I love to cook and I cook very well. I am single so I meal prep and cook for friends and coworkers frequently because I want to. Even so, if a guy I was dating (or anyone, really) asked for more food, I'd feel obligated to cook and it would no longer be a pleasure, but a chore.",
                "comment-author": "damiana8",
                "replies": []
            },
            {
                "body": "“Hey! Do you wanna cook a meal together this weekend? I think it would be awesome and cute! We can grab some wine and have a romantic dinner after, what do you think?” Just adjust based on how well you know her and avoiding any sensitive topic",
                "comment-author": "Dribbler365",
                "replies": [
                    {
                        "body": "Like wanting to get in her panties after dinner for example mate. Avoid any sensitive topics like Dribbler commented.",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Just let her know her food is amazing and to feel free to give you more if she ever has too much again. And then start thinking about things you can do for her so she also feels appreciated and cared for so she doesn’t turn into your selfless chef",
                "comment-author": "Confidenceisbetter",
                "replies": [
                    {
                        "body": "Like buy her kitchen equipment? /s",
                        "comment-author": "Crush-N-It",
                        "replies": [
                            {
                                "body": "No please don't buy her kitchen equipment unless she says to do so - it's really giving the idea of \"oh well the only thing I registered about you is that you make food that I like so here is some cookware\" also she expressed that cooking is a chore - so please dont gift something that essentially says \"i know you hate it but I think you should do it more\". It's super reductive.\nJust find out what she likes outside of cooking? Maybe it's books, maybe it's going to a wrestling match, maybe it's skydiving... anything that shows you know she is more than just a cook.",
                                "comment-author": "Haunting-Chest6347",
                                "replies": [
                                    {
                                        "body": "The “/s” is for sarcasm 🤣🤣🤣",
                                        "comment-author": "Crush-N-It",
                                        "replies": [
                                            {
                                                "body": "Omg sorry x) but tbh it's also worth saying to someone who so far only said that what they like about their partner is their cooking x) \n\nBut hm I'll take that humbling moment into my day thank you XD",
                                                "comment-author": "Haunting-Chest6347",
                                                "replies": [
                                                    {
                                                        "body": "I had a slight inclination someone would respond that way so not completely unexpected. Have an awesome day!!",
                                                        "comment-author": "Crush-N-It",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You could try and ask for one of her recipes and see how you go with making it. Maybe you could invite her over for dinner and you could cook her recipe and make a nice dessert. \n\nIt’s a compliment when someone asks for a recipe of something you’ve made.",
                "comment-author": "Sail-to-the-Moon",
                "replies": []
            },
            {
                "body": "https://www.youtube.com/watch?v=UD7ZmvU9jdM",
                "comment-author": "LiKwidSwordZA",
                "replies": []
            },
            {
                "body": "You don’t. You make sure to express how much you appreciate it whenever she offers, you make sure she feels equally appreciated by you, and she’ll want to cook for you all the time.\n\nYou can also ask her to cook together, so she can teach you.",
                "comment-author": "charismatictictic",
                "replies": []
            },
            {
                "body": "Asking her to cook for you is risky, personally I’d feel\nsmothered it I was on the receiving end of that. Thank her when she does offer you food and let her know how good it tastes when you eat it. If she knows you like her cooking she may make a bigger batch whenever she does cook. But don’t pressure her to cook more often than she already is",
                "comment-author": "ImpossibleSquish",
                "replies": []
            },
            {
                "body": "Since you want her to cook for you, without seeming misogynistic, ask if she would consider catering and agree what you will pay her.\n\n“She hasn’t had any extra food to handout in a while” 🥴 Have you been doing nice things for her?  If not it sounds like you’ve been getting free food and want more. Maybe she hasn’t got food for you. \n\nSo unless you’ve also been taking her out, doing nice things for her.  I’d be more concerned coming off as a mooch, than misogynistic.",
                "comment-author": "DeeDeeNix74",
                "replies": []
            },
            {
                "body": "Buy the ingredients for a dish you want, take it to her house and cook with her.",
                "comment-author": "babybirdtequilashots",
                "replies": []
            },
            {
                "body": "I would offer to buy the groceries and ask her to cook smth for us",
                "comment-author": "Fit-Duty-6810",
                "replies": []
            },
            {
                "body": "It’s not that deep, getting in your head about whether or not you’re a misogynist is gonna screw your relationship up bad. Just tell her the food is amazing and buy her ingredients, offer to help out (you’ll learn how to cook well too). And if that bothers her, just step back from it. It’s not wrong to ask though, don’t be overcautious",
                "comment-author": "adfaer",
                "replies": [
                    {
                        "body": "As a woman I wanna say no… I think never thinking about whether he’s a misogynist is what would screw the relationship up rbh. In fact one of the things which made me really happy in op’s post is the fact that he doesn’t wanna be chauvinistic. I think it shows the right attitude and consideration for a female partner.",
                        "comment-author": "Gotsims1",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Ask her for scraps. \n\nBecause her scraps taste better than any other food you've eaten.",
                "comment-author": "AmsterdamAssassin",
                "replies": []
            },
            {
                "body": "Wife her up asap.",
                "comment-author": "tropicsGold",
                "replies": []
            },
            {
                "body": "This is in \"dating advice\", so I assume you want to make more of a connection than \"please give me more food\" - you want to get to know her better (as a friend or a potential romantic partner), I assume. ... So, say \"*I miss your amazing food. I wish I was as good at cooking as you, would it be okay if helped you in the kitchen so I could learn a bit of your kitchen magic while helping you out, and also get to know you better?*\"",
                "comment-author": "Lazy_Guava_5104",
                "replies": []
            },
            {
                "body": "Step one go to gym\n\n2 get down too as close to zero percent body fat as you can (abs galore)\n\n3 tell her your willing to sacrifice this god like physic for that good good food.",
                "comment-author": "bamfmcnabb",
                "replies": []
            },
            {
                "body": "Ask her for the recipe then offer to cook for her",
                "comment-author": "ILive4Banans",
                "replies": []
            },
            {
                "body": "OP, compliment her cooking and ask if you can cook together sometime soon. Ask for a specific dish if there's one you want.  \n\nPay for the groceries, even if she declines that you do, still pay for it, and be available to help cook if she needs you to.",
                "comment-author": "Runnru",
                "replies": []
            },
            {
                "body": "“I really loved that dish you brought the other day can you teach me how to make it?”",
                "comment-author": "IceBlue",
                "replies": [
                    {
                        "body": "I think if not asked very carefully and considerately this is a bit tone deaf when someone just said they had to do way too much domestic work as a child. On top of the cooking you are adding additional unpaid labor to her to-do list when you ask her to teach. Being parentified as a girl living in a patriarchal society is pretty traumatic and a lot of people replying to this thread clearly haven’t experienced it. :/ I think if op asks her to teach him to cook he should be providing something VERY good in exchange for it precisely because she doesn’t like doing it and has said it carries negative weight for her. Like others said, he could pay for the ingredients and do the grocery shopping + dishes. Op should also make it clear he wants to learn to do it so that he can take the load off and do it FOR her as WELL as enjoy that type of food himself. \n\nAnother thing to consider: maybe part of why it tastes so good to OP is because he feels nurtured when he eats food she made. He should ask himself if he could find other ways to feel nurtured by her which don’t involve her doing cooking for him.\n\nAt the end of the day you also need to respect if she draws a boundary and says no. End of discussion. There’s other great food out there and we are never entitled to anything from our partner. All we can do is ask them and hope they’ll do what we would like.",
                        "comment-author": "Gotsims1",
                        "replies": [
                            {
                                "body": "Asking someone to teach you to make something isn’t tone deaf when they said they find cooking to be a chore. It shows you want to put effort into doing it yourself.",
                                "comment-author": "IceBlue",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Easy! Next time, announce that you’ll cook for her. Then, weaponize male incompetence by acting clueless in the kitchen. She won’t be able to sit it out and will be drawn to intervene and take over.",
                "comment-author": "akillerofjoy",
                "replies": [
                    {
                        "body": "I would only suggest doing this if op wants to look an idiot and totally turn her off.",
                        "comment-author": "Key-Sheepherder-92",
                        "replies": [
                            {
                                "body": "I can’t tell if the suggestion is a joke or not lmao",
                                "comment-author": "Bother_said_Pooh",
                                "replies": [
                                    {
                                        "body": "I can’t either tbh, I’m hoping it is but who knows on Reddit 😂",
                                        "comment-author": "Key-Sheepherder-92",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "This is why we can’t have nice things",
                        "comment-author": "Tough_Trifle_5105",
                        "replies": []
                    },
                    {
                        "body": "To add to that ask her to teach you how to cook bc you want to cook for her. It will be a mutual experience. Trust me if both of you can get through being in the kitchen at the same time while having fun and laughing and learning you’ll work out great\n\nThe girls I’ve bonded with the most have been over food. Grocery shopping, cooking together, setting the table, cleaning up. All of these can have sexual overtones and no longer becomes a chore but something you do together. Embrace it",
                        "comment-author": "Crush-N-It",
                        "replies": []
                    },
                    {
                        "body": "This sounds like what I did when I was 25. I had been in a relationship with a guy who never cooked or did chores, because I had a higher standard for cleanliness, so I would clean before he did, and I made really amazing food. After 6 months of living together.\n\nI broke up, and started to date a new guy. He wanted to cook dinner for/with me, and asked me when I arrived if I was a good cook. I stg my mouth reacted before my brain, I just said no. I don’t know how to cook.\n\nThat relationship was awesome. He made all of the food, and the few times I cooked for him, I made sure to tell him how I spent a week perfecting the recipe (which was always something really easy like pasta carbonara) to keep up appearances 😂",
                        "comment-author": "charismatictictic",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "I'm 23, She is 50",
        "post-author": "Introvert2001cro",
        "text": "I matched with an older woman. She messaged me first saying i'm too young and that she's sorry. Minutes later, we found ourselves in a deep conversation with a lot of smileys and similar interests. I couldn't let go of her, she couldn't let go of me. Younger girls would just ghost me or wouldn't bother even texting, but not her... Honestly, I always felt more attracted to older women. They don't play games, know what they want and i love their maturity. I dated once a older woman and it remains the most meaningful connection I've ever felt. Of course, it wasn't without some disapproval of such relationship from my family and public eyes. You can change your thoughts up there, but down there, you can't change what is coming from your heart. I like this woman a lot. What do you think? Should I go for it? ",
        "comments": [
            {
                "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "Just fyi, she was lying to you with the initial apology. It was an ice breaker to test where you stood.\n\nJust know like others said it'll be a fling but also dont get manipulated too much lol",
                "comment-author": "LiquidMantis144",
                "replies": [
                    {
                        "body": "Professional dating sites(chatvisor) would analyze this as: \"Her initial 'apology' was clearly a test - she deliberately matched with you despite the age difference. Their advice would be: Proceed if you wish, but stay cautious. While age-gap relationships can be exciting, they statistically face more challenges for long-term success. Most importantly: enjoy the connection while maintaining your own identity and boundaries.\"",
                        "comment-author": "Just_Marzipan_7001",
                        "replies": [
                            {
                                "body": "I didn’t know about that chatvisor thing!\n\nIt’s indeed a known behaviour that tests boundaries. Same as “it’s a joke”. \n\nBtw love your name. We all just want the marzipan",
                                "comment-author": "SeriousBeesness",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Also her age setting clearly were set to allow it.",
                        "comment-author": "GarbadWOT",
                        "replies": [
                            {
                                "body": "Age setting filters what the user sees. I'm in my 40s and had lots of men in their twenties swipe right and message me. This was Facebook dating and I had my settings 8 years younger/ older.",
                                "comment-author": "Specialist_Hunt2742",
                                "replies": [
                                    {
                                        "body": "The vast majority of dating apps need both people to match for you to message them",
                                        "comment-author": "LegendofWeevil17",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Yeah this. Especially since she had already “liked” his profile, which she only saw because of her chosen age preference settings…",
                        "comment-author": "happysad45",
                        "replies": []
                    },
                    {
                        "body": "Yea she smooth as fuck",
                        "comment-author": "Acceptablepops",
                        "replies": []
                    }
                ]
            },
            {
                "body": "You don't need approval from random strangers on reddit. Do what you want to do.",
                "comment-author": "RandolphE6",
                "replies": [
                    {
                        "body": "Kid just needs validation",
                        "comment-author": "SeriousBeesness",
                        "replies": [
                            {
                                "body": "Kid needs a mom <_<",
                                "comment-author": "Ok-Harpy",
                                "replies": [
                                    {
                                        "body": "Kid seems to have two already, you sure a third would mean improvement?",
                                        "comment-author": "onehandedbraunlocker",
                                        "replies": []
                                    },
                                    {
                                        "body": "And he’s just found her. \n\nStifflers mom.",
                                        "comment-author": "Apprehensive_Cat14",
                                        "replies": [
                                            {
                                                "body": "Lol. Kid is too young to even have heard yet alone watched American Pie 🤣",
                                                "comment-author": "ihavenoclue91",
                                                "replies": [
                                                    {
                                                        "body": "Oh American pie!",
                                                        "comment-author": "spacewhite",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Factual",
                                "comment-author": "Acceptablepops",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "If a younger man goes for an older woman. \"Go for it\"\n\nIf a younger woman goes for an older man \"That's creepy. He's a pedo\" \n\n  \nDouble standards",
                        "comment-author": "SithLordJediMaster",
                        "replies": [
                            {
                                "body": "I saw a post on here like an hour ago about a 50-year old guy and a 22-year old woman and the consensus was that he's a creep.",
                                "comment-author": "MalodorousNutsack",
                                "replies": []
                            },
                            {
                                "body": "Yeah and the \"older man\" in that scenario would be all of 30yo in this case! It doesn't take much to be a creepy old guy grooming a young woman.\n\nI mean, I think a 23yo woman can probably decide whether she wants to be with some ancient old guy or not, but even I'm impressed by the double standard in this post.",
                                "comment-author": "Old_Leather_Sofa",
                                "replies": []
                            },
                            {
                                "body": "Men's overt sexual desire is often seen as creepy unless it's from an attractive man of a similar age to the woman. Women can freely desire any man without shame",
                                "comment-author": "SonyHDSmartTV",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "But he does. He's only 23 and hasn't formed an adult identity yet. lol",
                        "comment-author": "angryturtleboat",
                        "replies": [
                            {
                                "body": "She’s a creeps and a groomer!",
                                "comment-author": "MotorSatisfaction733",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Nevertheless “proceed with caution” is good advice.",
                        "comment-author": "postpartisan-thinker",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Im her age and your age is way too young. My kids age…. \n\n\nThis will be just a fling, having fun for some time. Huge age gap never works long time.",
                "comment-author": "SeriousBeesness",
                "replies": [
                    {
                        "body": "It doesn't work long time all because of our impermanence lol",
                        "comment-author": "Timely-Description24",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I love how the majority of people are like “you’re an adult, go for it if you want.” But if the sexes were reversed most of the comments would be calling the older party a creep, weirdo, immature, unhinged, groomer, etc.",
                "comment-author": "serene_brutality",
                "replies": [
                    {
                        "body": "Yep, a typical reddit moment.",
                        "comment-author": "Yurian888",
                        "replies": [
                            {
                                "body": "Very! Everyone claims they want equality, but this proves they really don’t, or don’t know what that means.",
                                "comment-author": "serene_brutality",
                                "replies": [
                                    {
                                        "body": "Let’s see who the genders behind the “let it happen” comments vs the ones against it  🤷‍♀️",
                                        "comment-author": "bbmarvelluv",
                                        "replies": [
                                            {
                                                "body": "It’s going to be a mix. Guys who are like “pussy!” and women who like the idea of coupling with younger men for fun or to feel sexy, are going be for it. Those against it are going to be a more complicated mix. Guys who have gotten with older women and it turned out badly, or unlucky guys in her age group who can’t compete with younger men, women who can’t land younger men, people who have moms dating men their age, and then just random people who don’t like the idea of large age gap relationships for a myriad of valid or in valid reasons will be against it.",
                                                "comment-author": "serene_brutality",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "I was looking for this comment. \n\nI’ve seen too many posts where the roles are reversed and the advice would be absolutely opposite. \n\nThat being said, in both cases I agree that adults should do what they want and not worry about the age gap if they don’t mind, just be careful of red flags and get out if your gut tells you something doesn’t add up.",
                        "comment-author": "johafor",
                        "replies": [
                            {
                                "body": "I saw enough posts with m30 and f23 and the man got called out for the age diff.",
                                "comment-author": "IxBetaXI",
                                "replies": [
                                    {
                                        "body": "My parents are this age gap, and they met when my mum was 21. \n\nThey had six kids, still together now, happily retired in their 60s and 70s.",
                                        "comment-author": "FriendsPlayWithFire",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "It would all be “muh frontal lobe”",
                        "comment-author": "bndallas82",
                        "replies": []
                    },
                    {
                        "body": "only women are children  on Reddit apparent",
                        "comment-author": "Acceptablepops",
                        "replies": [
                            {
                                "body": "Our girls and women are to be protected. It’s not a bad thing",
                                "comment-author": "Biscuitsbrxh",
                                "replies": [
                                    {
                                        "body": "Our boys and young men need to be advised and mentored.",
                                        "comment-author": "MotorSatisfaction733",
                                        "replies": [
                                            {
                                                "body": "Protect both , mentor both",
                                                "comment-author": "Acceptablepops",
                                                "replies": [
                                                    {
                                                        "body": "This ☝🏼",
                                                        "comment-author": "FriendsPlayWithFire",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I’m 21 and been with a 50 year old, most fun 2 weeks of my life. Absolutely go for it. Don’t get attached though because the age gap is older than you are",
                "comment-author": "anonymous_climber123",
                "replies": []
            },
            {
                "body": "Go a some dates and see if it works. \n\n\nThat's what dates are for. ",
                "comment-author": "noplaceinmind",
                "replies": [
                    {
                        "body": "And buy a case of lube because you might need it.",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I’m 52F and I hit it off with a 36M a few weeks ago. We had coffee because I thought he was early to mid 40s until he told me he was 36. That’s just too young for me—16 yrs! \n\nI can’t. I’ve had my life, in terms of children, marriage, divorce, career, and I am looking at easing into my “twilight” years and want a companion and partner. He (and you) have many years and life experiences; and some of those-having a family-are already done or not feasible for a woman my age. \n\nI think someone else suggested be clear what you both want before you see each other; absolutely do this before you move forward.",
                "comment-author": "Puzzlemethis-21",
                "replies": [
                    {
                        "body": "What if his relationship expectations align with yours then does that change your decision? Just wondering…",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "The two of you need to be honest with yourselves and each other. What are you guys looking to find? Companionship? Relationship? Marriage? A New Family? Anything less than the truth and agreement will only result in someone getting hurt. Past that, wanting anything past companionship requires logistics that grow in complexity with every further step you guys want to go.",
                "comment-author": "darexinfinity",
                "replies": []
            },
            {
                "body": "Ew. I'm not even her age and the idea of dating someone that young feels predatory. It would be one thing if you met naturally, but she was in full control of the age range on the app. She didn't \"accidentally\" do anything, she knew your age when you matched. She was manipulating you.",
                "comment-author": "whenyajustcant",
                "replies": [
                    {
                        "body": "I dated a guy whose deep rooted issues was because he was targeted by much older women since he was 13 :( I was the first person to tell him his dating “record” was not okay…And since he was 18 he would date much older women maybe 15-20 years older… exact scenario like OP too",
                        "comment-author": "bbmarvelluv",
                        "replies": []
                    },
                    {
                        "body": "Agreed",
                        "comment-author": "Puzzlemethis-21",
                        "replies": []
                    },
                    {
                        "body": "They’re both adults. Would I date someone with that age gap? Personally, no. But that doesn’t make this predatory. OP is well above 18.",
                        "comment-author": "captainkaiju",
                        "replies": [
                            {
                                "body": "To a 50 year old, 23 is not \"well above\" 18. OP's brain is not fully developed, they're not likely financially independent, and don't have much real-world experience. Especially compared to someone nearly twice their age: she was more of an adult than OP is now when OP was born.",
                                "comment-author": "whenyajustcant",
                                "replies": [
                                    {
                                        "body": "Brain fully developed doesn't mean cant make decisions though, it just means that you will change the way you think a little bit, when i was 20 I dated a 45 year old woman, i loved it, im almost 40 and I loved that I had that experience",
                                        "comment-author": "Empanah",
                                        "replies": [
                                            {
                                                "body": "I mean, even children can make decisions with undeveloped brains. Doesn't make the decisions good ones, or well thought-out, or beneficial in the long term.",
                                                "comment-author": "whenyajustcant",
                                                "replies": [
                                                    {
                                                        "body": "40 year olds make bad decisions, with fully developed brains, your point makes 0 sense, you probably make bad decisions daily",
                                                        "comment-author": "Empanah",
                                                        "replies": [
                                                            {
                                                                "body": "Yeah, but the younger they are, the worse the consequences are for bad decisions. That 50 year old will be able to walk off whatever happens in this relationship. Even if it goes disastrously: she will walk away from this less impacted than the OP, unless the OP really turns the tables and winds up abusing or scamming her. But the 23 year old could have their future derailed by a 50 year old, even if it's not a long-term relationship.",
                                                                "comment-author": "whenyajustcant",
                                                                "replies": []
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "body": "Did OP say he’s marrying this woman? No.",
                                                        "comment-author": "captainkaiju",
                                                        "replies": [
                                                            {
                                                                "body": "Where did I say he was? Short-term relationships can do long-term damage, especially to the younger person in an age gap relationship.",
                                                                "comment-author": "whenyajustcant",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "no no no speaking from experience you’ll 9/10 regret it in the future . any sane 50 year old doesn’t have the same interest as a 23 year old I know things are rough with girls your age but they’ll come around I’m telling you she’s probably grooming you or just telling you what you wanna hear however at the end of the day your gonna do what you want but just keep that in the back of your head .",
                "comment-author": "Away_Distribution333",
                "replies": []
            },
            {
                "body": "And if this was a 23 year old girl and 50 year old man. The comments would be in reverse. Yall would be saying leave that 50 year old man alone",
                "comment-author": "liquid_Oxygen_",
                "replies": [
                    {
                        "body": "Accountability is essentially extinct",
                        "comment-author": "Outrageous_Reality50",
                        "replies": []
                    },
                    {
                        "body": "Exactly",
                        "comment-author": "WhatAJoker0",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I’ll be real. I dated a 40 yo when I was 25. I wouldn’t recommend dating older women. The Main reason is expect her crash-out to be the likes of which you never seen. When the relationship got bad she decided not to leave civilly or try to repair it, but to instead, make it pure chaos and then leave. I thought that because she was a mother of 4 (with two fathers) she was mature and stable. What it really was, is that she had an additional 15 years of experience on me. She was used to manipulating and enduring hard relationships she created, so the maturity I expected going in was actually bitterness instead. I got to be on the receiving end of that and I got through it pretty well all things considered. (She tried to convince me the be father #3 but I refused).  Regardless I didn’t deserve being put through the wringer at 25, trauma is real. I’ll take a more reasonable crash-out from someone my own age to someone older that is more skilled at detaching than crashing. \n\nTLDR- I dated 15 years older and got a crash-out 15 years beyond my comprehension. Be prepared to endure the consequences of the age gap experience. \n\nYou’ve been warned, it’s not always best to learn the hard way.",
                "comment-author": "TMamba",
                "replies": [
                    {
                        "body": "I understand where you're coming from my friend but that happens at any age Gap or no Gap there's no increased risk. My ex was one year older than me and she made up lies that almost got me in prison and made me lose everything until the police and the course realized it was all wise. Age has no bearing on malicious insanity",
                        "comment-author": "Left-Angle7053",
                        "replies": []
                    }
                ]
            },
            {
                "body": "welcome to paradise, buddy\n\ngrab a drink and get comfortable. Older women are amazing.",
                "comment-author": "Fargraven2",
                "replies": [
                    {
                        "body": "What about the tube of lube, just might need it.",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "lol what😭\n\nif you want to date her or have sex with her, just do it. i think it’s hilarious she said you’re too young though and proceeded to keep talking to you. so… you aren’t too young and she just said that?\n\nfwiw as long as you realize it won’t develop into anything serious (because it probably won’t), i don’t see the big deal. you’re an adult, you arent freshly 18.",
                "comment-author": "pacificoats",
                "replies": []
            },
            {
                "body": "Go for it you miss 100% of the chances you don't take",
                "comment-author": "Inevitable-Path2020",
                "replies": [
                    {
                        "body": "Wayne, dat u?  U messing up ur own quote dou.",
                        "comment-author": "AKL_Ferris",
                        "replies": []
                    }
                ]
            },
            {
                "body": "She knew exactly what she’s doing lol. I’ve been in the same position. I was 18 and she was 42. It’s a fling. She’s got the experience and you’ve got the stamina. Go for it.",
                "comment-author": "Grouchy-Machine-3478",
                "replies": []
            },
            {
                "body": "I’m 40 and the thought of a 23 year old is gross to me. I don’t know what’s with some of these older people thinking this is okay when it’s not.",
                "comment-author": "Sithyonreddit",
                "replies": []
            },
            {
                "body": "Do it. This is your character development arc",
                "comment-author": "fapmeisterflash",
                "replies": []
            },
            {
                "body": "It's gross AF. I'm 40 and would see you as a child in comparison to me, and she's got 10 years on me. She's old enough to be your grandparent. There's nothing normal, healthy, or ok about this. And you're so young that you entirely missed that she in fact is playing games. That whole initial apology BS was a manipulation, and what do know it worked.",
                "comment-author": "fyrelyte11",
                "replies": [
                    {
                        "body": "Are you insinuating that grandma’s don’t need a good railing every now and then?",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Why not? You’re both adults.\n\nI will say, if you want to have kids in the future you should think about that at some point. But there’s no harm in going on a date and seeing how it goes. No point in obsessing over long term stuff when you’re only 23.",
                "comment-author": "captainkaiju",
                "replies": []
            },
            {
                "body": "Try not to have sex with her. You could become addicted.",
                "comment-author": "Man_searching_a_life",
                "replies": [
                    {
                        "body": "How is it any different",
                        "comment-author": "FrostyGeologist3617",
                        "replies": []
                    },
                    {
                        "body": "And she may become pregnant too if he goes raw thinking she can’t.",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Get your flirt on and enjoy your life.",
                "comment-author": "HikerRob1138",
                "replies": []
            },
            {
                "body": "You don’t need to seek approval dude. Follow your heart. I did when I was your age and I’m sure glad I did",
                "comment-author": "iamatwork24",
                "replies": []
            },
            {
                "body": "Nice.",
                "comment-author": "SaiyaJinPrId3",
                "replies": []
            },
            {
                "body": "Go have fun don't worry about what haters think it's legal you're both consenting adults.",
                "comment-author": "darky14",
                "replies": [
                    {
                        "body": "Had have her take you for the thrill of your life to her pound town.",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "As long as you know you won’t be able to have kids with her go for it.",
                "comment-author": "eowynladyofrohan83",
                "replies": []
            },
            {
                "body": "Of course. You both have a lot to offer each other. Don't you dare think twice about it!!",
                "comment-author": "ExcitedGirl",
                "replies": []
            },
            {
                "body": "Look man, this kind of thing is cool for a fling or something casual, but I can already see you're investing too much into it. It can't last in the long term and deluding yourself into thinking otherwise will only hurt you both. \n\nI get it, girls your age are terrible. All ego and entitlement and overvaluing themselves. But there are good ones or there and you'd be making a huge mistake if you stopped looking. \n\nOlder women are easier. More confident, laid back, and less apt to pay games. Enjoy your time  and learn from her. She'll give you a head start both in and out of the bedroom",
                "comment-author": "Rooster0778",
                "replies": []
            },
            {
                "body": "Go for it! And don’t listen to these people saying don’t get attached. If it works out it works out, and if it doesn’t then it doesn’t. But strangers on the internet can’t know one way or the other",
                "comment-author": "JavaJoyGamer",
                "replies": []
            },
            {
                "body": "Why not?",
                "comment-author": "tyrwlive",
                "replies": []
            },
            {
                "body": "Although this might feel good now.. as you age the gap could be uncomfortable. When you are 30 she will almost be 60. When you are 40 she will in her 60’s. Idk. I guess it could happen.",
                "comment-author": "rabbitales27",
                "replies": []
            },
            {
                "body": "The only thing I'd worry about is that if you end up actually getting together and then getting married, there's a good chance she will die way sooner than you, and you'll have to start over again in your 30s or 40s. If you're willing to take that risk than I'd say go for it.",
                "comment-author": "cs342",
                "replies": [
                    {
                        "body": "LMFAOO um okay ? make sure she puts you in the will i guess 😭😭",
                        "comment-author": "Away_Distribution333",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Ten years ago I was 23 and I dated a 50 years old.  Honestly best sex I've ever had.",
                "comment-author": "missingnoscorpio",
                "replies": []
            },
            {
                "body": "Hook in bro",
                "comment-author": "Dryspell54",
                "replies": []
            },
            {
                "body": "She must have her age set to your age so you’re not too young for her, she just wanted to make sure you’re on board",
                "comment-author": "frdoe1122",
                "replies": []
            },
            {
                "body": "I'm a 60 year old woman. Come on over to the dark side. Lol",
                "comment-author": "One-Internet-1982",
                "replies": [
                    {
                        "body": "No, it’s the enlightenment side for sure!",
                        "comment-author": "MotorSatisfaction733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I would tell you this, this is harsh, but man or woman, there’s a reason they’re on the dating apps at 50. That in itself is a HUGE red flag unless valid reasons like divorce, death etc but someone that has been in the market for 30yrs and hasn’t had some sort of next level commitment like marriage or even engagement or a long long relationship (like 10yrs) is a walking red flag. \n\n\nThe age gap is also very wide. I had a thing with a 40yo when I was 24 and it was fun until it wasn’t. I was meeting her friends and they were legit older looking. My mom was 12yrs older than this woman. So obviously the age gap caught up with us and we ended. So enjoy her, she’ll prob be so much fun and will care for you better than any woman you’ve dated have, it’ll almost be like a mom figure, but don’t get too attached",
                "comment-author": "No_Anteater8156",
                "replies": []
            },
            {
                "body": "It's ok because she's a woman or something. \n\nNot reading the hypocritical comments.",
                "comment-author": "NorthernRX",
                "replies": []
            },
            {
                "body": "Dude, reddit will call anything greater than 2 days of difference in age, an \"age gap\". Just go have fun, it's not illegal. Don't listen to reddit popes",
                "comment-author": "Difficult_Valuable_4",
                "replies": []
            },
            {
                "body": "See all the replies you get? Its worst if its IRL. I am 35 lady and I get numerous young men aged 19-25 wanting older women. A lot of us older women do not like to be judged in relationships. We want a serious one. If we accept young men, people will call us the young guy's Sugar Mommy. And will judge us as toying younger men to feel \"young\". We really dont like that.\n\nWhats worst is that we fear we are growing old with wrinkles compare to the younger man. We would fear that you will look for younger women and will either cheat on us or leave us.....\n\nThese are the most common fears we \"older\" women would face. We want a serious relationship. We dont want to act like old men who wants younger women to flex and fool around... We want real commitment. \n\nI'm sorry but you need to let her go. For her sake. The reason she hasnt let you go is because she havent met you in person. Once she saw you IRL, she will have second thoughts. \n\nIf you want someone like her, find a grandma girl. These are girls who acts like a grandma. Or a mommy girl. These are girls who act like better than their mom at caring for the family, and are always strict about family values. \n\nI wish you luck on your search.",
                "comment-author": "Yenohdia",
                "replies": [
                    {
                        "body": "It seems you are talking about a female I know. She told me the same things.",
                        "comment-author": "Snoopynooby007",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I believe you should do as you wish. You don’t need anybody’s approval.  I wish you the Best and that she is the one.",
                "comment-author": "SimplySeano",
                "replies": []
            },
            {
                "body": "It's your decision, as you're both adults. \n\nI must admit that there might be some challenges. You're both at very different stages of life, and aligning physically and mentally would be extremely rare in an age discrepancy like that.",
                "comment-author": "HidingInPlainSite404",
                "replies": []
            },
            {
                "body": "Find out her MBTI type then look for that type in a girl your age range. She could be an N type (talking for hours/ long conversations).",
                "comment-author": "___Catwoman___",
                "replies": []
            },
            {
                "body": "She’s gonna be the best sec of your life and it’s gonna work for a few months, but she will get very shy being in public with a young man. So it’s not going anywhere long but it will be a great ride.",
                "comment-author": "benchpresswizard",
                "replies": []
            },
            {
                "body": "You're not mature enough for a relationship with this huge age difference. She shouldn't have matched with you from the beginning, and that apology was clearly fake. You gotta ask yourself why she's interested in a very young person like you !",
                "comment-author": "NotSoFriendlyAccount",
                "replies": []
            },
            {
                "body": "Go for it bruh",
                "comment-author": "ludacrisbridges23",
                "replies": []
            },
            {
                "body": "That's way too creepy.",
                "comment-author": "Gaelenmyr",
                "replies": []
            },
            {
                "body": "My friend stated that age gaps are a fling if both agree to have fun.\n\nIt usually doesn't work because of the gap and the different phases you are in life.\n\nYou still have a lot to learn and go through. She had already experienced what you are yet to experience.",
                "comment-author": "AdventurousBall2328",
                "replies": []
            },
            {
                "body": "Feel free to private message me if you like but long story short go with your heart and not what public receives. Like any relationship keep regard of a course and that has nothing to do with age. I have seen equally abusive and manipulative relationships begin of why age steps no eggs gas male female Etc so that doesn't matter to be honest. I speak from personal experience. Almost the same scenario, I am in my 50s and my wife is in her mid-20s. I have been divorced for many years was a single father for many years because of that. I had no interest in never beginning another relationship. I casually dated a few girls that always been friends for it but they knew I had no intent for a relationship or even a one-night stand or present benefits as my past marriage ended up with severe abuse toward two out of three of our children. That and realizing that she lied about loving me from the start and admitted to what I was realizing that she was just using me from the beginning on for a variety of reasons. While I still trusted people friends Etc to the same extent that I always had, I developer this taste the relationships to the point that I thought they were not needed at least for me. I had not become cynical and I didn't portray my thoughts and opinions on to others but that is Where I Stood and I was fine being single. I had my volunteering my work my dogs visiting with my adult kids Etc. I met my current wife when she was 19 and I was in my late 40s. We were volunteering at the University which I had frequently done for the last 5 or 6 years and that was the first time we had met and we were on the same project. We hit it off from the beginning I got a long extremely well from day one work together well even joked some and talk about our lives a little bit but nothing personal. The project was about a week long and after that we went our separate ways as friends but did not keep in touch at all didn't even exchange phone numbers or anything. A few months later we both ended up volunteering on a project together again and this was not even at the University was out in the public community. We recognize each other instantly and ended up being placed on the same team once again. This project was almost a month long and we continue talking to each other as if it was never a break and communication. No offense against her but the first time we met at the university is volunteering I didn't pay any attention or mine to her at all other than just chatting with a project teammates. You're the end of the month, we both knew we wanted to ask each other's phone numbers but were leery of doing it as we both thought we were leading the other person wrong about wanting to continue our friendship. When there was about a week left to the project I had mentioned to her that if she would like I could give her my phone number in case you wanted to keep and talk to each other. She smiled and said she was so glad I asked because she's been wanting to exchange numbers since about halfway through the project but was too nervous to do it because she thought she was being stupid but I wouldn't be interested in keeping friends and who are asap. It seems numbers and talk on the phone and met up a number of times before we both started realizing that there was more than friendship between us and that it was on both sides. The story gotten too long so obviously over time over a few years things evolved they dated gotten days and then got married last year. We have had much interactions at the public and their reaction lungs from not feeding us any different than any other trouble to assuming we're father and daughter and then usually very apologetic and interested and they discover it's not that kind of relationship. All the way to some people just looking and staring or giving dirty looks or straight out the other end of the scale where they pull her aside after she's okay and does she want a safe place to escape to or say that she needs to leave me because I'm just grooming her for sex trafficking her. Having known each other for a number of years now he's gotten to the point where we can laugh the bad stuff off unless they continue then one of us or both usually chime in to end it politely and professionally with the other person. I would have so sick situation that you're in right now the same way I would with anything regardless of the relationship regardless of an age Gap. Treat it as you would anything else in life. If it's something that you're passionate about and want to pursue it and as long as it doesn't hurt the other person their self or anyone then nothing's just standing your way. We have been together, counting from that month-long project the second time we met until today a little over 6 years and we have very much in common always has and at the same time those things that she has wanted to do or I have wanted to do on my own and not together for example going on a two or three types backpacking camping Expedition alone or something she had wanted to do after she was going through some extinct stresses in her life and ask me how I dealt with all things I've been through and I explained to everyone's different of course but to me nature Made Me much more relaxed as allowed me to pray better and feel closer to conversing with God. She tried it and it helped you so much but it was two weeks she was up and decided to go. I knew the area she was going to and she would text me twice a day sometimes three times a day to let me know if she was okay. I didn't text her myself out right first as not for the server. She came back I totally different person in a good way. What I'm trying to say is approaches like any relationship with caution respect and lost if it is there on your end and expect those same things from her and back each other up when someone in the public eye whatever family friends or strangers judgmental in some way. Have a code with each other where you'll handle the issue the cells but if you want help from the other person then you'll note about each other up. Anyone who's bothers to read this I apologize for his life and I also apologize for anything that may not make sense as this entire post was voice texted as I'm at work right now. Again to the op if you want to message me feel free to anytime",
                "comment-author": "Left-Angle7053",
                "replies": []
            },
            {
                "body": "There's a song for that. It's called Older Women. It's country.",
                "comment-author": "Nimrowd2023",
                "replies": []
            },
            {
                "body": "If this was the other way round. Reddit would be saying \"he's a predator\" \"he's grooming you\" \"run, don't look back\"\n\nInteresting when it's switched about the advice becomes \"have a good time\" \n\n\nI'd say this woman is matching with younger boys intentionally, she's 50 and knows this wouldn't work as a \"relationship\" so she's grooming op for sex or an online fling. She's over double his age and he's only a few years off being a teenager. \nAs someone who was manipulated by an older woman when I was young, I'd say op should question why this lady isn't interested in men her own age",
                "comment-author": "FriendsPlayWithFire",
                "replies": []
            },
            {
                "body": "There’s nothing wrong with that",
                "comment-author": "sex_drugs_polka",
                "replies": []
            },
            {
                "body": "Always go for it.",
                "comment-author": "asburymike",
                "replies": []
            },
            {
                "body": "Yeah you should go for what you want. You're both consenting adults.\n\n\nIf either of you change your mind at some point, you can always leave. Just like any other romantic relationship ",
                "comment-author": "GamerGuyHeyooooooo",
                "replies": []
            },
            {
                "body": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
                "comment-author": "graemo72",
                "replies": []
            },
            {
                "body": "bro",
                "comment-author": "CheapHero91",
                "replies": []
            },
            {
                "body": "Bro you sound certain of yourself. That's all the approval you need. Hit that shit",
                "comment-author": "Objective-Speech-932",
                "replies": []
            },
            {
                "body": "“Hey! I’m having fun riding this ride.” \n\n“No, that ride is not for your age.”\n\n“Fuck off, I like it’s a small world. Who the fuck are you to try and ruin fun?”\n\nA special kinda adult likes it’s a small world, and fuck everyone else who says don’t ride it because “reasons”. Enjoy your ride dude.",
                "comment-author": "changework",
                "replies": []
            },
            {
                "body": "I feel you should do what brings you happiness",
                "comment-author": "CounterShot2165",
                "replies": []
            },
            {
                "body": "If the genders were reversed, people would be screeching how this is creepy, you’re being talked up, run away, etc etc.",
                "comment-author": "Luci_the_Goat",
                "replies": []
            },
            {
                "body": "Send it!",
                "comment-author": "lowandslow86",
                "replies": []
            },
            {
                "body": "It will work out really well",
                "comment-author": "HegemonyOfDichotomy",
                "replies": []
            },
            {
                "body": "That’s called hagmaxing",
                "comment-author": "grayparrot25",
                "replies": []
            },
            {
                "body": "No no no. You're too young. She has a problem. That's crazy to date a kid. 27 years old of difference. Gosh.",
                "comment-author": "Designer-Pattern-430",
                "replies": []
            },
            {
                "body": "Double standard. Run away.",
                "comment-author": "Tinkasong",
                "replies": []
            },
            {
                "body": "Run",
                "comment-author": "Deep_Analyst_4271",
                "replies": []
            },
            {
                "body": "Bruh, she's 50.",
                "comment-author": "shp182",
                "replies": []
            },
            {
                "body": "It’s gonna be the best time of your life, then immediately the worst time of your life. \n\nThese things are not mutually exclusive. \n\nGo for it, enjoy it. BUT SHE WILL FUCKIG WRECK YOU EMOTIONALLY.\n\nBeen there done that, and it was like 5 years her senior on paper, but probably like 20 irl experience….0",
                "comment-author": "MyOthrCarsAThrowaway",
                "replies": []
            },
            {
                "body": "They do play games. They’ve been playing games LONGER than you’ve been on this planet. \n\nAt 50, it’s not games. That shit is embedded. So if you’re cool with that, proceed",
                "comment-author": "MyOthrCarsAThrowaway",
                "replies": []
            },
            {
                "body": "Younger woman are more loyal than older woman. Younger men are less loyal than older men. Its an opposite thing",
                "comment-author": "TechNerdinEverything",
                "replies": []
            }
        ]
    },
    {
        "title": "GF is completely different around friends",
        "post-author": "RisingFlame0262",
        "text": "I (23M) met my GF (23F) friends for the first time today. It was cool until we sat down and talked and she seemingly became another person. She raised her voice at me, said how lucky I was to be with her and slight jabs…all while I was treating them. Also minor things but her friends asked if I rent or have my own house? I have a decent job/ salary for my age but to be sized up financially by someone I’m not even dating and make significantly more than seems weird. \n\nI played it cool and we enjoyed the rest of the night but I confronted her afterwards to which is blamed on being hungry and somewhat apologized. I don’t think this is enough and seriously doubting how she really feels about me. The words in private did not match this public stunt with her friends (but it does with her family). Help, what should I consider doing? \n\n",
        "comments": [
            {
                "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "How long have you been dating? I would say you're still finding out who she really is. \n\n\nThe house question is weird. There are so many reasons to not buy a house as a 23 year old regardless of money, it's very bizarre to ask. \n\n\nPay attention to who she is friends with, as that is more of a tell than her \"best behavior\"",
                "comment-author": "JamedSonnyCrocket",
                "replies": [
                    {
                        "body": "It’s been almost a year, the friends all in different cities since we met in college- so they came back for a party.\n\nYeah, I thought the question was weird too- I’m looking at her sideways now.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "A year?  That makes it much worse.  I could see if it were new and she was nervous around her friends.  But you should be a priority by now.  I'd let her know that you're having a hard time taking your relationship seriously after that.  She should have been worried about what you thought of her friends, not the other way around.  If she plays it off as no big deal, or gaslights, bail.",
                                "comment-author": "Uncal_Thal",
                                "replies": [
                                    {
                                        "body": "Yeah, i also picked up on that vibe. She was probably trying to look cool and wanted her friend’s approvals in person. Apparently I had the approvals already based on her descriptions of me but God knows what she said.",
                                        "comment-author": "RisingFlame0262",
                                        "replies": [
                                            {
                                                "body": "Yeah I did something dumb like this once when I was 6",
                                                "comment-author": "aVarangian",
                                                "replies": []
                                            },
                                            {
                                                "body": "You should never ever put up with disrespect from anyone. Was there alcohol involved?",
                                                "comment-author": "FormerBTfan",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "body": "Beat me to it but absolutely factual, op also needs to prepare himself for fake apologies and fake act right after he tells her this. A lot of people just act right till they can go back to bs and it’s  usually performative",
                                        "comment-author": "Acceptablepops",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "Trust your gut ",
                                "comment-author": "JamedSonnyCrocket",
                                "replies": []
                            },
                            {
                                "body": "Oof, her mask is starting to slip and you’re seeing the real person she is. Sorry dude.",
                                "comment-author": "cup_1337",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "You become who you spend your time with. Yep",
                        "comment-author": "jmorgan0527",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Coming from a woman, this girl and her friends sound like superficial bitches! Your gf was out of order (hunger might make someone cranky, but that was way past cranky) and her friend was rude for asking you if you rented/owned. \n\nAlso how many 23 yo's own their own home 🤣 fuck does this girl know?!",
                "comment-author": "Majestic-Hunter-8403",
                "replies": [
                    {
                        "body": "Yeah…I declined going out with them again. I thought it was funny too but they weren’t joking when they asked. \n\nMy GF is in panic mode now, hearing sorry and all things compliments in private now mean nothing to me.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "These are the same kind of friends who might encourage her to cheat or keep shopping around for some one more \"deserving\" of her.  Its time to move on.  She will totally pick her friends over you.",
                                "comment-author": "Mother_Assumption925",
                                "replies": []
                            },
                            {
                                "body": "Just letting you know this is who she is. And it is way easier to find a new girl than to change and humble your current one",
                                "comment-author": "Biscuitsbrxh",
                                "replies": []
                            },
                            {
                                "body": "Yeah I didn’t even read this post or many of the other responses before my last comment. It sounds like she hasnt admitted to herself and her friends how much she likes you. Her behavior around her friends has to support that instead of how much she actually likes you.",
                                "comment-author": "rysfcalt",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I'd be extremely cautious ⚠️ moving forward this is a huge red flag. I mean I'd have a long sit down with her and explain how you're willing to take that as a one time situation but that can't happen again. She treated you poorly and put you in a bad position. I don't think this should necessarily be a relationship ender but it's gotta be something that she understands absolutely will be if it happens again.",
                "comment-author": "GWPtheTrilogy1",
                "replies": [
                    {
                        "body": "Yeah. I’m trying to take a wholistic view and not make a spontaneous decision. I am pretty PO’ed and she knows. \n\nI just didn’t want to embarrass her so I waited until everyone was gone to confront her.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "I respect that. I mean as you said, this came out of left field and you didn't expect this type of behavior from her, so I get it. But it's definitely important to express your concerns and nip that shit in the bud like she's gotta know that's unacceptable in the future.",
                                "comment-author": "GWPtheTrilogy1",
                                "replies": []
                            },
                            {
                                "body": "She obviously fucked up but I feel like you should give her another chance now that you called her out on her shitty behavior. She might learn from her mistake now. I feel like you shouldn’t ditch someone because they acted poorly one time. If it becomes a pattern then move on.",
                                "comment-author": "koolex",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "She sounds like someone with narcissistic qualities or something. She's fake.",
                "comment-author": "Bossoholic",
                "replies": [
                    {
                        "body": "She’s nice around her family and in private with me - but her around the friends really came out of left field. I’m still shook.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "That's her true colors. I had a girl similar to that. Everyone is more filtered around family, but if she's willing to drag you through the mud just to make herself look good (at your expense), and take zero accountability, like saying she \"was hungry\" (manipulation), and her friends were sizing you up already...yeah. She was acting like this before the meeting w friends in private with her friends.",
                                "comment-author": "Bossoholic",
                                "replies": []
                            },
                            {
                                "body": "The behavior suggests she’s not ready for her friends to see how much she likes you yet. My theory is she actually likes you a lot but may be a bit in denial? If I had to take another stab, I would guess she and her friends are very conventionally attractive?",
                                "comment-author": "rysfcalt",
                                "replies": [
                                    {
                                        "body": "She is, I don’t find her friends particularly attractive.",
                                        "comment-author": "RisingFlame0262",
                                        "replies": [
                                            {
                                                "body": "That kind of supports the idea that her friends may have expected her to date someone maybe more conventionally attractive? But your gf is very attracted to you so that’s what’s important. Sounds like she feels she needs her friends’ approval. I think she recognizes she’s lucky and hopefully with time also cares less about her friends’ approval.",
                                                "comment-author": "rysfcalt",
                                                "replies": [
                                                    {
                                                        "body": "She’s told them that I’m attractive and sends them pictures of me all the time - which slightly annoys me.",
                                                        "comment-author": "RisingFlame0262",
                                                        "replies": [
                                                            {
                                                                "body": "Well then maybe she’s downplaying how much she likes you bc she doesn’t want it to seem like she likes you more than you like her?",
                                                                "comment-author": "rysfcalt",
                                                                "replies": [
                                                                    {
                                                                        "body": "Regardless, it's shitty behavior and she deserves to be called out for it. OP won't make a right or wrong decision if they continue, but at least it's clear that it isn't okay.",
                                                                        "comment-author": "RealisticRun4299",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "body": "This what shes told you or more than just seeing them in passing youve actually read these texts?",
                                                                "comment-author": "Mother_Assumption925",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Her friends sound toxic and if I were a betting man, I would put my money on her eventually breaking up with you at the urging of her friends if she keeps them in her life. I think you should cut your losses now, but I can understand any man who would want to try and talk about this sort of thing with his girlfriend.",
                "comment-author": "witblacktype",
                "replies": [
                    {
                        "body": "Yeah her friends have their own relationship problems to deal with- ours “had” the least drama so I wouldn’t be surprised. \n\nI talked it her before posting on here- she’s desperately trying to regain normalcy. Said she would fix it if I came to another party with her family which I declined going. Her family isn’t the problem so that solution makes no sense to me nor am I going for it. \n\nHer family told me she’s a handful a few days ago - so now I’m seeing it for myself.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "> Her family told me she’s a handful a few days ago\n\nThat right there is pretinent information, personally I'd probably dip out after being treated like that, especially just after a year.\n\n1) Lack of respect on her behalf\n2) Friends are super weird\n\nGood luck",
                                "comment-author": "Bunstonious",
                                "replies": []
                            },
                            {
                                "body": "She may be great, but whether we choose to accept it or not, we are partially the product of our environment. There’s a reason we were told as children to pick our friends lest they pick us. I wish you the best regardless of what course of action you decide is best. I will still reiterate that I think her friends are the problem.",
                                "comment-author": "witblacktype",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "\"She raised her voice at me, said how lucky I was to be with her and slight jabs…all while I was treating them.\"  As soon as she got around her friends... MEGA red flag.  She doesnt respect you and her friends opinion of her being boss is more important than your relationship.  Dump her.  This is going no place but you being taken advantage of.  This is the real her and she couldnt keep up the act around them.  She's not at all the one, move on.",
                "comment-author": "Mother_Assumption925",
                "replies": [
                    {
                        "body": "They were all at different times, she raised her voice when being “hungry”, and after dessert said how lucky I was. Honestly I thought she was joking until she wasn’t. \n\nYeah that’s what I was afraid of but I came to that conclusion- her friends opinion is more important than mine.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "Dont make excuses for her, she and her friends will do that well enough on their own.  Her choices were tactical.  Shes calculated that shes important enough to you that she could do this and youd let it slide or eventually drop it.  When and if you do she'll know she was right and it wont stop and may expand into other areas.",
                                "comment-author": "Mother_Assumption925",
                                "replies": [
                                    {
                                        "body": "You’re right, thank you. 🙏 \n\nMaybe I should be more confrontational in public- I was thinking not to embarrass her but clearly it we weren’t on the same page. \n\nWe’re definitely not the same anymore and she’s feeling it. I feel numb on the other hand, not sure if I just wasted my time or learned valuable life lessons.",
                                        "comment-author": "RisingFlame0262",
                                        "replies": [
                                            {
                                                "body": "If you actually learned a lesson, it wasnt wasted time.  Wish you luck.",
                                                "comment-author": "Mother_Assumption925",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Okay you found out you have been the focal point of some very pointed conversations especially due specifically  to your worth to her. No matter what she acts and treats you badly in certain company. That inconsistency for me doesn't track at all and sounds like she masks with you or them either way you saw her face and if you can't tell which one is her idk doesn't sound good. But baseline you deserve to be not made the poking totem for these ladies to evaluate and estimate a value for you for their friend if she can't uphold your confidence in those moments. \n\nIt's like she is at once trying to exert some power of control over you in front of them and also parade you in front of them for their ribbons is how I'm envisioning this whole scene. Wild.",
                "comment-author": "C0113TTA",
                "replies": [
                    {
                        "body": "Pretty much what I told her, you’re on the money. The face I usually see is much more calm, sweet, lovey-dovey- and constantly seeking my approval. \n\nI didn’t ask her to be like that but that’s what I’m used to - so assuming it goes by respect- I would be under her friends.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "It sucks so hard to know that. But yeah- this is how so many chicks operate these days. This is a lifestyle, it can be almost a cult. I'm solid friends with a lot of married couples and I got to say not one of my best friends holds my confidence higher than their spouse- even if I've been around a lifetime longer than their chosen life partners and I don't expect that of them. To me that's insanity but it is by and large basically normalized, an expectation even. Sorry you experience this. It's crazy",
                                "comment-author": "C0113TTA",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "That's a red flag. If it were early in a relationship I would bail. One year is kinda in between, though. How connected and emotionally invested do you feel? If you feel the relationship has legs, try talking with her and judge by her reaction. Is she dismissive or defensive? Or is she curious about your feelings and introspective? ... The difficulty is that you don't know which (or even both) is the mask - her with you or her with your friends. If you stay together, she needs to be on notice that if she acts like that again it will greatly degrade your trust & connection.",
                "comment-author": "Lazy_Guava_5104",
                "replies": [
                    {
                        "body": "We were on  the “I love you” basis- now I’m questioning that. It’s a bit rocky for me right now but she’s not defensive. Sure she made a dumb excuse but she apologizes relatively quick. \n\nThough there’s apologizing and actually believing and following through with your actions.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "Right - my ex would give a fast apology without really acknowledging anything as one of her ways of ending uncomfortable conversations.",
                                "comment-author": "Lazy_Guava_5104",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "A lot of people seem to be on the dump train, but this is more warning sign of a red flag rather than red flag per se in my personal opinion\n\nYou're both 23, you're young, and you're still learning\n\nLearn your boundaries, let her know them, and if it is a clear pattern, then it's probably time to cut your losses",
                "comment-author": "Jimshorts",
                "replies": [
                    {
                        "body": "If it were much earlier on,  I probably have left by that. But, we’ve had a lot of good times- I’m not inclined to up and leave at any problem or bump. \n\nI’ll play it by ear but I’m hoping she’s not this way again- especially since we had a sit down already.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "💪",
                                "comment-author": "Crush-N-It",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "This is a solid red flag, not a warning of one.",
                        "comment-author": "Mother_Assumption925",
                        "replies": []
                    }
                ]
            },
            {
                "body": "This is the first tell of narcissism. Leave as soon as possible.",
                "comment-author": "SpartanLazer",
                "replies": []
            },
            {
                "body": "Hey OP. I dated a girl for 5 years who behaved the same way as you described yours. End result, it was a massive turn off for me and the relationship failed. Not saying that yours will, but as others have suggested, it’s is a massive red flag. And I agree. What I’ve come to realize is that my ex was so interested in keeping the relationship she was willing to hide who she truly was with me, but when it came to her friends and family, she turned into the most hateful, rude, and ignorant woman I had  ever met in my existence. She was the same age at the time as your gf now. I strongly recommend moving with a watchful eye and try not to get overly attached. Chances are high that this girl may have some deep rooted insecurities and may covertly have an undying need for validation. How she goes about it tactfully depends on the group. Again. Move with caution.⚠️",
                "comment-author": "Wandering_phoenix_89",
                "replies": []
            },
            {
                "body": "People forget that girls in groups are as vile as guys in groups.",
                "comment-author": "NotRealWater",
                "replies": []
            },
            {
                "body": "Trust your gut. If someone loves you they won't disrespect you in front of friends.",
                "comment-author": "winclaw",
                "replies": []
            },
            {
                "body": "Trust your gut. Plan an exit. Her friends are a reflection of her. She’s on her best behavior around you. Same thing happened to me. Just ended things.",
                "comment-author": "jaximointhecut",
                "replies": []
            },
            {
                "body": "Abort. Move on. Red flag.",
                "comment-author": "Aziratov",
                "replies": []
            },
            {
                "body": "it's purely an ego play. her friends probably make her feel insecure with little jabs here and there, maybe not even aimed directly at her. but then she takes those insecurities, and postures in front of them to show how in-control she is of you. that she's a boss bitch, that you're lower than her so you should consider yourself lucky to be her presence... all as a means to perform and build an image in front of her friends of your relationship so she doesn't get judged by them for being submissive \"to just a man\" or whatever.",
                "comment-author": "octobersoon",
                "replies": [
                    {
                        "body": "100% this. It’s so sad what insecurities can do to us and how they lead us to hurt others",
                        "comment-author": "classthecass",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Not trying to play devil’s advocate, but I have heard similar feedback from my friends’ partners about me (I don’t think anyone is good enough for them). \nAnd 23 can be such a weird age financially, you’ve got some friends living with parents and barely scraping by while others are becoming landlords, so maybe they were just trying to figure you out. Also I think people still have more friends at 23 than they will at 25, which is to say y’all are so young and have so much time to realize that some of your friends might suck. \nI think the bigger red flag is blaming her personality switch on being hungry. 23 is young but not too young for accountability.",
                "comment-author": "khaleesikt",
                "replies": []
            },
            {
                "body": "Wow.\n\nYour GF needs to wake the fuck up and realize what raging b!Tches her friends are.\n\nYou're young but you're not too young to understand the consequences of friends who are shallow assholes---and her allowing them to talk to you like that is gross AF.\n\nHungry? Really? that was her excuse? What is she, 5 years old? \n\nAt your age, most people are literally up to their eyeballs in student loan debt and they're asking if you own a house? Not to mention you DO NOT EVER ask someone a question like that let alone upon first meeting them.\n\nYou need to have a serious sit down with her and discuss WTF was going through her head.\n\nShe's choosing to stay friends with these shallow losers---and being hungry doesn't explain that. You have every right to expect her to explain WTF she's thinking and you deserve way more of an apology.\n\nYou've been dating for a year so it's very odd that you've never seen this side of her before, but she still needs to explain it, well, and own it then apologize for it.",
                "comment-author": "LucyShoes2222",
                "replies": [
                    {
                        "body": "Yup! My thoughts exactly, but to answer your question I havent seen this side since I just met her long time college friends - they live in different states. \n\nI’m still stunned since it’s the first time this has ever happened to me.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "Was she not horrified by their behavior? I think we all have friends who act differently than us but usually we apologize profusely for them and want people ahead of time that they may be a lot to take.",
                                "comment-author": "LucyShoes2222",
                                "replies": [
                                    {
                                        "body": "I haven’t talked to her about her friend’s behavior yet - we were all eating with her family too. I confronted her about what she did. \n\nI was prompted that one of her friends was questionable but she was mostly quiet. The one she had raging reviews about was the one asking those questions.",
                                        "comment-author": "RisingFlame0262",
                                        "replies": [
                                            {
                                                "body": "That's....even scarier.\n\nShe idolizes someone who's rude and gross? Yikes.",
                                                "comment-author": "LucyShoes2222",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You can tell a lot about anyone by who they keep as their friends. \n\nIf she threw you under the bus, she’ll throw you under the bus again. \n\nSince you’ve been dating a year, I would at least tell her exactly what you posted here and how it made you feel. If she’s really remorseful and values your feels and says she’ll do what she can I make up for it, perhaps it’s forgivable. If she’s dismissive of your perspective… well you know what you need to do.\n\nBut do you really have a partner if she’ll stab you in the back and thinks less of you? Sounds like she’s a possible misandrist.",
                "comment-author": "Curuwe",
                "replies": []
            },
            {
                "body": "That's my ex, not in entirety, but she used to be a very different person in front of guests. She almost made fun of me in front of my colleagues. That's why she is ex.",
                "comment-author": "lastbenchboy",
                "replies": []
            },
            {
                "body": "Sorry to say but this is your canon event. Use this as a lesson going forward.",
                "comment-author": "flaydagawd",
                "replies": []
            },
            {
                "body": "Remember the saying that goes something like.....show me your friends and I'll tell you the kind of person you are. ........ I think that's all you need to hear.",
                "comment-author": "Foreign_Guess_5002",
                "replies": []
            },
            {
                "body": "Listen mate, you have stood your ground with her now and that's a good job, next time stand your ground in front of her friends too without getting angry of course.\n\nYou are only 23, you can find people who respect you and you can build yourself a great future. If she constantly shows disrespect, stand with your values and stay strong.\n\nOne thing though, relationships are hard sometimes so see how she acts after apologizing and also make sure she knows her friends are toxic. She can decide who is more important to her, you or her toxic friends.\n\nGood luck and always here as a friend!",
                "comment-author": "VX_Eng",
                "replies": []
            },
            {
                "body": "If I were in your shoes, I’ll forgive her if it feels genuine this one time. I’m 34 now and 23 years old seems super young to me. Some people are still figuring themselves out. It sounds to me like the girls might’ve been sizing you up and shit-testing you from 10 different angles. I highly doubt they were trying to destroy you bro. You’re pimping dawg. That’s why they wanted you to come back because you didn’t fold on their bullshit.  As far as your gf, you gotta make it known that is not ok coming from her and that if she doesn’t make an effort to change that then you’re no longer happy being with her. Respect",
                "comment-author": "Sendthatin",
                "replies": [
                    {
                        "body": "Preciate it, she’s asking how she can make it up.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "Of course she is.  Her friends arent standing around any more are they?  She wants to know how she can make it up, get em all conference called and on speaker phone and have her tell them all that the behavior wasnt ok, they shouldnt have been like that and she never should have acted like she did.  I'm sure viewing her texts with her friends about you might be eye opening as well.  I'll get popcorn and watch her excuses not to.",
                                "comment-author": "Mother_Assumption925",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You mention that you haven't spoken to her properly yet. Do that first before making any decisions. See if she listens and then changes her behaviour.\n\nIf you're a mature person, you will give your partner a chance to right the wrongs. \n\nThis isn't egregious like cheating. Some people are like this around friends. The people who are saying this is how she *really* is haven't dated around much. Some people are their true selves around friends, but others are actually exaggerated versions of themselves. They try to appeal to their friends, pretend they don't like you as much as they really do to protect themselves, or rib you because that's what the friend group does.\n\nLooking at the comments here, it's clear that people have a lot of baggage they need to work on before they give out \"advice\".\n\nYour GF is in the wrong, but to have a long-term relationship, you need to be able to bring things like this up and work through them, if both people are open to it.",
                "comment-author": "youvelookedbetter",
                "replies": [
                    {
                        "body": "Understood, thank you for the neutral response.",
                        "comment-author": "RisingFlame0262",
                        "replies": []
                    }
                ]
            },
            {
                "body": "That’s who she really is or closer  to who she is , idk why women like to finish their men around friends then be surprised they become single later.\n\nIf you did any of that shit to her while your friends were there you’d have been hard checked at home or flat out single encouraged by friends to leave yo ass",
                "comment-author": "Acceptablepops",
                "replies": []
            },
            {
                "body": "She’s a beta around her alpha friends.  Her friends want her to be single with them and are filtering out her prospects.  Just sounds like assertiveness issues which young 20s usually have",
                "comment-author": "Electronic_Stop_9493",
                "replies": []
            },
            {
                "body": "Just in regards to her friends grilling you: Ever watch dating reality shows? Almost all of them have the scenes where the new love interest meets the family/friends and they almost always grill the person. I'd bet money these friends of hers watch these shows and there is a solid chance they are replicating what they are seeing.",
                "comment-author": "thawatch",
                "replies": []
            },
            {
                "body": "Not enough info here for anyone to know the truth. Just keep moving forward and keep it stored as a memory for consolidation with future actions! :) \n\nAll the best",
                "comment-author": "FlatWhiteFrother",
                "replies": [
                    {
                        "body": "Noted, though I’m more than happy to share information as needed, I’ll try to be unbiased but I get how it comes across as villainizing her. \n\nI honestly don’t want to do that- though what I said is what happened.",
                        "comment-author": "RisingFlame0262",
                        "replies": [
                            {
                                "body": "That's a good mentality.   \nI think fixating, sharing or looking more on the situation (although a very male thing to do) isn't unfortunatley going to resolve anything more. (As males we try so hard to 'solve' everything, understand all it's parts, who, what, when, where, why).   \nBut you've already run through the situation, and with feminine energies emotions flow hard and often. Up, down, left, right. She won't be able to tell you definitively every thought emotion and decision that lead to those actions. \n\nJust remain empathetic, listen to her and keep moving forward. If it keeps happening you can slowly piece together whether you two have different ideas on social interactions, what's right, wrong, topics that are above board and below. But you'll only get this over time",
                                "comment-author": "FlatWhiteFrother",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "How long have you dated for? Were they all saying it in a *banter* way? Like some friend groups are into banter when they meet the new partner. (Maybe cultural?)\n\nI’d say in a group dynamic it’s more common for her (GF) to laugh and make jokes and bit a bit edgy. \n\nI’ve actually met couples (healthy relationships btw) where that’s a joke she says “he was punching up…” “he’s not a 10, but he’s funny…” “he’s poor” \n\nI took it like a non-serious sort of semi self-deprecation joke (a couple that can laugh at itself is secure)…The BF/husband is usually in on the joke and normally secure in the relationship, so they joined in too “yeah I was punching up…” “I didn’t think she’d look twice…” etc\n\nIf it’s not said as a joke; or it’s constant belittling “digs” that are jokes… different matter imo (btw I’m autistic; so I kinda learned this “social rule” about what’s banter or a in-joke. That kinda humour is kinda fashionable currently.\n\n “If you break her heart, I’ll break your bones” my friend’s wife’s bestie said that when they started going out; and we were all in the same friend group for years before they started dating, so they knew each other well… banter and social jokes are kinda like that.\n\nIt’s not a *real* threat. I remember a weird trend years ago when girlfriend’s prom dates in the US posed with their girlfriend’s dad holding a gun (err yeah, I know 😮) \n\nI think the next time you meet them they’ll dial the *banter* back.",
                "comment-author": "Cradlespin",
                "replies": []
            },
            {
                "body": "One things for certain, the version of her you saw with her friends is a peek into their collective group think mentality",
                "comment-author": "bolowbc",
                "replies": []
            },
            {
                "body": "As many have pointed out here I'd be cautious moving forward,because she let her mask slip. She obviously takes her friends more seriously than you, which she showed by treating you the way she did. And she's not actually sorry for misbehaving, she's sorry you picked up on it and confronted her about it.\n\nAs the saying goes, you are whom you keep company with.",
                "comment-author": "Soetpotaetis",
                "replies": []
            },
            {
                "body": "Immediate thoughts are:\n\n\n1) insecure (wants to impress friends, but either has shitty friends or a shitty mental model of her friends).\n\n\nOr \n\n\n2) Autistic (And the masking changed based on company).\n\n\nI don't think either are a deal breaker. But you probably want to explore this personality \"quirk\" more to see if it something you can accept or something she is genuinely on board with working on.\n\n\nMaybe it was a one time thing, but that is pretty easy to test.\n\n\nHave another get together with the same people. Make sure she is fed. Maybe have a drink to loosen you both up.\n\n\nBut make sure you are in a head space to be mature and non-reactive (in the moment shittiness) before you do.",
                "comment-author": "CrustyFartThrowAway",
                "replies": []
            },
            {
                "body": "Am i the only one who gets the vibe that your gf is different from her friends but is worried about losing them, so she tried to assimilate. Especially when the friends are the only ones she's been different away. \n\nDoes she have other friends?\n\nI'm not saying it's right, but the weird apology could have been steeped in embarrassment. \n\nCould this be possible?",
                "comment-author": "lola2782",
                "replies": []
            },
            {
                "body": "RUN as fast as you can. This woman will wreck your soul.",
                "comment-author": "highnotefan",
                "replies": []
            },
            {
                "body": "Ditch her. You don't want a disrespectful partner. If you allow it to happen, it will keep happening. Kudos for confronting her, but her excuses were trash. You seem mature and level headed you can do better.",
                "comment-author": "Jamesm718",
                "replies": []
            },
            {
                "body": "Leave her. If she's trying to be cool around her friends by belittling you, it means she's complaining and bad mouthing you to them already. It shows that she talks all kinds of crazy to them about you and your relationship, she has them convinced you're whipped and that she's got you by the balls. It also means that they are all in your relationship, and that they'll all be involved in every aspect whether you know it or not. Your relationship is not just between you two, but between you and all of them. When things go even a little bit bad between you two, they'll automatically make you out to be the monster and will encourage her to cheat, and justify any wrongdoing by her. accountability will be completely out the window. You'll not just have one woman to fix things with, but her and all her friends too. Giving up steady pussy (let's be real, is it much more than that?) sucks, but your mental health will thank you. She's trash for that behavior, and you're young. Leave now, she showed you who she really is, and that is not someone you'll want to marry so don't waste your time. Hope this helps!",
                "comment-author": "No-Reason-5205",
                "replies": []
            },
            {
                "body": "What a bitch. You're not overreacting. You just got your first glimpse of how she signals status to her tribe, and it came at your expense. That's not a small thing. That performative shift she pulled isn’t about being “hangry.” It’s about hierarchy. She wanted to look powerful in front of her friends, so she dominated you socially. She made herself look bigger by making you look small. That’s not a mood swing. That’s a strategy.\n\nWomen will often test men in private. But what matters even more is how she acts when the social stakes are higher... when her friends are watching. If her way of signaling value is to mock, undermine, or condescend to you in front of her peers, it’s not just disrespect. It’s a future preview. This is how she will relate to you when your relationship stops being new.\n\nYou need to ask yourself a serious question: If this is her at her “realest” around her core people, do you like what you see? Now, a few practical moves.\n\nCall it out directly. Not emotionally. Not with drama. Say: “That wasn’t hunger. That was you trying to look cool in front of your friends. I don’t accept being treated like that.” Watch the next encounter. If it happens again, walk. Once is a flag. Twice is a pattern. Don’t overexplain your worth. The financial sizing-up from her friends? It wasn’t just about your wallet. That's was about whether you’re “worthy” of her in their eyes. That entire social interaction was a tribal value test. The second you feel like you have to prove yourself to people you’re not dating, you’ve already lost the way others perceive the relationship. \n\nThis isn’t just about respect. It’s about polarity, status, and partnership. She doesn’t need to worship you, but she damn sure shouldn’t be using you as a prop to elevate herself either. If she does, she’s not your girlfriend. She’s your competitor.",
                "comment-author": "Firekeeper_Jason",
                "replies": []
            },
            {
                "body": "Response from the ai I built trained on this Reddit thread, dm if you find it useful and want to keep chatting \n\noh hell no.\n\nthat wasn't \"being hungry\" - that was her performing for her friends at your expense. the disrespect is loud and clear.\n\nthe fact that she acts one way with you alone and completely different with friends is a massive red flag. she's either embarrassed by you, trying to impress them, or showing you who she really is when she feels backed up.\n\nand her friends asking about your finances? that whole vibe is off. they're sizing you up like you're an investment, not a person.\n\nthe half-assed \"somewhat\" apology tells me she doesn't actually think she did anything wrong.\n\nhonestly? i'd be reconsidering the whole relationship. this kind of public humiliation doesn't just happen once. is this how you want to be treated every time you're around her friends?",
                "comment-author": "Brittbratt155",
                "replies": []
            },
            {
                "body": "Red flag, narcissistic people behave like this. No point of confronting her because they won't understand your POV. If you are looking for something in long run then you should think about other options.",
                "comment-author": "Few-Calligrapher8892",
                "replies": []
            },
            {
                "body": "run !!!",
                "comment-author": "BuddahMasked",
                "replies": []
            },
            {
                "body": "I had this once.  GF of 23yo too. Was anew friend group and she was kinda showing off I guess but was the start of a downward spiral.\nBe assertive, don't accept any bs or bad behaviour. You called it out which is good but make sure the framing is \"unacceptable behaviour\" and not any kind of hurt feelings. The latter could weaken you in her eyes and you'll lose her respect altogether.\nAnd be consistent about the behaviour. No empty threats. If she continues to disrespect you, walk away",
                "comment-author": "El_Visitor1",
                "replies": []
            },
            {
                "body": "Best case, she's a two-faced jackass.\n\nWorst case, she has conveniently-timed schizophrenia.\n\nProceed accordingly, OP.",
                "comment-author": "DGenerationMC",
                "replies": []
            }
        ]
    },
    {
        "title": "GF and I broke up and now I feel lost",
        "post-author": "CleverWeeb",
        "text": "28M, my gf and I broke up a few weeks ago. It was mutual, no one cheated, and it really seemed like the right decision at the time. \n\nWe dated for almost 3 years. After talking to someone everyday for that long it just feels like there’s a void now. I really only have 3 legit friends. 2 of them are engaged, 1 moved across the country, and I don’t feel comfortable talking to any of them about this. I’ve known all of them for over a decade and we’ve never really discussed our dating lives with each other. I gather that’s normal for guys but idk. This to say, I don’t really have anyone to talk to about this. \n\nI tried going on Tinder. Not because I’m looking for anything, I really don’t want to jump right back into dating, but just to try and talk to someone to take my mind off it. I’m not the most attractive guy in the world, but I’d like to think I’m not hideous (¿). Likes are few and far between. When I do match with someone I try to send a fun message but no one ever messages back. \n\nI just feel really alone and lost. I’m 28 so I’m not young and I don’t exactly have a friend group to go out with to meet people. I know it’s not reasonable to think but I can’t help but feeling I’ll be alone for the rest of my life and that really scares me. \n\nI feel like I’ve had my head down my whole life either doing what I love or in recent years, work, but now I’ve picked it up and I’m looking around and realizing there’s no one there. \n\nNeeded to vent into the ether. If anyone actually read this, I appreciate you. ",
        "comments": [
            {
                "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "See you in the gym",
                "comment-author": "OmegaRed718",
                "replies": [
                    {
                        "body": "😤",
                        "comment-author": "CleverWeeb",
                        "replies": [
                            {
                                "body": "And the bar. Trivia nights are great to stay busy and fill your week up",
                                "comment-author": "HatsiesBacksies",
                                "replies": [
                                    {
                                        "body": "Agreed. Randomly went to one with two buddies and ended up randomly meeting two women in the area. Get out there, OP.",
                                        "comment-author": "OmegaRed718",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "Make sure to get some good quality protein",
                                "comment-author": "DepressedDragonBorn",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "This is the way.  Ended 9 year relationship 13 months ago.  Currently in the best shape of my life..quit smoking, quit drinking, quit smoking weed, got some style, started running...life gets wayyyy better.",
                        "comment-author": "jordanwilson23",
                        "replies": []
                    },
                    {
                        "body": "This is crazy accurate. I started going to the gym consistently right after my heartbreak. It started as a good distraction and now it’s something my body and mind actually asks for. I still have leftover feelings for my ex but at this point I’m used to life without her.",
                        "comment-author": "redbluespider",
                        "replies": []
                    }
                ]
            },
            {
                "body": "If any of these 3 guys is actually a friend, shoot them a message or call them and when they ask \"how's (ex gf name)?\" you say \"actually we broke up\" and then tell them you're feeling kinda shitty.\n\nThat's literally what friends are for.\n\nAnd don't give me some \"guys don't do that\" crap because plenty of guys do exactly that.\n\nThey're your friends. Talk to them.\n\nMaybe you can go hang out with one of them and get your mind off things. When you're ready maybe one of them will know someone to set you up with or invite you to a party where you'll meet someone.\n\nDon't shut people out of your life then complain you're alone. Reach out.",
                "comment-author": "LucyShoes2222",
                "replies": []
            },
            {
                "body": "I promise you, you are young. \n\nIt is normal to feel a void in your life because there is one. It’s time to cultivate a life for yourself. New hobbies, new friends. Not sure where to start? How about getting to know co-workers? What are your interests? Start volunteering. \n\nIt will get better and you will be okay. Three years is a long time. Give yourself time to grieve.",
                "comment-author": "aes7288",
                "replies": [
                    {
                        "body": "Appreciate it. I’m good “friends” with a lot of my coworkers but just about all the ones my age grew up in the vicinity unlike me and already have their longtime cliques. Not sure how I’d involve myself without seeing weird or desperate. \n\nMy biggest interest is competitive games 🙂‍↕️. Original, I know. That’s why I don’t really have a friend group because I was grinding so much for so long to be the best. And I was really good. Just under pro caliber. I started a small business for coaching that did pretty well for a while, but I saw the industry collapse coming and pivoted to getting a job with my degree (finance).  It’s also how my ex and I met and it’s also where I feel most comfortable meeting people but I don’t have the time to play with work/life anymore. Maybe a few hours on the weekends. \n\nI would definitely be willing to volunteer. So, ill look into that \n\nSorry I’m just venting again. I do appreciate your comment.",
                        "comment-author": "CleverWeeb",
                        "replies": [
                            {
                                "body": "Don’t be sorry for venting. We’re here for you man. I feel you, my ex and I ended (at her request) a 10 year relationship and it’s already 2 years since then and it still breaks me like I need to constantly sleep and such to forget about it. I also don’t have many friends, 2 people I’ve talked about this with, and one is married. It feels hard, I’m doing social activities but very rarely because of my job doesn’t allow so it feels very difficult and lonely overall. I have three cats don’t know what I did without them. You deserve to be loved. Sending manly hug to you brother.",
                                "comment-author": "Hefty-Buffalo754",
                                "replies": [
                                    {
                                        "body": "I’m really sorry about that. I can imagine how difficult that is. I also have a cat and she’s the best. Reciprocating the manly hug",
                                        "comment-author": "CleverWeeb",
                                        "replies": [
                                            {
                                                "body": "Keep the good energy flowing legend. 🫡\nWe’ll be fine I promise 🙌\nAnd if we won’t, just know life sucks and then we die. Can’t get more motivational than that.\nSo either way things will get solved, lol 🤣",
                                                "comment-author": "Hefty-Buffalo754",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Do your coworkers go out for happy hour after work? If so, join them next time. I promise you, nothing about that comes off as desperate. \n\nAnd you are allowed to vent. Gotta get the thoughts out of your head so you can begin to process everything!",
                                "comment-author": "aes7288",
                                "replies": [
                                    {
                                        "body": "We all do sometimes but it’s a mix of younger ppl and ppl with families. It’s just a kinda vent about work thing. \n\nI’m gonna see if I can somehow get invited to when a couple of the dudes my age go out on the weekends with their friends.\n\nAnd thanks for saying that. I felt like I just needed to start venting instead of letting it fester",
                                        "comment-author": "CleverWeeb",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Same man see you in the gym",
                "comment-author": "jaximointhecut",
                "replies": []
            },
            {
                "body": "Hang in there, bro.",
                "comment-author": "Alone-Detective6421",
                "replies": [
                    {
                        "body": "Appreciate it man",
                        "comment-author": "CleverWeeb",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Ah the painful quiet where there used to be a person.  Growing pains and healing suck, don't they?\n\nIt's gonna be okay.  This is normal, and if it was mutual, it's still the right decision, even if it's sad.  You're allowed to grieve a relationship.\n\nWhat you need isn't a new person right away.  You need friend time, and hobbies. \n\nLast breakup I went through, I had a lot of nights when I couldn't sleep.  So I started gaming in an MMO, reading, stuff I enjoyed.\n\nPoint is, give yourself a little grace. It's okay to not be completely healed yet.  And your friends probably want you around. Don't shut them out just cause you're sad.\n\nThings will get better, and you'll find someone awesome, when you're ready.",
                "comment-author": "CopperPenny56",
                "replies": []
            },
            {
                "body": "Stay strong brother, learn to build enjoyment of alone time",
                "comment-author": "Buddhas_Bro",
                "replies": []
            },
            {
                "body": "Sorry to hear it, and venting is normal (trust me).\nJust use that moment to become the guy that will deserve the dreams he wants. Set new standards for yourself and the next relationship. I have some fun by yourself, with friends and strangers as you can.\n\nBreaks DO SUCK, but I am sure you'll not end up ALONE. \n\nDon't FORGET: the WORST THING that could happen is to MEET THE RIGHT (or better) partner WHEN YOU ARE NOT READY, still in pain, etc.\n\nRush to feel at peace with all of it. Humble recommendation.\n\nYou got this.✔️🙂",
                "comment-author": "Then-Stranger-4641",
                "replies": []
            },
            {
                "body": "Jesus bro stop it. You’re 28, and you’re… not young? GTFO of here with that nonsense. You’re not 22, but you’re also not 35,45, or 75 either. You’re 28 and have a huge dating range if you wanted it. A huge socialization range too. \n\nYou’re sad, I get it and respect it, relationships end and that’s ok. Now you have your life back. It’s time to go do something. Do something! Go out, pick up new hobbies, try stuff, invest in yourself. Be your own best friend. I don’t know about you but I talk about dating and relationships with my guy and gal friends all the time. \n\nI’m not saying it’s gunna be easy if you’re not doing it already or not used to going solo to things. But this is the time to start at least trying. Keep your head up, worry less about what other people are doing.",
                "comment-author": "Magnificent_Sock",
                "replies": []
            },
            {
                "body": "I’m in the same boat, 8 years and now nothing. It’ll get better over time.",
                "comment-author": "OdorlessTurpenoid",
                "replies": [
                    {
                        "body": "🤞🏼",
                        "comment-author": "CleverWeeb",
                        "replies": []
                    }
                ]
            },
            {
                "body": "It is like that its hard to navigate at first but it gets better I promise. You need to fill that void with something other than thinking",
                "comment-author": "VanillaLamb",
                "replies": [
                    {
                        "body": "You’re right. I’m definitely trying",
                        "comment-author": "CleverWeeb",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Give your friends a call. Just because you've not really talked about it in the past doesn't mean you can't start. You showing them you trust them to be vulnerable can make you feel closer, and also show them they can do the same with you when they need to. And even if you don't feel up to discussing the break up, having someone to talk to about other things can still help you feel less alone. \n\nNext, it's not too late to make friends. I know it's easy to think everyone has their social groups set by this age and it's impossible to break in, but that's not true. Sure, it is for some people, but there's also a hell of a lot of other 28 year olds who are similarly lonely, or just have more room for friends in their lives. Figure out what hobbies you have that can involve in person social events. If there aren't any, try some new hobbies. Then introduce yourself to people there, make conversation, and see who you vibe with. It might take a few attempts, and just like dating, there will be people who are just not interested, but it's worth it. A year from now you could find yourself with a solid group that give you so much confidence and joy you can barely even recognise this guy who feared he'd be alone forever.\n\nAs someone who's moved countries/cities several times in my adult life, and similarly had a moment looking around after a long relationship breakup and realising I didn't really have any friends, this is how I made all the friends I have in adulthood. For me it was getting stuck into the local music scene and volunteering at festivals, but really it just depends what you are into. Climbing gyms I've heard are particularly supportive environments filled with people in our age range, and they usually run some form of social or beginners events weekly. Film clubs can be another good one. Really, the world is your oyster. You don't need existing friends to go out and meet people, and honestly I find it easier to meet people when I am out solo, because then I'm motivated to actually chat with strangers instead of just sticking in my comfort zone with my friends.",
                "comment-author": "Queasy-Cherry-11",
                "replies": []
            },
            {
                "body": "> I know it’s not reasonable to think but I can’t help but feeling I’ll be alone for the rest of my life and that really scares me.  \n  \nThis is exactly why you should be cultivating closer relationships with your male friends *as well as* looking for a partner. Your wife could die one day, or you may end up divorced. You need other people in your life.    \n  \n> Not because I’m looking for anything, I really don’t want to jump right back into dating, but just to try and talk to someone to take my mind off it.  \n  \nYou're not ready to date and you're going to end up hurting people who are trying to date. Or I guess best case scenario, you'd be finding another person looking to use someone as a distraction. Which is insane, considering you have 3 already established friends who may also need someone to talk to from time to time.",
                "comment-author": "Ok-Harpy",
                "replies": []
            },
            {
                "body": "Filling the void is hard but not impossible. As someone who had to fill the void after my 5 year relationship ended, this is what worked for me. I found that starting a long tv show (NCIS for me) and commenting to my tv helped fill the emptiness and silence in my apartment. I started going on walks and listening to funny podcasts (shxtsngigs always makes me laugh). \nThere are days where it does get sad and lonely, but I found that having constant back ground noise helps a lot. I would also recommend buying items that smile at you in a cute way. I believe Lego’s is coming out with a smiling plant set, I highly recommend you get those and if not those any Lego set should work. Legos are amazing to help forget about everything as you have to focus on building them and nothing else. \n\nGood luck dude, it will get better little by little.",
                "comment-author": "elletimes",
                "replies": []
            },
            {
                "body": "I know how this feels all too well. I'm sure you'll do fine. All the best.",
                "comment-author": "IllustriousBeach4705",
                "replies": []
            },
            {
                "body": "I feel u man - it get easier with time",
                "comment-author": "fromthefuturebruh",
                "replies": []
            },
            {
                "body": "31, female here. Could use a few friends in my inbox!  Message if your lonely",
                "comment-author": "Tina-co",
                "replies": []
            },
            {
                "body": "Go to the gym. You will enjoy it. Blast some heavy metal and just go at it. Lost like 30 pounds in 2 months after my ex and I broke up. Of course I was also depressed, drinking 3 fruit smoothies a day as meals and barely sleeping. Regardless though, life will go on, and things will get better. This time is for you to rediscover yourself. It’s tough man, and I get wanting to vent and talk to people. You can DM if you want.",
                "comment-author": "Difficult_Group8242",
                "replies": []
            }
        ]
    },
    {
        "title": "No one wants a serious relationship with me 21F",
        "post-author": "Middle-Base9738",
        "text": "I 21F have ever only had one serious relationship and that was from ages 18 to 19. The relationship was great until I found out at the last six months of us being together he 20M (at the time) cheated on me with another girl at the college we went to. That was about two years ago. I have gone on a couple dates maybe four months after that relationship. some dates were fun, some weren’t but I really just tried to focus on myself and studies. However, there has been a few times where I really saw potential in someone, mutually pursued them but it ends up in the guy doing some of these things: “hes not ready for a relationship” , taking me on dates to attempt to get into my pants, or just keeping me on their “roster”.\n\nI don’t know what im doing wrong. I have hobbies so I won’t be obsessing over a guy, I work, I go to school, I actively communicate so there is no room for misunderstanding, I always try to create a safe space for whoever the guy im talking to feels comfortable to express feelings.\n\nI don’t want to be cocky but I am a rather beautiful woman, and people have always told me that dating will always be hard for me. I just feel so discouraged. People always tell me to love myself and I don’t need to love anyone but myself but is it so bad that I would like to share my love and support to someone. I know I am still young but thats just something that i want. If it doesn’t last forever, that’s okay as long as I can say I experienced what it means to love someone and to have someone love me.\n\nIs there something wrong with me?",
        "comments": [
            {
                "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "Could be your attitude and the people you’re chasing. Maybe go after people who might have less options because they’re more likely to deal with whatever you’re bringing to the table",
                "comment-author": "Tall-Performer2500",
                "replies": [
                    {
                        "body": "I did the same thing but then you end up with someone who is just a sucker for you but whom you don't adore, respect or admire, and that doesn't satisfy you either.",
                        "comment-author": "Putrid-Disk-94",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Try to find guys intentions from the beginning, im sure older guys will be happy to have you",
                "comment-author": "vp0wer",
                "replies": []
            },
            {
                "body": "No, my beauty, there is no problem with you, believe me, until I was 28, the sole purpose of almost every man I met was to have sex with a beautiful girl and it is still the same for most men. The healthiest and most solid relationships are usually those that start with friendship. Otherwise, men's first and only motivation is always sex and if someone else gives them a different face, they are open to cheating with her. Me and many of my girlfriends have very good profiles and we have all experienced and are experiencing similar things.",
                "comment-author": "Putrid-Disk-94",
                "replies": []
            },
            {
                "body": "Your young. Give it time and look for the right person. Also don’t pursue the relationship. Someone’s always a chaser and there’s always a chasee per say. Be the chasee.",
                "comment-author": "Dry-Preparation8815",
                "replies": []
            },
            {
                "body": "Hey 👋 I totally get where you're coming from! It can be super frustrating when you’re putting yourself out there and not getting the results you want. Just remember, dating can be a bit of a rollercoaster, and it’s not always a reflection of your worth. It sounds like you’re doing all the right things by focusing on yourself and being open. Sometimes, the right person just hasn’t come along yet, and that’s okay! Keep being you, and don’t lose hope😊your time will come.",
                "comment-author": "brucewayne047",
                "replies": []
            }
        ]
    },
    {
        "title": "So tired of being single",
        "post-author": "Friendly_Review5790",
        "text": "I'm a male in my 20s and I'm so tired of being single, I see friends and family getting married finding dates.\nI see so many attractive girls when I'm out and about but have no idea how to get a date. How do you even approach a girl in public (grocery store, coffee shops, ect) without looking like a creep?",
        "comments": [
            {
                "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "thats not how most couples meet. \n\nmost people meet through mutual friends. \n\nYou know someone who invites you to a party then you meet people there.  \n\nVery rarely do couples meet by just approaching in the street.",
                "comment-author": "Then-Bookkeeper-8285",
                "replies": [
                    {
                        "body": "Unless you look good, you'll just rack up more and more platonic relationships at parties",
                        "comment-author": "FeanorForever117",
                        "replies": []
                    }
                ]
            },
            {
                "body": "if you are tired of being single truly tired you would make the necessary changes to stop being single\n\n1. get in shape\n2. be well groomed\n3. dress well\n4. get a nice hair cut\n5. get some muscles\n6. learn how to act confident, charming and funny\n7. expand and utilize your social circles (join clubs in your city eg pickleball)\n8. approach women in public. just walk up and smile and initiate conversation. it's not rocket science. works best when you can make her smile or laugh. learn to read body language and eject when you can tell she isn't feeling it.\n9. get your finances in order\n10. get a good degree and career \n\nGL",
                "comment-author": "cdmx_paisa",
                "replies": [
                    {
                        "body": "Good check ✔️ list",
                        "comment-author": "Then-Stranger-4641",
                        "replies": []
                    },
                    {
                        "body": "Just be hot.",
                        "comment-author": "TheFunAsylumStudio",
                        "replies": []
                    },
                    {
                        "body": "Be not short\n\nBe not ugly facially\n\nYou forgot the 2 most important ones. You know the ones that he can't fix.",
                        "comment-author": "WorkingBreadfruit323",
                        "replies": [
                            {
                                "body": "Haha those are good ones to add to the list",
                                "comment-author": "Friendly_Review5790",
                                "replies": []
                            },
                            {
                                "body": "short ugly rich famous guys have slept with hundreds/thousands of women.",
                                "comment-author": "cdmx_paisa",
                                "replies": [
                                    {
                                        "body": "And then they get me-tooed, lol\n\nHave you ever listened to a woman talk before? They friggin LOVE a man's looks",
                                        "comment-author": "TheFunAsylumStudio",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "There is love out there for every well kept short man\n\nAt a rave I saw a guy couldn’t have been taller than 5’3 but his arms were the size of 2L bottles \n\nI’m a straight dude who goes for alt girls that never work out but if I had a snatch it would be a little wet from that gangster \n\nIt’s sad that you gotta work harder to be fitting on the dating market bc god made you short it is what it is \n\nA girl generally does not want somebody short and fat that’s just a double whammy\n\nSo yeah get jacked and dress cool",
                                "comment-author": "fandangledvietnamese",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Ive got every single thing you listed plus some extras, plus im tall and handsome.  minus 8. Still nothing? Is it literally just 8 then?",
                        "comment-author": "CallRepresentative25",
                        "replies": [
                            {
                                "body": "8 is one of the most important things. \n\nan all around average guy who approaches 50 women a week is going to destroy a someone who is above average in looks and job who doesn't approach any women a week. \n\nif you don't approach it means you are relying on online apps most likely. \n\nand to do well online in the west you need to either 1) look like prime brad pitt and or 2) show off multi millionaire status",
                                "comment-author": "cdmx_paisa",
                                "replies": [
                                    {
                                        "body": "It must be that important, since I don't approach and dont get approached. Or these lists that people make are just plain bullshit. I worked my ass off for a long long time to get to where i'm at and literally try to max myself out in every regard, and still nothing from women. I've made this comment before but its crushing exceling in literally every aspect of my life, and anything ive ever put my mind to, except for women and dating. For some reason its the enigma that I just haven't been able to figure out.",
                                        "comment-author": "CallRepresentative25",
                                        "replies": [
                                            {
                                                "body": " women aint just gonna show up at your doorstep simply because you are handsome and have a good job.  \n\nconfidence and a go getter mentality is gonna be the key to unlocking stuff. \n\nbut you will absolutely LOSE women if you don't look decent and have a solid career etc.",
                                                "comment-author": "cdmx_paisa",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "This list isn’t wrong, but it’s way too surface-level and ignores how nuanced attraction really is. Yeah, being in shape, grooming well, and having your life together definitely helps but that’s not some magical formula that guarantees results. You could do everything on this list and still get ignored or rejected.\n\nReal charisma and confidence don’t come from a checklist \nthey come from experience, emotional intelligence, and knowing how to read people in the moment. You can’t fake that with a haircut or a gym membership. Women aren’t NPCs where you input the right code and get the outcome. You can say all the right things and still get rejected based on her vibe that day, her past, her preferences, or whatever else.\n\nThis type of advice gets repeated all the time because it sounds good on paper, but in the real world, it’s way more complex. Dating isn’t just self-improvement it’s psychology, timing, emotional control, and understanding social dynamics. This list just scratches the surface.",
                        "comment-author": "Skywalker123_",
                        "replies": [
                            {
                                "body": "simply being good looking with your life in order wont make women show up at your doorstep. \n\nall the things I mentioned are pieces of a puzzle. that need to align and compliment each other. \n\ndoesn't matter how good you look if you are a complete asshole \n\ndoesn't matter how charming and charismatic you are if you work at Mcdonalds. \n\nquality women have baseline floors that need to be met in looks, personality and status. \n\nif any of them are not up to par its a pass. \n\nmost guys don't even meet half of this list, so yea it still needs to be said.",
                                "comment-author": "cdmx_paisa",
                                "replies": [
                                    {
                                        "body": "Yeah exactly I don’t disagree with your list at all. It’s a piece of the puzzle like you said. My main point was just that attraction isn’t a formula. You can have all the basics locked in and still get overlooked if you don’t understand psychology, timing, emotional regulation, and how to connect in the moment. The checklist is necessary but not sufficient. Too many guys forget that.\n\nAnd honestly, someone who works at McDonald’s can still get girls if they know how to carry themselves, spark the right emotions, and build attraction through charisma and social awareness. It’s not about job titles it’s about how she feels when she’s around you.",
                                        "comment-author": "Skywalker123_",
                                        "replies": [
                                            {
                                                "body": "attraction is a formula. \n\nwomen like tall handsome rich confident men who are charismatic, charming, romantic and funny. \n\nfull stop lol\n\ni think what you mean to say is 1) attraction can vary and 2) personality is hard to acquire \n\nI am talking about getting a quality women to marry you. not simply sex. \n\nno quality woman is marrying a burger flipper lol \n\nand by quality I ain't talking about only looks.",
                                                "comment-author": "cdmx_paisa",
                                                "replies": [
                                                    {
                                                        "body": "Saying “attraction is a formula” is the exact mindset that keeps most guys confused and frustrated. Attraction isn’t math—it’s biology, psychology, timing, and energy. You can list traits all day, but if the guy triggers the right emotions, he wins status or job title aside.\n\nYou say no quality woman is marrying a burger flipper, but charisma and emotional connection have made plenty of so-called “low-status” men win. The guy working at McDonald’s who knows how to lead, flirt, and build tension will pull before the six-figure guy with zero game. It’s not about what you do it’s about who you are when you’re with her.",
                                                        "comment-author": "Skywalker123_",
                                                        "replies": [
                                                            {
                                                                "body": "no, what keeps must guys frusted is their lack of being able to \n\n1) look like brad pitt\n\nand or\n\n2) become rich\n\nand or\n\n3) become super confident, charismatic, charming and funny\n\nwe have different ideas on what is quality women. \n\nsimilar to when people say been plenty of sour personality women but hot looks made them win\n\nany dude who marries a sour personality chick isn't quality. \n\nhe is an idiot lol\n\ndoesn't matter how hot he is, or how rich he is, or how charming he is. \n\nnow if you mean just pulling some box, sure, the guy at Mcdonalds will beat the rich guy with no game. \n\nbut I ain't talking about simply pulling box.",
                                                                "comment-author": "cdmx_paisa",
                                                                "replies": [
                                                                    {
                                                                        "body": "You’re still stuck seeing attraction as a checklist tall, rich, charming like it’s some formula you can solve. But that mindset is shallow and misses the actual game. Attraction is emotional, not logical. Women don’t fall for a résumé; they fall for how a man makes them feel in the moment.\n\nLook at Jeff Bezos richest guy on the planet at one point, and still moved like a total beta in public. All that money, still no game. Look at Will Smith. Dude had the fame, looks, status and still got humiliated by Jada while simping for her like a lost dog. You really think status saved either of them? Nah.\n\nA guy working at McDonald’s who understands tension, social cues, masculine energy, and emotional leadership will absolutely outperform some rich, emotionally weak man who gets walked on. Women want a man who knows how to lead emotionally, not just flash his wallet or fake charm.\n\nThis isn’t about being rich or handsome. It’s about whether you can create a dynamic that makes her feel something real. That’s what most of you keep missing.",
                                                                        "comment-author": "Skywalker123_",
                                                                        "replies": [
                                                                            {
                                                                                "body": "being charming, romantic, charismatic, funny makes women fall in love.\n\nno where did I mention being rich was all you need. so your bezos example is moot.\n\nno where did I mention being famous or looking good was all you need. so your will smith example is moot\n\nno quality women is marrying a guy who's career ambition is to work at Mcdonalds.\n\ndoesn't matter how much he understands tension, social cues, masculine energy, and emotional leadership etc etc\n\nno quality woman is marrying a guy who is emotionally weak as well.\n\nyou seem very confused.\n\nno where did I say its just about being rich or handsome.",
                                                                                "comment-author": "cdmx_paisa",
                                                                                "replies": [
                                                                                    {
                                                                                        "body": "You’re moving the goalposts now.\n\nFirst you said no quality woman is marrying a guy who works at McDonald’s regardless of his emotional or social skills. Now you’re saying emotional leadership matters so which is it?\n\nYou can’t say charisma, romantic energy, and emotional strength matter, and then still disqualify a man because he works a low-status job. That’s surface-level thinking disguised as “realism.”\n\nJeff Bezos and Will Smith weren’t my examples to say “money is everything.” They were examples of how emotional weakness kills attraction, even when a man has money, fame, or looks. Both of them got publicly humiliated because they lacked masculine grounding and emotional control.\n\nMeanwhile, a broke guy with real game can still attract women even if it’s not marriage because attraction runs on emotion, not logic. That’s the part you’re still skipping over: women don’t fall in love with a résumé. They fall in love with how a man makes them feel.\n\nYou’re clinging to checklists. I’m talking about human nature.\n\nIn case you aren't aware women fall in love through space. They don't fall in love when you're with them they fall in life through the time u spend apart. The last girl I dated didn't genuinely fall in love until I gave her space to miss me",
                                                                                        "comment-author": "Skywalker123_",
                                                                                        "replies": [
                                                                                            {
                                                                                                "body": ">\n\nYou’re moving the goalposts now.\n\n>First you said no quality woman is marrying a guy who works at McDonald’s regardless of his emotional or social skills. Now you’re saying emotional leadership matters so which is it?\n\n>You can’t say charisma, romantic energy, and emotional strength matter, and then still disqualify a man because he works a low-status job. That’s surface-level thinking disguised as “realism.”\n\nNo i am not. I have been dead consistent the entire time.\n\nYou simply misread my comment. I said and I quote\n\n>doesn't matter how much he understands tension, social cues, masculine energy, and emotional leadership etc etc\n\ndoesn't matter /= matter\n\n>You can’t say charisma, romantic energy, and emotional strength matter, and then still disqualify a man because he works a low-status job. That’s surface-level thinking disguised as “realism.”\n\nI can absolutely say that because it's only part of the puzzle. If all women only choose men on personality and ignored looks and status you would be right. But unfortunately, they don't do that. lol\n\n>Jeff Bezos and Will Smith weren’t my examples to say “money is everything.” They were examples of how emotional weakness kills attraction, even when a man has money, fame, or looks. Both of them got publicly humiliated because they lacked masculine grounding and emotional control.\n\nno where did I say quality women will tolerate or want emotional weak men.\n\n>Meanwhile, a broke guy with real game can still attract women even if it’s not marriage because attraction runs on emotion, not logic. That’s the part you’re still skipping over: women don’t fall in love with a résumé. They fall in love with how a man makes them feel.\n\nI am not missing anything. As 1) I ain't talking about simply pulling or attracting women and 2) I never said that guy can't pull or attract women\n\ni am not talking about simply attracting women. i am talking about locking down quality women aka marriage. a hot woman can attract me all day and twice on Sunday. but that's a completely different topic than attracting me enough to put a ring on her finger. lol I don't care hot hot she is if her personality is trash.\n\nMy entire adult life has revolved around dating and sleeping with women. 100+. Stopped counting in 2017 when I went over 100.\n\nIf there is one thing I know in life. It's dating dynamics. Sexual and emotional attraction. Interpersonal gender psychology.",
                                                                                                "comment-author": "cdmx_paisa",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "body": "Respectfully, you’ve shown me this conversation isn’t going anywhere. You’ve got fragments of the truth, but you’re missing the deeper emotional and psychological layers that really explain long-term attraction. I don’t waste time debating in circles. Take care",
                                                                                                        "comment-author": "Skywalker123_",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "body": "lol i literally evicerated your entire argument line by line using quotations. \n\nyou literally thought doesn't matter equals matter. lol\n\nyou literally were making claims against stuff I never mentioned or said. \n\ndon't run now, things are just getting good haha",
                                                                                                                "comment-author": "cdmx_paisa",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "body": "You understand some of the surface level stuff but you're missing the deeper level stuff. Any guy who truly understands game and all the other stuff I mentioned knows that a guy who works at McDonald's can get a high quality woman.\n\nHow do ik? It's because I've experienced it, seen it, and have networked with the right people bro. Some of this stuff you just never understand until you see it happen or experience it.",
                                                                                                                        "comment-author": "Skywalker123_",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "body": "define a high quality woman. \n\ni think this is where you seem to be having issues.",
                                                                                                                                "comment-author": "cdmx_paisa",
                                                                                                                                "replies": []
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "I'm sorry, but \"well groomed\" sounds gay af.",
                        "comment-author": "31i731",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I went through that feeling as well, and honestly today (years later) I kinda of regret it. Wanting a relationship at your age IS MORE THAN NORMAL, and I am sure you deserve to find love too. *But if I had the chance to go back (or talk) to my 20s self, I would definitely RUSH to BECOME Someone Valuable first (AND F* invest more in crypto). \n\nBecause meeting as woman is just meeting a woman. The questions are: \n\n1) Will she fit with your dreams/vision?\n2) Will she uplift you or drag you down?\n3) Will she \" inspire\" you somehow or distract you?\n\nYou see where I am going: focus on yourself first TO GAIN SO MUCH CONFIDENCE that the game will be EASY for you. Honest and humble recommendation.\n\nGL🙂",
                "comment-author": "Then-Stranger-4641",
                "replies": [
                    {
                        "body": "Thanks 😊 that’s a good point",
                        "comment-author": "Friendly_Review5790",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I went to an social event at a bar last night. I didn't sign up for it but a friend of mine invited me to join her. She was in a group of 3 guys and 2 girls that she spent a long time with and introduced me to them. As the crowds began to change and leave I spent more time with the group. Initially it was pretty bad, the guys weren't bad but were sort of passive, but the girls looked at me like I was some kind of creep (I wasn't trying to hit on them or anything) and wouldn't talk to me. There were moments where I felt boxed out of the group by putting their back towards me. \n\nEventually I walked away from the group, I found my friend and told her that I think her group didn't like me. She said something along the lines of \"they'll like you they just don't know you\". She went back to the group (and may have mentioned me) and I just hung out with myself for a little bit before going back.\n\nThey seemed to be a little more open, one of the girls told me she liked another guy in the bar, I tried to help her but she didn't want it. At least she mentioned it to me. Later on the group moved closed to the music and began to dance. Everyone got more loose and relaxed with me. The last girl let me hold her purse since I was already holding my friend's already. The other girl may have even touched me as she yelling into my ear (we were way too close to the music). Both of them hugged me goodbye, one of held me surprisingly tight and other was good with me walk her to her car (my friend suggested it).\n\nMoral of the story: Even with the best intentions you will still look like a creep. Don't let that stop you from taking those risks.",
                "comment-author": "darexinfinity",
                "replies": []
            },
            {
                "body": "I try to talk about things of common interest. Then you arent approaching with an ulterior motive. You just genuinely have an interest in blank and you ask her about it\n\nScenario, you love art and ask a girls opinion at a museum over a particular piece. You are genuinely interested in her answer and the conversation flows. You give her your card to keep in contact and ask if she would like to check out the new exhibit next month as you would just love to hear her POV\n\nIt really is about having passions and shared interests\n\nSo first, just make sure that you have true deep passions",
                "comment-author": "Broken-Tower",
                "replies": [
                    {
                        "body": "Yeah I just don’t understand how you just walk up to a woman at a museum and start a conversation",
                        "comment-author": "NoVermicelli1303",
                        "replies": [
                            {
                                "body": "Totally understand!\n\nThe art of conversing with strangers is a skill that you can learn and develop. Work a little bit every day at being a tad more social by talking to people irl about anything\n\nYoull get more comfortable as time passes",
                                "comment-author": "Broken-Tower",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You’re telling me. The apps are filled with fuckboys",
                "comment-author": "033romeo",
                "replies": []
            },
            {
                "body": "Honestly, I'm not too sure about the whole “public approach” to getting a date.\n\nWhat worked for me was getting into hobbies or going to social events—stuff like joining clubs. It just naturally puts you around new people. For example, I used to train BJJ (Brazilian Jiu-Jitsu), and I ended up making a bunch of friends there. Bonus: there's a lot of physical contact during training, which definitely helps break the ice!",
                "comment-author": "AGNAM09",
                "replies": []
            },
            {
                "body": "What I’ve noticed is the more you focus on being single, the longer it’s gonna take. It sounds cliche but it’s true. The best kind of relationships happen when you least expect them. It always helps to be yourself, any women worth having wouldn’t care about the materialistic things you have, instead they’d want to know you.",
                "comment-author": "Ok_Meeting4019",
                "replies": [
                    {
                        "body": "This is a great comment! Thank you :)",
                        "comment-author": "Friendly_Review5790",
                        "replies": [
                            {
                                "body": "You’re welcome! 😊",
                                "comment-author": "Ok_Meeting4019",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You could compliment something about her casually, while smiling and innpassing so you're not hovering and being creepy. Maybe if she's attracted, she'll start up a convo. You could do the ole buy a girl a drink, but i would be sure to make eye contact, smile, do those non-verbal flirty things before buying her a drink. Otherwise, it comes out of nowhere and seems creppy. You could also try dating apps or meetup groups",
                "comment-author": "mermaid823",
                "replies": [
                    {
                        "body": "Meet ups more so than dating apps😝\n\nGreat post!",
                        "comment-author": "Broken-Tower",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Dating events are good. Eg: speed dating",
                "comment-author": "Legitimate-Hurry-665",
                "replies": [
                    {
                        "body": "I have gone to 5 not a single like from any woman. It's like apps in real life. Makes me one step closer to unaliving myself every time. I got in really good shape and make over 300k. My standards are just be breathing. Never be short. Life isn't worth living when you're 5'5",
                        "comment-author": "WorkingBreadfruit323",
                        "replies": [
                            {
                                "body": "Sounds like those women didn’t deserve you then, you’ll find a woman worth your while, also most importantly you are loved and valuable in the sight\nOf Christ.",
                                "comment-author": "Friendly_Review5790",
                                "replies": [
                                    {
                                        "body": "No I don't deserve them. I am short and ugly. Any woman can do better. Hell I can't even get a sugar baby. My seeking arrangements is full of girls rejecting me for my height.",
                                        "comment-author": "WorkingBreadfruit323",
                                        "replies": [
                                            {
                                                "body": "If you can't get a sugar baby you're not trying hard enough, you can ALWAYS get some action if you got $$$",
                                                "comment-author": "biggersboooooty",
                                                "replies": []
                                            },
                                            {
                                                "body": "My buddies family is short no one’s above 5’5 but they all have nice looking spouses. Maybe look for a woman with more traditional values who doesn’t care about stuff like that.\nAny woman that would judge me by my height doesn’t deserve any attention.\nThere’s also a lot of unattractive guys that have very pretty girlfriends.\nBuild your self up mentally and you will start seeing yourself that way, and that will then radiate confidence (which is attractive to women)\n\nDon’t sell yourself short, keep swinging brother!",
                                                "comment-author": "Friendly_Review5790",
                                                "replies": [
                                                    {
                                                        "body": "I mean if I was 10 years older I would be married. It's the dating app thing. Height has become the end all be all because of dating apps.",
                                                        "comment-author": "WorkingBreadfruit323",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Don’t say that :( \nI’ve been with tall men that are not bf material, and I’ve been with shorter men that are. \nPlease don’t put your worth on your money and height",
                                "comment-author": "Legitimate-Hurry-665",
                                "replies": [
                                    {
                                        "body": "Money doesn't matter. Height is the only thing of value as a man. I'd do literally anything to be taller.",
                                        "comment-author": "WorkingBreadfruit323",
                                        "replies": [
                                            {
                                                "body": "how old are you?",
                                                "comment-author": "biggersboooooty",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Be yourself. You don't need any external validation to attract women. Most people don't understand that they are very boring to be with because they value what's on the outside rather the inside. The more authentic to yourself you are, women will see flock to it. No offense but notice how fat guys can usually pull some really hot women. It's because they are fun to be around.",
                "comment-author": "jaybee_the_Kumo",
                "replies": []
            }
        ]
    },
    {
        "title": "Is it just me, or do most girls only talk about themselves on dates?",
        "post-author": "xjose97x",
        "text": "Hey everyone,\nI’m 27 and only recently started dating for the first time in my life. I’ve met a few girls on Bumble and had some decent success — nothing long-term yet, but it’s been a good learning experience so far.\n\nOne thing I’ve genuinely noticed, though, is that almost every girl I’ve gone out with tends to talk almost exclusively about themselves — their job, their friends, their hobbies, their day-to-day life. And that’s fine to an extent, but I feel like there’s very little interest shown in me or my world. I’ll try to share my perspective or experiences, and it often just kind of gets brushed aside or redirected.\n\nIs this a common thing guys experience when dating? Or maybe I’m just picking the wrong matches? Would love to hear other people’s experiences and perspectives on this.",
        "comments": [
            {
                "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "I’ve experienced this same thing with men, actually, so no it’s not just girls in general, but if you’re noticing this with every girl then maybe consider what you’re contributing to the conversation as well. I always try to keep it “equal” with asking questions, even if it’s just asking the guy the same thing they had asked me. Sometimes it’s hard to keep up a convo with someone who isn’t offering much and it’s easy to slip into talking about yourself to fill the space",
                "comment-author": "Jazzlike-Passenger27",
                "replies": [
                    {
                        "body": "Thanks for your reply — I really appreciate your perspective. I’ve never been told I’m a bad conversationalist by friends or family, but I get that dating is a different context, so I’ll definitely try to pay more attention to how I’m contributing in these conversations.\n\nLike you, I do try to keep things balanced — if I talk about myself, I usually try to turn it back around and get her talking about herself too. But yeah, I’ve just noticed a lack of that same reciprocity in return, which can make the interaction feel a bit one-sided. Still, good to hear your take — gives me something to reflect on!",
                        "comment-author": "xjose97x",
                        "replies": [
                            {
                                "body": "No problem! Sometimes I try to talk “less” about myself when asked a question I just keep it simple to avoid steamrolling the convo but this can be counterintuitive sometimes so that might be what you’re doing in an attempt to be respectful of the flow of convo",
                                "comment-author": "Jazzlike-Passenger27",
                                "replies": []
                            },
                            {
                                "body": "I assume the woman you're dating I assume you were the one that asked her out",
                                "comment-author": "ResentCourtship2099",
                                "replies": []
                            },
                            {
                                "body": "Most people like to talk about themselves a lot. \n\nIf you ask questions and follow ups, they might end up just talking about themselves if they arent super conscious. \n\nI do ask a lot of questions naturally, so men do talk a lot about themselves when they’re with me!",
                                "comment-author": "SeriousBeesness",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "I agree, I think this is just a self-defense mechanism to always keep the conversation going and avoid the awkward silence.",
                        "comment-author": "31i731",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I was dating someone a while ago where I felt like I was always talking about myself the whole time and I hated it. I’d try to ask him questions about himself to steer the conversation towards getting to know him, but he’d give really simple to the point answers and would literally never elaborate. It felt like I was pulling teeth trying to get him to talk about himself and it would get exhausting, so I’d try to fill up space in the conversation and be forced to talk about myself more just to avoid feeling like I was interrogating him. Consider if you’re doing this.",
                "comment-author": "Sad_Asparagus_314",
                "replies": [
                    {
                        "body": "I have been on more than one first date like this. I’m an introvert by nature, so to have to go to such lengths to get the other person to share anything was just awful. I could literally hear myself trying to fill up the space in the conversation with funny anecdotes about myself and stuff and it would grind my ears. \n\nAt the end of one of the dates I realized that none of it mattered because he just wanted to make out so yeah.",
                        "comment-author": "throwawaydostoievski",
                        "replies": [
                            {
                                "body": "> At the end of one of the dates I realized that none of it mattered because he just wanted to make out so yeah.  \n  \nWhat an awesome guy",
                                "comment-author": "Ok-Harpy",
                                "replies": [
                                    {
                                        "body": "Lmao yeah. I didn’t entertain it and never saw him again. Still, I got all dressed up in the middle of winter for literally nothing",
                                        "comment-author": "throwawaydostoievski",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "This is common with men too. I haven’t been on a date for ages but the last guy spent the majority of the time talking about his autoimmune disease and his exs mental health issues 🫠",
                "comment-author": "Key-Sheepherder-92",
                "replies": [
                    {
                        "body": "Yikes, yeah that definitely doesn’t sound like ideal first date conversation! Sorry you had to sit through that. It’s kind of reassuring (in a weird way) to hear that this isn’t just a one-sided issue though — seems like a lot of people are still figuring out the balance in conversation. Hopefully both of us get better matches next time!",
                        "comment-author": "xjose97x",
                        "replies": [
                            {
                                "body": "I did try and redirect the conversation various times, but it was a waste of time- in the end I just got stuck in my into wine 😆\n\nA lot of people also probably aren’t in a mental place to be moving forward with dating, but that isn’t always apparent until you actually meet.",
                                "comment-author": "Key-Sheepherder-92",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I think this is a nervous habit some chatty people have when meeting strangers that they’re interested in impressing.",
                "comment-author": "NTDOY1987",
                "replies": []
            },
            {
                "body": "I think it’s quite normal for people to talk about themselves a lot on the first date. It’s how you give information to your date about who you are, what you like, etc \n\nOnce you know each other more then it won’t be a thing really",
                "comment-author": "mikerichh",
                "replies": []
            },
            {
                "body": "You might need to change up your \"type\" selections.  If you keep buying diet coke you cant wonder why it always tastes like diet.  If the type your choosing always seem to be this way, you need to make a change.  Women need to learn this too.",
                "comment-author": "Mother_Assumption925",
                "replies": []
            },
            {
                "body": "No I actually don’t like to talk about myself but most men never asked me any questions anyway",
                "comment-author": "PrincessMomomom",
                "replies": [
                    {
                        "body": "How would you like to talk about yourself if they asked questions?",
                        "comment-author": "Altruistic-Patient-8",
                        "replies": [
                            {
                                "body": "Depends on the questions? I tend to share more experiences than talking more personal stuffs if I don’t know the person well",
                                "comment-author": "PrincessMomomom",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Woman here. I’ve met plenty of men who did the same thing. This isn’t about gender. It’s a person to person thing.",
                "comment-author": "Appropriate_Tea9048",
                "replies": []
            },
            {
                "body": "Most women say the same about men. You’ll always hear women saying men don’t ask any questions.",
                "comment-author": "Capital-Patience8592",
                "replies": []
            },
            {
                "body": "Just you lil bro",
                "comment-author": "sh_ip_ro_ospf",
                "replies": []
            },
            {
                "body": "Typically it's men who only talk about themselves on dates.  It's a pretty widely known phenomenon.",
                "comment-author": "gordonf23",
                "replies": []
            },
            {
                "body": "Youre getting to know each other. \n\nAnswer your own question when you ask her one. Then she answers your question and asks you a new question.......you answer her question and ask a new one. Pickup on details and dont be afraid to dialogue for a few minutes to keep from turning into a full blown interview. \n\nIts apparent that many people arent hip to conersation etiquette. You dont wait to be asked a question you still somewhat engage by volunteering.",
                "comment-author": "CancerMoon2Caprising",
                "replies": []
            },
            {
                "body": "Omg a guy said this on a date…\n\n\nAnd I literally talked his ear off..: \n\n\n\nThen all I could think about was his comment, and gave myself pure anxiety . When he wasn’t actually even putting enough out there for me to really work with so I took the lead.",
                "comment-author": "Tina-co",
                "replies": []
            },
            {
                "body": "I find that men ask me a lot of questions 😂 I get pretty bombarded, but I end up reciprocating it too. I feel pretty bored talking about me after a bit",
                "comment-author": "7theneuron",
                "replies": []
            },
            {
                "body": "I actually get this with almost every man I go on dates with lol",
                "comment-author": "Impossible-Walk6621",
                "replies": []
            },
            {
                "body": "Some people just get nervous and try to oversell themselves to impress others. I’ve had that issue myself and still have to catch myself and stop from making a conversation all about myself sometimes.\n\nEveryone is a little different though.\n\nSome people also kind of build up an idea of you or want a relationship so bad they completely forget about trying to actually know you though. Those types are the worst. I find it’s best to role into a date just trying to be a friend first helps level those traits down a lot for those that struggle with that.",
                "comment-author": "SilentImprovement441",
                "replies": []
            },
            {
                "body": "When I go on dates I hope the person tells me about themselves lolol\n\nBut some people just aren’t good at holding conversations",
                "comment-author": "DrexelCreature",
                "replies": []
            },
            {
                "body": "Just the self involved ones…. Those are “cues” of what’s important to them… if you are not getting questions about you, then move on… “NEXT!”",
                "comment-author": "Prestigious_Being176",
                "replies": []
            },
            {
                "body": "I wish I had that. All I've had so far I was yapping the most 😅",
                "comment-author": "TheMechXYZ",
                "replies": []
            },
            {
                "body": "You’re trying to get to know each other. So would you rather her talk about someone else? Haha.",
                "comment-author": "meechellemaree",
                "replies": []
            },
            {
                "body": "I'm an introverted guy, so a girl that talks alot is a blessing. That being said, if I can't get a word in and their not interested in my life, then it's best to move on.",
                "comment-author": "Altruistic-Patient-8",
                "replies": []
            },
            {
                "body": " How old are they? Could be any number of things like..they are still learning the art of conversation. Or, maybe they're just plain shallow have nothing to say outside of themselves ( a common trait I have found for men and women). \n\n As far as women, it could also be a technique they directly (or indirectly) partake in order to test or gauge your level of interest in them since there isn't any real barrier to entry really anymore in modern dating. Similarly, some women ( or girls rather) will also play 'uninterested' with texting, in order to gauge your interest and to see how far you will work for them. Of course this is immature behavior, so you have to choose whether or not to put up with it. Most of the ones I encounter doing this are fairly physically attractive..perhaps a connection there. \n\n In general, I have found this behavior to be common among younger women in general who are still learning the ropes in communication, some of them happily conscious about it, others happily unconscious. So, to reply to your question, yes, this happens a lot!  However, men also engage in this. I have had many a friend, God bless them, that just go on an on about themselves..In short, people who do this consciously, are playing a game( and it's all a game) of:\n\n \"Impress me (women)..aka, dance for me, baby\" \n\nand \"I will certainly impress you to no end (men).\" \n\nGood luck out there!",
                "comment-author": "medal27",
                "replies": []
            },
            {
                "body": "Normal, this is usually a trend you'll see for a long time from a majority of women",
                "comment-author": "ryancnap",
                "replies": []
            },
            {
                "body": "I think you just have bad taste",
                "comment-author": "North_Reception_1335",
                "replies": []
            },
            {
                "body": "All you have to do is listen…\n\nJust saying.",
                "comment-author": "No_Detective_But_304",
                "replies": []
            },
            {
                "body": "I think it depends on the person. I like listening and am very curious, so I usually try to understand the stories in all their emotional depth and ask a lot of questions. Women love that to a point where this isn't even restricted on dating.\n\n\nThe things is, when it comes to dates, it is overall a good sign, it means she feels safe and understood. But at least in my personal experience, it's important to be weary about whether this is all the women want. I was quite often in the situation when she dropped \"I only see you as a friend\", despite not really listening to me whenever I told her something. I think a lot of women just enjoy the attention and the emotional comfort of an attentive listener. It makes me feel used on a regular basis and I therefore also have to drop women on a regular basis, at least when it is possible.\n\n\nSome women really care though and can listen too, at least in my experience it's just much more common that they keep on talking about themselves. ",
                "comment-author": "Smart_Hamster_2046",
                "replies": []
            },
            {
                "body": "The golden rule is let them talk.",
                "comment-author": "Seaweed-Weak",
                "replies": []
            },
            {
                "body": "who else are they meant to talk about ?",
                "comment-author": "EmptyBoxers11",
                "replies": []
            },
            {
                "body": "i think it’s more of a character and social skills thing than a gender thing because i’ve experienced that with men as well…",
                "comment-author": "Perfect-Sky-2324",
                "replies": []
            },
            {
                "body": "It's how women are these days. You're just a meal ticket for them anyway.",
                "comment-author": "Snow-Wraith",
                "replies": []
            },
            {
                "body": "Narcy symptomatic.",
                "comment-author": "Den_the_God-King",
                "replies": []
            }
        ]
    }
]