[
    {
        "title": "Should I let my mom back into my life?",
        "post-author": "Harshna023",
        "text": "Last night my mom sent me a friend request on Facebook. 6 months ago I decided that I couldn't handle the stress of her being in my life. I decided this after a series of events, during my life she has pawned and lost a lot of my things, including 2 cameras that my dad bought for me, my laptop, and then my deceased brothers playstation. \n\nShe also disappeared from my life for months with no contact and nobody telling me that she was in the hospital (including her ex girlfriend, and current girlfriend who knew,) after nobody saying anything I presumed that she was dead and went through the grieving process. \n\nWhen she came back for the first time I had no attachment to her, and had to try to learn to love her again. We went to dinner with her girlfriend, and my boyfriend at the time, they kept insinuating that he was abusing me, blatantly saying it out loud.\n\nWhenever I saw her after that she had to be with her girlfriend, which she has admitted is abusive and cheating on her, I tried giving her the resources to leave but she denied them. When I asked to see her, and only her she said that she would have to be with her girlfriend, even if I picked her up. \n\nI honestly partially want to give her a third (or is this fourth?) chance. She's still with the abusive girlfriend though, and I'm terrified that the same thing will happen again and stress me out to the point I can't sleep or eat. What do you guys think?\n\nTLDR; I cut my mom out of my life because she's fucked up a lot, pawned my things and told my non-abusive boyfriend that he was abusing me. Does she deserve a third chance? ",
        "comments": [
            {
                "body": "I’ve had a similar experience to a letter extent. I’ll spare you all the details, but I’ve gotten to a point where when she calls, I answer (which is extremely rare). When she texts I respond (again, rare). But I’ve had to emotionally detach myself and refuse any requests she’s makes with excuses (work, other family obligations etc). It’s probably not the healthiest thing in the world but ignoring the woman got to be nearly as stressful as having her in my life. Granted, like I said above she rarely contacts me at this point and even when she does it’s usually all lies. Definitely seek some professional help. In person therapy is covered by some insurance but online therapy is also available and somewhat cheaper. ",
                "comment-author": "sogomango",
                "replies": []
            },
            {
                "body": "I’m literally going through the same thing, but with my Dad. My siblings and I quit talking to him almost two years ago due to him being an abusive (verbal and physical) alcoholic. He lives about two and a half hours away in another state where I grew up. I went back for a brief visit this past weekend and text his wife to let her know I was in town (Friday) and if they wanted to meet up and see each other I would be down even though I had my reservations about it. Sunday rolls around and I never heard so much as a peep from any of them all weekend. my dad starts blowing up my phone after he knows I’m already home...he’s drunk per usual and Left me 3 voicemails and sends me texts saying that His wife didn’t see the text until now, that I am a piece of shit for never seeing or calling him and all the typical shit an alcoholic says to try and make sure it’s your fault, not theirs. After years of his verbal abuse i made sure to send one last text before blocking his number. I don’t plan on talking or seeing him until he gets sober and apologizes for being such a cunt. I don’t need that type of shit in my life and either do you OP. ",
                "comment-author": "Nofcksgivn",
                "replies": []
            },
            {
                "body": "I have been threw something similar but for me every thing was a bit more extreme. My mother was very abusive towards me and threatened me a lot and much more. Finally I got suck of it and cut her off... I dont regret it. But about 5 months later she had a heart attack. I had no idea. A family member called me to inform me she was in the hospital and that's all they knew. I tracked her down and when I finally found her I called her room in the hospital. She answered and all I said was \"hi mom.... its me... \" and instantly she started crying. I showed up to her hospital room about 30 minutes later. Asked what happened. She has heart disease, diabetes, kidney disease, and liver damage. 2 nights before she went to the er unsure of what was going on with her. She was having a heart attack. Doctors took a look and looks like she's had many heart attacks before without knowing it. Doctors needed to do emergency surgery on her cuz that heart attack could have killed her. They put 3 stints in her heart. When I showed up I told my mom I still love her. But I told her that of she didnt change for the better then I was NEVER coming back and this was her last chance. The next week my best friend since kindergarten was taking me to her prom. Prom day just so happened to be the same day my mom was getting discharged from the hospital. I called her and let her know where I would be at what times and said if she's ready to show me a new version of her I have yet to meet then she my come see me in my prom dress but if she's ever going to treat me the way she used to again then she was not welcome around me... my mom showed up that night. She cried and cried just at the sight of me finally smiling... she had not seen me with a real smile on my face since I was a baby. It's been 3 years since that happened. Currently my mom and i still dont have the absolute best relationship but let me tell you this. If i didnt have my mom right now I would be on the streets in the cold begging for a man to get back with me even tho him and I need space for ourselves right now. Earlier tonight I walked into the kitchen and my mom and I shared some pancakes in secret together. We laughed and shared funny stories together. I used to never have that with her. Does she sometimes still slip up?? Yes. No one is perfect. But she tries and the fact that I sent boundaries with my mom changed so much. \nI know it wasnt much advice and it was more me sharing my story but I hope that my story shows you that sometimes even when things aren't the best you should really try to make them work cuz you never know when the last time you'll see them will be.",
                "comment-author": "Skulls4Life",
                "replies": []
            },
            {
                "body": "Yes let her back in u only get one mom and forgiveness is freedom",
                "comment-author": "Barberpicasso",
                "replies": []
            },
            {
                "body": "This is a hard situation. But she is your mom. I’d take her back",
                "comment-author": "SadVeganXY",
                "replies": []
            },
            {
                "body": "My own thought is you should cut ties.\n\nYou will never get an audience with your mother without her abusive partner with her.\n\nFrankly, you're more magnanimous than I am, and that's not necessarily a good thing. She has stolen from you, and probably enough items to have her charged with grand larceny, and has done so with impunity.\n\nConsequently, you have taught your mother that she can steal from you and you won't do anything about it.\n\nI know it's difficult but I think the best thing to do is wait until she reaches out to you, which will probably be when she's ready to leave her abusive and controlling girlfriend. And if you do, you need to advise her that any abusive actions on her part, such as theft or inviting her girlfriend over, ***will*** result in police intervention.",
                "comment-author": "NobodysPerfectTen",
                "replies": []
            },
            {
                "body": "Good for you for being strong enough to stand up for yourself and cut her out! Unfortunately, her track record says she's not trustworthy.  Please take care of yourself and do not let her back in.",
                "comment-author": "Cool-Huckleberry-187",
                "replies": []
            },
            {
                "body": "My mother died of covid she was lovely and dedicated.\n\nI am at peace I got to tell her how special she is and thank her for all she did for me.  My father calls every Sunday but I only visited him once in 26 years is just a small and feeble little man that I remember having a whack of flaws.  I have let him into my home as well as I visited his home.  I know and he knows the end is near and we better inform each other how strained we are and unpack.  I not only felt relief my next thoughts were too bad he wasn't more abusive cause it felt good telling him his superpower is finding a Renaissance women  who caterior to your every whim!  Sounds like our parents are both in a bad place it's always best to get it off your chest and I did not know that to 52.\n\nI am civil when they call and mostly one sided with me agreeing and repeating.  However when he gets catty I tell him to grow up and mind his own business.  He loves inter generational and clan drama so every time he speaks ill of someone my response is \"Please underline what part of the story do you think is my truth.  We all know your truth what is our not what is my truth.\"  Gosh it is good to have tight boundaries because they love to step on by and over that line.  I paid a shrink not a therapist because I needed an instant quick fix for years of shit and didnt want to wake up on day with daddy issues which in reality was where I was at.  Then I paid for a dsm4 or 5 to rule in or out mental illness which was done by a therapist who then review it with me and then my shrink reviewed my overall health with my GP.  What I can tell you is that I would not be strong enough to walk a day in your shoes as that is a whack of trauma on your already overworked brain.",
                "comment-author": "Born-Preparation4950",
                "replies": []
            },
            {
                "body": "U have to look, and u and your mom like an outsider watching the show. U know the relationship is toxic, and if u have kids one day, u would want the kids to witness this.\nI left my mom at 9 yrs old and got a restraining order on her. It's alright to turn blood away. Next time u run into her saying sorry, Mama, I don't know u. It's your turn now hun. Love life be free.",
                "comment-author": "askyo_girlaboutme",
                "replies": []
            }
        ]
    },
    {
        "title": "What do I do?",
        "post-author": "Sir_Sarcasm_the_3rd",
        "text": "So Recently I've been trying to get 50/50 time with my mom and dad who split up 3 years ago. After about 3 weeks of ignoring this my mom sat down with me and she showed me that time is more even then I'm thinking it is. I realized that the reason I was going for this is because my dad was mentioning it constantly and I was too dumb to see that I was being pressured into doing. Maybe I'm just overthinking this or maybe this has something to do with my bad mental health. I'm not sure what to do next.\n\n",
        "comments": [
            {
                "body": "Take it as a compliment that your dad wants more time with you. Tell him he needs to contact your mom and work it out with HER. You’re being put in the middle when he spends his time making you feel guilty! So - next time you feel guilty, send that guilt packing because you don’t own one single second of it.",
                "comment-author": "Peekaboozer",
                "replies": []
            },
            {
                "body": "This really depends on your individual relationship with either parent. If your dad is really a good guy, or of you think he's just trying to leverage you against your mother, or even vise versa; then you need to weigh your options. Your parents need to have a talk, and even the three of you might need to speak to work out a compromise for what each of you want.\nJust keep that in this whole situation, YOU are the most important person. It's you and your time that they're pinning for, not the other way around. You need to do what you feel comfortable with, don't let one or both parents make you feel pressured to prefer one over the other.",
                "comment-author": "DawnDuckSoap",
                "replies": []
            }
        ]
    },
    {
        "title": "Mother and father fighting over house",
        "post-author": "Queenzette",
        "text": "So my parents are divorced and before they did we used to live in another country(lets say Tennessee) and they own a house there that is really huge and it took them a long time to pay when they were together and they both have their names on it. They separated in the country I am right now (lets say Houston) and im living with my mom, stepfather and siblings and my dad went back to Tennessee bc his family is there. So it would make sense that he stays in that house since he wouldn’t have to pay rent bt now my mom doesn’t want him there anymore supposedly its her house now even tho she is in Houston with a new house that my stepfather is paying. My mom is letting someone else stay there for free which Me and dad had no idea at all. And we think is the man my mom had an affair with when she was married with my dad (. My dad just found that out when they divorced) and we know he might be my sister’s real dad (which my dad doesn’t care anymore because he raised her too , my dad is a really calm and kind person so he doesn’t care that she isn’t his blood) . That house will be on my name later on according to my dad and he told me that when he was still with my mom . So I guess now my mom wants to give that house that my dad paid (it was a lot of money and dad barely paid it being a business man) for to the man she had an affair with instead of me her own daughter??! . Idk what I could do. My dad can get a lawyer and sue my mom but he doesn’t want to get that far bc she is taking care of me and my siblings.. I was thinking to tell my dad to put the house at my name (to give me his part) that way if something happens to him the house won’t be let alone to my mom and she would just give it to that man. Idk what to do honestly, im in college and I would graduate in about a year. And I don’t want to leave anything to that man something my dad worked so hard for .   ",
        "comments": []
    },
    {
        "title": "Sister Sister",
        "post-author": "improbablya-jerk",
        "text": "Hey everyone,\n\n(Tl;Dr: my 25 year old sister disappeared without a trace, probably back to her abusive ex, I don't know what (if anything) I should do. Story is long but very useful for context.) \n\nJust as a heads up this has a potential to be a long one. First post on Reddit, but I really don't know what to do with this one. \n\nMy family and I (22f) have been having a hard time with my stepsister (25f). For the sake of the story we'll call her Rachel. She's my stepdad's daughter, and due to some pretty nasty business on her mom's side she ended up growing up with her mom and my other stepsister, despite us offering to let them live with us. Her mom was a real piece of work, and she and her boyfriend abused were horrible to my stepsisters, but particularly to Rachel.\n\nAll through high school and after, my parents did whatever they could to help her, but it was made complicated by her mom. \n\n After high school, she was in and out of contact with us, contacting my parents when she needed money or help (including getting bailed out of jail) until the time when she was 22/23 and landed a solid job as a truck driver. During that time she appeared to be steady and doing well, and was in close contact with our family, and we were trying to be a support system. \n\nHowever, when she was 23 she went into another self-destruct cycle, in part due to drug use that we didn't know about, and went no/little contact with us. During that time, she moved around with her abusive boyfriend and was apparently using drugs heavily. Even though she didn't want us around, my parents always kept an eye on her and when she was arrested back in January they bailed her out, without her knowing it was them. \n\nUnderstandably, the continuous cycle of needing money that would never be paid back before turning around and telling my parents to go fuck themselves wore on my parents and caused some real trust issues. \n\n(Just to make it clear: my parents are some of the hardest working people I know; my stepdad climbed his way out of poverty by working his ass off. My mom's dad died when she was in high school and though her family was a little more well off, she still had to work her butt off to get to where she is today. They've supported one another through it all and are successful and accomplished healthcare professionals, and are my role models. We're reasonably well-off, not struggling financially but not loaded haha. It's less about losing money than that she always promised to pay it back and never did. And it wasn't $20 bucks here and there, we're talking at least one car) \n\nIn September of this year (about 5 weeks ago), she resurfaced, and asked my parents to help her get away from her boyfriend. They picked her up, and let her live with them while she got back on her feet. In this time period, they really tried to help her, and had gotten her a case worker to help with her employability and mental problems, and were in the process of getting her a counselor through the same program (delay on the counselor b/c of wait-list and insurance processing). In the past week, she had gotten a job at a local grocery store and everything seemed to be going great. She seemed receptive to everything, and it seemed like everyone was of the opinion that it would be a process but everyone (including me, but I'm a 17 hour drive away at grad school) was on board to helping her get well.\n\nA few weeks prior, Rachel had smashed her cellphone after talking to her (ex) bf and he had tried to be manipulative. On Wednesday of this week, my mom replaced it as she needed one for work, with the understanding that Rachel would help pay for it with the money she was making from her job. \n\nThat night the three of them talked about weekend plans. The next morning, mom and dad went to work, and when my mom got off early, she tried to call Rachel. The number had been changed. When she got home, the door to Rachel's room had been locked, and my mom panicked thinking she was dead inside, but knew in her heart she was gone. When they finally got the door open Rachel's clothes and everything they had bought her was gone, and so was Rachel. \n\nMy mom called her case worker and her job, and nobody had heard from her. \n\nShe didn't even leave a note. \n\nBecause of the fact that all of us (me, my parents, and my boyfriend) have been blocked from her FB page, and it looks like her ex bfs FB is either deleted or blocking us too, we are assuming she's back with him. We have no idea how she managed to get back to him because she had no transportation and no money, but that's the most likely outcome, especially as all her stuff is gone. And this isn't the first time she's done this; the last time she left it was without saying goodbye to me. But this was so especially thorough and cruel, and my parents are done. \n\nI'm alternating between being pissed at her and being totally numb. But I'm also worried about her. I've tried looking through Facebook and Instagram of her and mutual family members, and can't find a thing. If I just knew that she was out there somewhere alive I'd be less worried. Is there anything I can/should do? ",
        "comments": [
            {
                "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/justnofamily] [Stepsister trouble, soon to be NC](https://www.reddit.com/r/JUSTNOFAMILY/comments/9qan5k/stepsister_trouble_soon_to_be_nc/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
                "comment-author": "TotesMessenger",
                "replies": []
            },
            {
                "body": "I’m just seeing this post today as I became a member of this group just now. It’s been a couple of years now. Do you have an update? Whatever happened? Did she get back in touch? I hope you’ve been able to move on. I too have someone in my family who I’ve always tried to help but who never helped themselves. The hardest thing is to let go of the worrying and just let them live their lives until they figure out they must change on their own. We can never make them ready.",
                "comment-author": "Peekaboozer",
                "replies": []
            },
            {
                "body": "It's time to let her go.  You can live someone but let them go and learn to be ok.  I have a sister who was a drug user and physically abusive to me and my Mom.  She was still trying to fight with me after I was in my thirties.  I finally had to tell her to leave my home and she was no longer welcome.  I haven't spoken to her since 1999.  It's difficult but you have to realize that even family isn't excused from behavior that you wouldn't tolerate elsewhere and if they add no value to your life it's time to excise them from it so they dont steal your happiness and drag your life down with theirs.  You can't talk someone into getting straight.  Unless they are a minor, they know what they are doing and only they can change it.",
                "comment-author": "Proper-Fan8006",
                "replies": []
            }
        ]
    },
    {
        "title": "Considering running away possibly?",
        "post-author": "reddituser-345675",
        "text": "My parents are fighting allot more, To the point to where I just cant take out anymore. Every single fucking night They bicker at each other and it hurts me fucking emotionally. What should I do?",
        "comments": [
            {
                "body": "Hey man hope you're doing okay. Feel free to message me. Reached rock bottom today my parents said they are finished with me.",
                "comment-author": "Budget_Examination15",
                "replies": []
            },
            {
                "body": "Record them both for a few nights. One day call them to the table. Say u guys need to listen to the recording I made for class. Shock them. Tell them u both need to remember children live in this home to. For my mental safety, this needs to stop, or I'm sharing it with my school counselor. My hubby and I allow our children to tell us to stop your messing up the night for us. We hug them say sorry we got away from our calm place. Kids have the right to stop fights",
                "comment-author": "askyo_girlaboutme",
                "replies": []
            }
        ]
    },
    {
        "title": "I’d like to start by stating that I hate self victimizers.",
        "post-author": "3depressykitties",
        "text": "For a long time, I have felt outcast from my immediate family. I’d attend birthdays, thanksgivings and Christmas but I never really felt like one of them.  It’s a long story but basically my father and I have had a rollercoaster of a relationship.  Everything from him “touching” me once when I was 16 and he was on ambien to basically never showing any form of affection and only proud of my accomplishments that reflect on him.  Let’s not forget he used to use me as a coke plug when I was 18-19. I am the oldest and my three younger sisters all seem to assimilate with ease.    I want to be past this. I want to attend these events without feeling small and broken.  I want forgive them and be unaffected, but I fail every time. His birthday brunch is this Sunday and per the usual my step mom has made a group chat for us to prepare.  My anxiety is building. I’ve made attempts to contribute to this conversation but it is like I am a ghost in the room.  The last talk my dad had with me was more like a break up. He admitted he needed to come to terms that I was never going to lead the life he wished for me and that he would stop trying to connect all together because it is obvious I don’t want to be a part of the family.  I do, desperately.  But to me it is obvious that my choice to live minimally is unacceptable. How do I grow the self confidence for this not to hurt so bad?",
        "comments": [
            {
                "body": "I too have never felt like part of my family. I get anxiety just thinking about going to thanksgiving. Anyway, i think you should tell them how you feel. Let them know that you want to feel like part of the family. If they attack you for this it might be better to limit your time with them. I am in therapy right now for kinda the same thing and I am still trying to find a way to not let them affect me emotionally. I am lucky to have a husband and in-laws that love me as part of the family. So i find that helps alot. That I dont have to go to my family for emotional needs... They could never give me that anyway. Point is find friends that you can lean on it helps so much. I wish you luck. Happy holidays.",
                "comment-author": "MaloryLoki1920",
                "replies": [
                    {
                        "body": "I feel that way about my immediate family, too. The only relative I have left is my brother (other than my husband).  His wife doesn't like me and has turned my niece's against me. I'm very close with my brother and don't want to rock the boat, but I'm hurt. Don't know what I did to turn her against me. Frankly, she's not a very nice person, is extremely possive over my brother. I think she's jealous of our relationship. He's in the military and travels a lot, so we have few opportunities to see each other, but she makes it nearly impossible.  What do I do? I don't want to lose my relationship with my brother,  but I am afraid that someday she may give him an ultimatum. Me or her.",
                        "comment-author": "Cultural-Clue-71",
                        "replies": []
                    }
                ]
            }
        ]
    }
]