[
    {
        "title": "My son ruined my life",
        "post-author": "DowntownCost8078",
        "text": "My son is 28 years old and he went nowhere in life.  He became an alcoholic who loves drugs.....he can't hold a job because of his drinking,   when he's sober he's an angel.\n\nWhen he drinks he turns into an evil person, last night he fought a random stranger while he was drunk at 11am.  My sons can't even open his eye and he needed stitched. (This is not the first time this has happened)   I got a call that he was in the hospital\n\nHe didn't even wish me happy mother's day today,   he called me asking for food.  I cried on the phone and he told me to grow balls.\n\nHe lives alone, and he's been fired at every job because he's drinking.\n\nHe ONLY has me.   His grandparents from dad's side,  stopped talking to my son when he was 12.   They are rich and they would spoil my son,  once I left his father they blocked us.\n\nHis dad is a drunk \n\nI don't know if it's abandomnet issues, or inherited his dad's alcoholic behavior.   All my family doesn't want anything to doo with my son because of his actions in the past.  \n\nI need advice because I feel like I lost as a mother.  I DID EVERYTHING FOR HIM\n\nHELPP",
        "comments": [
            {
                "body": "Happy Mothers Day!  I hate to say this but your best path forward is to tell your son not to contact you anymore until he has completed a recovery program and been sober for an extended period of time (at least 6 months).  I’d recommend you look up Al Anon.  It’s hard to find good Al Anon meetings so please be patient and don’t give up.  \n\nYou cannot help your son.  He has to help himself.  If you give him anything, that’s one more dime for him to abuse substances.  Don’t let him stay with you, don’t feed him, anything until he has stable sobriety.\n\nAlso, look up groups on here for dealing with sons/daughters that are addicted.",
                "comment-author": "Easy_beaver",
                "replies": [
                    {
                        "body": "As a former addict... I have to say... this is the way. \n\nHe must want to get better, and that is a deeply personal choice. It's been my experience that supportive withdrawal from an addict's life can often swifen a rock bottom. Left with few lifelines, sometimes treatment can become the only option left for the addict. \n\nI'm also a mother. So I can imagine how difficult it is. Addicts do recover. But whether or not your son gets clean, I promise THAT WON'T HEAL *YOU*. Addiction affects everyone who loves an addict. \n\nYou deserve peace and happiness, regardless of the choices your sick son makes. We parent as best we can, but at SOME POINT, we must let go, especially if we're enabling bad behavior and possibly preventing recovery. I think you know you are probably beyond that point. \n\nBig hugs, and best wishes! Happy Mother's Day.",
                        "comment-author": "Penalty-Awareness",
                        "replies": []
                    },
                    {
                        "body": "I will be 11 years sober this June.  The one thing that made me realize I needed to change something was that my family turned their back on me. It was either get it together or die. I was homeless and had nowhere to go except the Salvation Army.  I am now a college graduate with a good job, married and just recently started traveling, went to Ireland last year and have plans for iceland in September.  We do recover, but we have to hit bottom first and as long as he has you to help him he will never get there.",
                        "comment-author": "e160681",
                        "replies": []
                    },
                    {
                        "body": "Yes.",
                        "comment-author": "blaykers",
                        "replies": []
                    },
                    {
                        "body": "Please don’t abandon him completely keep in touch but set boundaries. Addicted person needs emotional support. You never know he might change",
                        "comment-author": "ak98230",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Please seek help with r/alanon. You need to focus on yourself and not the alcoholic. You are enabling his behavior and need to set boundaries. I’m so sorry you are going through this.",
                "comment-author": "stircrazy1121",
                "replies": []
            },
            {
                "body": "He’s an adult. Nothing can be done anymore. The age at which he could be disciplined and set straight is gone. I suggest you distance yourself from him. You’re his mother and you love him but he’s also abusing you. You’ve done everything right on your part. It’s not your fault he turned out like this. You should enjoy your life.  Happy Mother’s Day!",
                "comment-author": "Sufficient_Might3173",
                "replies": []
            },
            {
                "body": "Please listen to easy_beaver. It's the only way.",
                "comment-author": "16Bunny",
                "replies": []
            },
            {
                "body": "Happy Mother’s Day!",
                "comment-author": "astronerdx",
                "replies": []
            },
            {
                "body": "Happy Mothers Day! Sending you a big hug.",
                "comment-author": "Isntshelovely7",
                "replies": []
            },
            {
                "body": "Happy Mother’s Day…remember that you can only do so much as a parent and even if you’ve done your best to you, sometimes you have to let go and realize that adults make their own decisions. \n\nI have an aunt who had to watch her son battle a drug addiction for years and it was extremely hard on her and the rest of the family. She had to see him skinny, out on the streets and still knew she couldn’t intervene. He had to hit rock bottom to realize he didn’t want to do drugs anymore and once he started to make a change on his own, that’s when she knew it was real and could step back in as a parent. He’s been sober for decades now and even told his mom that if she would have intervened while in the middle of his rock bottom, he probably wouldn’t be alive because she would’ve most likely been an enabler. \n\nI also witnessed this with an uncle, drugs again, and my grandma was his enabler, so I also saw how enabling hinders an addicts growth. My uncle is currently still battling with drugs and relapsing constantly. Unfortunately, his mom, has passed and he can’t depend on her any longer for support. Last I heard, he was in a pretty stable situation but he’s in his 60’s, doesn’t have a decent job, or anything to pass down to his son and I know that eats at him everyday. \n\nI’m not saying don’t intervene, I’m just saying that sometimes parents think they’re helping, but they’re actually making the situation worst or just not actually being helpful to the healing process. \n\nIf your son’s life is ruining your life and he is an adult, I would stop helping him. I’m not a mother so, easier said than done, right? I can only tell you as someone who witnessed this a few times. I hope your son gets better and I hope you two can be on better terms.",
                "comment-author": "_Angiebtv",
                "replies": []
            },
            {
                "body": "Alanon is the place to go to get help with this.",
                "comment-author": "imemine8",
                "replies": []
            },
            {
                "body": "Im so sorry as a mother it muat hurt to watch your sons selfish behavior and addiction issues wreak havoc its never easy to watch them cause so much damage \n\nBut i say this with as much sincerity and conpassion as i can but you need to let him go hes almoat 30 years old hes made those choices that lead him to where he is now he could get help but he's not getting help and it won't happen till he reaches rock bottom but honestly its also for your own mental health and boundaries at some point you either give him the ugly ultimatum or its out the door and on his own \n\nAnything that you do at this point would only be enabling and that isn't going to help him.",
                "comment-author": "ouelletouellet",
                "replies": []
            },
            {
                "body": "We all have choices to make in life. Your son has made some really hard ones.  You need to say no more. \nI work with addictions every day and until they hit rock bottom they will choose drugs and alcohol every time.  They need to drag themselves out of it.  You can not do this for him.\nYou need to move on with your life and make it as good as possible.  He will be upset, he will say nasty things you will need to walk away.  Don't let him drag you down as well.",
                "comment-author": "Mental_Signature_725",
                "replies": [
                    {
                        "body": "You gotta put the oxygen mask on yourself, first, mom... comes to mind.",
                        "comment-author": "Penalty-Awareness",
                        "replies": []
                    }
                ]
            },
            {
                "body": "All great advice here from people who have been through this.  I have, too.  The lesson I learned as someone who loved the addict, they have to hit rock bottom before they can be serious about wanting to recover.  \n\nRock bottom looks different for everyone.  But remember, any support you give in terms of food and shelter, those things we often feel we must do, are the things that make rock bottom comfortable for the addict.  As long as they can get a meal and a couch to crash on, rock bottom will last forever.  \n\nHappy Mother’s Day.  I hope this all turns out well for you.",
                "comment-author": "Objective-Sale-4072",
                "replies": []
            },
            {
                "body": "Happy Mother’s Day! \n\nYour son is already an adult and has to take responsibility of himself and his actions. \n\nYou need to set a firm boundary and draw the line that he needs to change, go to counseling, and/or rehab. Having you take care of him after situations like this is tolerating his behavior and reinforcing that negative actions. \n\nIt will not be easy. But it is better than doing nothing now and letting it get worst. Hope you the best OP.",
                "comment-author": "Connect-Wash4956",
                "replies": []
            },
            {
                "body": "I'm sorry. Happy mother's day anyway.",
                "comment-author": "macaroni66",
                "replies": []
            },
            {
                "body": "Go to an Al-Anon meeting.",
                "comment-author": "125acres",
                "replies": []
            },
            {
                "body": "Look into Naltrexone and The Sinclair Method. Naltrexone is a medication to help alcoholics stop craving alcohol. Please watch this video by Dr Sinclair…. https://youtu.be/hGxNLnJmWkc?si=voeBJl0e8tQGhZCc",
                "comment-author": "tubistyle",
                "replies": []
            },
            {
                "body": "Sooo very true",
                "comment-author": "Mental_Signature_725",
                "replies": []
            },
            {
                "body": "I HIGHLY HIGHLY HIGHLY recommend the Put the Shovel Down YouTube channel. Amber Hollingsworth has put so much free content out there for families dealing with your situation. They also have very affordable courses, online communities, and more. You can even do online consultations through her practice, Hope For Families Recovery Center. \n\nYou need to get some support and some way of making sense of what’s going on and how to be a loving mother while not enabling the toxic/unsafe behavior. \n\nThis is so hard. You’ve got this. ",
                "comment-author": "shoshinatl",
                "replies": []
            },
            {
                "body": "Happy mothers day",
                "comment-author": "iambugs77",
                "replies": []
            },
            {
                "body": "I am so incredibly sorry for all you’re going through. You might want to attend something like Al-Anon. The fact is you can’t fix him. You didn’t cause this and you cannot fix him. When he calls you demanding money for food and then tells you to grow balls tell him you clearly do not need balls because he has them and that’s what made him into a drunk. The balls are one of the weakest and most sensitive body parts that any person can have. As hard as it is especially when he’s your baby and you love him and I know how that feels. You’re just gonna have to start exercising tough love with him. Don’t run to him at the hospital when he gets into fights. Do not give him money. And when he starts making demands of you, tell him you have to go and hang up. Don’t even argue about whether or not you have to go just say I have to go and hang up.\nI am incredibly sorry!!! (((Hugs)))",
                "comment-author": "Such-Kaleidoscope147",
                "replies": []
            },
            {
                "body": "Rehab doesn't work for everyone, AA doesn't work either for some people, especially if you suspect there's a genetic component. \n\nA lot of people are making progress with medication-assisted (Naltrexone)  programs like The Sinclair Method that reduce drinking tolerance over time.",
                "comment-author": "cardinal29",
                "replies": []
            },
            {
                "body": "I have been clean 6 years, the one thing that made me decide i had to be done with that life was my family all of them completely turned their backs on me, I was clean 2 years before they started to come back around.  I had nothing  left but my family and then they were gone as well I had nothing and no one. I had to get clean. Best choice I've ever made..",
                "comment-author": "Flaky-Zebra5583",
                "replies": [
                    {
                        "body": "Congratulations🎉",
                        "comment-author": "AmberIsla",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Man I love my mom. We have had our issues but lucky for me I’ve always hated drinking. This is why it’s always important to be wise with the partner you decide to have children with. \n\nThat said, he needs to check into help and if he doesn’t there really not much you can do. Does he have friends? Etc?",
                "comment-author": "Hot-Sleep7269",
                "replies": []
            },
            {
                "body": "Did you get him into therapy as a kid?",
                "comment-author": "Noonull",
                "replies": []
            },
            {
                "body": "Al Anon will help how to find happiness whether the alcoholic is drinking or not. Many of us in your shoes. Hugs 💕",
                "comment-author": "PickOrChoose",
                "replies": []
            },
            {
                "body": "What is done is done. My father was homeless and a drunk, he abandoned me and my sister at 2 years old. I am 31 years old now. It looks like he finally stabilized at 50 years old, I hear he got another woman pregnant and has a toddler with her and is actually raising him. It took him that long to finally mature. Let your son figure it out. You need to move forward with your life, this is coming from someone who was abandoned by a drug/alcohol addict.",
                "comment-author": "gabriel2450",
                "replies": []
            },
            {
                "body": "Stop helping him!\n\nI know this sounds hard, but as long as people keep him, he will not have a reason to change his life. \n\nMy grandparents also kept helping my father, that way he could stay drinking because everything was taken care of. \n\nTell him it's time he fix his life, until then, he can't call you anymore for any help. And stick to it. Het therapy if you need help staying strong. You can do this!",
                "comment-author": "DBgirl83",
                "replies": []
            },
            {
                "body": "Why are you saying your son ruined your life? This who thing is very narcissistic quiet possibly could have related to his alcoholism. If you truly are the only person in his life then it’s your job to say you’re done and tell him he should go to rehab. Agree with the Al Anon you should go to meetings. Oftentimes parental behaviors or childhood trauma often lead to these issues. People have to want to get help and those with loving supportive family can push someone to try to get help.",
                "comment-author": "ElectronicAd2846",
                "replies": []
            },
            {
                "body": "Well if you're asking reddit for help we just need to be honest. Which no one else will be on here. But it's already a lost cause. It's up to him to turn things around.",
                "comment-author": "Open_Teaching_4411",
                "replies": []
            },
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "You've done all you thought you could do for him. If he is addicted to drugs and alcohol, you are helping him to steadily trying to help him. You are helping him to kill himself",
                "comment-author": "Godfamilyhealth",
                "replies": []
            },
            {
                "body": "I am not looking at any other comments. But as a 70 year old father and grandfather I can tell you that you must stop doing everything for him. Let the state welfare dept do for him now. Homeless shelter, rehab, etc. a social worker will take over. For him, for you, he must sink or swim. Like the mother bird that forces the young out of the nest to live or die. It has to be done. Your goal in life is to realize now that you are blameless. And he is not what identifies who you are.",
                "comment-author": "avidbookreader45",
                "replies": []
            },
            {
                "body": "He needs a recovery group session. And to replace the addiction with something productive. Talk to him about his feelings and be understanding.",
                "comment-author": "Maniacgritual37",
                "replies": []
            },
            {
                "body": "Happy Mother's Day!  I wish my mother appreciated me.  It sucks.  I have been recently disowned by my mother because of my brother. My brother did some illegal things he shouldn't have done. I warned him about not doing drugs and getting too close to minors.  He wouldn't listen and got himself into trouble.  My mother has a gang mentality, that we have to support my brother no matter what... I don't support what he did, if you do the crime, you do the time. Yeah, it's going to hurt and it was his decision. \n\nI am in my late 30s, I am a veteran, I got a degree and I am married.  I have never done anything to wrong my mother.  My brother on the other hand is selfish, he uses my mother, he didn't invite her to his wedding and distanced himself from her because of his unlawful acts. My mother is now heavily invested in him because of the trial. I know if my mother were to get in trouble or need help, he would do nothing for her.\n\nWhat I am trying to say is you really can't change people.  People will do what they want to. All you can do is do your best by them. If they don't recognize what they had, I hope they do sooner than later! You did your best and that is all you can do!  I wish you the best and again Happy Mother's Day! \n\nYou did the best you could!  Don't beat yourself over situations you cannot control!",
                "comment-author": "Fox_The_Wandering",
                "replies": []
            },
            {
                "body": "How have his choices ruined your life? He’s ruined his life not yours. He’s an adult, at some point you have to try not to let someone else’s life choices get to you. It’s hard but it can be done",
                "comment-author": "PoohShysty",
                "replies": []
            }
        ]
    },
    {
        "title": "Fuck Mother's Day",
        "post-author": "WritingGlass9533",
        "text": "So I worked super hard to help our neurodivergent trans son get through everything. Years of transporting him back and forth to school. Year after year after year of making it work. Today? Not even a text because some how, I wasn't perfect.\n\nI am happy for my son for being successful. I am angry with my son for being unable to acknowledge how we supported him every single step of the motherfucking way. Goodbye and happy fucking Mother's Day to whoever is your mother now. God knows I tried.\n",
        "comments": [
            {
                "body": "I’m sorry that happened. I am not a mom, sorry, but just saw this as I went to make a post and wanted to just say happy Mother’s Day. Whether they acknowledge it or not, you’re a good mother for doing so much for so long, and I’m sure it was mentally taxing on you and you still did it. I hate that he didn’t express his gratitude towards you but that doesn’t take away from all you’ve done and how selfless you’ve been so don’t lose sight of that!",
                "comment-author": "oooopsiforgot",
                "replies": []
            },
            {
                "body": "I also had a shitty mothers day, although my teenage son tried to make it better. He's addicted to drugs and was puking the whole time pretty much. Also got chewed out by 2 separate neighbors.",
                "comment-author": "WorldlyAssumption260",
                "replies": [
                    {
                        "body": "Let's hear it for shitty Mother's Day and everything I got is crossed for you and your son. Also, fuck your neighbors!",
                        "comment-author": "WritingGlass9533",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I feel ya, my husband said to me yesterday can we do it next weekend. Wouldn't be so bad if he didn't say the same thing last year and the year before. It's not the same and somehow just gets brushed under the rug so nothing happens the following weekend.",
                "comment-author": "o0Xanadu0o",
                "replies": [
                    {
                        "body": "Please... next year, make plans yourself FOR yourself or yourself and your kids. Do whatever it is that you most want to do. Don't wait on him. And then next year, when he goes to say let's do it next weekend you can let him know that you have already taken care of it since he always forgets, and you will be doing _____. \n\nYou deserve a great experience - happy Mother's Day!!",
                        "comment-author": "XaciousT",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Well I have two daughters who didn’t even send me a text. It hurts but I have learned to accept that they both are selfish shitty adults who blame me or someone else for every single mistake they have made in their lives. And…No I wasn’t a shitty parent and have three other children who are there for me. I lived my life from age 17 for my kids. Life doesn’t always work out like we hoped it would. But hey….Here’s to Shitty Ass kid’s🥂🥂🥂🍻🍻🍻Have yourself a glass and fuck them",
                "comment-author": "Sensitive-Scheme4646",
                "replies": [
                    {
                        "body": "Cheers! 🍻 and fuck those kids! JFC we did the best we could.",
                        "comment-author": "WritingGlass9533",
                        "replies": [
                            {
                                "body": "Exactly 🫶Happy Mother’s Day’s to you!",
                                "comment-author": "Sensitive-Scheme4646",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I decided this year I don’t want til celebrate mothers Mother’s Day because I get my hopes up for a noice day and that never happens.",
                "comment-author": "essentially_hannah",
                "replies": []
            },
            {
                "body": "Happy Mother’s Day. You did your best and I’m sorry that’s not always enough for some people. It sounds like you did a great job.",
                "comment-author": "Caseypenn11",
                "replies": []
            },
            {
                "body": "Mother’s Day sucks ass for all moms imo",
                "comment-author": "nostolgicqueen",
                "replies": [
                    {
                        "body": "Aw, I tried hard to make it special for my wife. Made pancakes for her while she slept with the younger one. Asked her for any two jobs been on her list and I’ll do them no complaining. Made her a photo album of our boys, and bought her chocolates. Ended the day with a movie, bath and then the rest… she said it was a great day :) \n\nBuuuut. For my own mum I was gonna invite her over for roast dinner but I was sick so instead I FaceTimed her only.",
                        "comment-author": "AnothrRandomRedditor",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "I feel like many forgot about it this year. Heck I honestly was planning on skipping church on that day because of it but found out i was scheduled to serve. I have no mother nor mother-in-law and struggle with infertility so it is a somber day. Last year I cried. This year it just seemed like from my view that it was kind of not pushed as much.",
                "comment-author": "OhmHomestead1",
                "replies": []
            },
            {
                "body": "Sorry you weren’t given a proper Happy Mother’s Day text or call. My mom was the world to us kids (3) I know occasionally I forgot birthdays and special occasions. My mom knows I love her. Unfortunately she passed away 7 years ago and I have truly missed her.  There’s not a day goes by that I don’t think about her. In my book she passed away way too early in life. \n\nAs a adult who has no mother in my life but memories.  \n\nI would like to wish you a. Happy Belated Mother’s Day.",
                "comment-author": "BlackFish42c",
                "replies": []
            }
        ]
    },
    {
        "title": "Can I just vent about my shitty family for a minute. Not looking for advice or sympathy I just want to rant",
        "post-author": "No_Material2946",
        "text": "Well my where the hell do i start? I guess my trauma and mental illness stems a great deal from my mother. She is a toxic, energy sucking vampire who will destroy anyone she deems to be below her..and in her own eyes it's her daughter...me. Growing up I thought I was an angry child. It turns out I'm not I'm very kind and thoughtful..I was just in a family who didn't value or respect me as a person with their own individual wants or needs. Growing up I exhibited normal emotional reactions to things and I was always dismissed and told I'm faking it for attention...I'm manipulative...selfish. all of these words and thoughts stemmed from my narccisitc mother and she instilled them upon my brother and father who both treated me as she treated me. Needless to say I became the black sheep of the family..my brother the golden child who could do no wrong. I never even got into trouble Growing up. I didn't have alot of friends because of my parents so i was doomed to spend my time in our cramped little trailer hearing them fight or they would fight with me. I was always name called from a young age..I was stupid, useless, good for nothing. I could never do anything right in their eyes. I don't know why they hated me so much I never stole..the baddest thing I did as a kid was drink but who didn't. I was just always given a hard time. I dealt with alot of depression and suicide thoughts growing up. I used to cut myself. I remember showing my mother my cuts and she told me i was a lunatic and to never tell anyone or I'm going to a mental hospital. No love or support there....the basis of my life with my parents particularly my mother. No love. So I buried alot of my mental health issues and they festered. I was always so sad and angry living at home being bullied by my parents and limited help. I was a loser growing up I didn't have nice clothes I was over weight..always alone in my house with my crazy parents. Needless to say when I met my first boyfriend at 19 I was over the moon to rush into that relationship and move out. Turns out the hero I thought i was running too ended up physically and mentally abusing me for 4 years. My parents knew about the abuse they seen the bruises and no one protected me. I felt trapped like I couldn't leave the relationship. It was either stay with him and grt abused or go live with my parents and get abused. I wanted neither. Eventually I left my ex and I was able to live on my own with my daughter. But my parents are still involved in my life. They don't help they only shoot off and bring me down. I feel hurt and misunderstood by them that I never got the love and support I needed and deserved growing up or after my abusive relationship. My mother told my ex before she \"knew how I could be\" so she understood...fucked right to say that to a man you know is hitting your daughter. I'm 31 years old I'm tired of letting them have control over my emotions. A part of me still wants a relationship with them but I know it won't happen they are mean and toxic and fail to see their faults. Even now I'm doing better in life I quit drinking and I'm going back to school for nursing and they still are making me out to be a bad person to fit their narrative. It just hurts when your biggest enemy is your parents they are the ones who are supposed to love and support you the most in this life ",
        "comments": [
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "Dear OP, cut them off, if not for yourself then do it for your daughter.",
                "comment-author": "Mysterious-Art-90",
                "replies": []
            }
        ]
    },
    {
        "title": "I hate my sister in law",
        "post-author": "IndividualTea6613",
        "text": "i know there’s a stereotype where the husbands sister hates his wife because it’s a new person taking away their attention. Regarding this story I do not believe that this is the case. She has left my brother at a gas station multiple times. She has physically abused my brother multiple times that I and multiple other people have seen. She chased our neighbor to their front porch because they were parked on the neighbors lawn and they tried to move them from their property. She had gotten a husky mix and left her out in the desert heat during 4th of July for 3 days just so she could go on a cruise ( there was no sitter) the dog had no water or shelter besides a kennel. We had gone there and there was feces and urine everywhere (they did not inform anyone of their dog being left outside for 2 days). They ended up rehoming the dog. This is just the scratch on the surface, I legitimately hate her and I do not know how I can maintain a relationship with my brother.",
        "comments": [
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "SIL has a mental illness,  sounds like it. Give your brother support, and a place to stay.",
                "comment-author": "FaraSha_Au",
                "replies": [
                    {
                        "body": "I just don’t know how I can do that",
                        "comment-author": "IndividualTea6613",
                        "replies": [
                            {
                                "body": "Let him know your place can be a port in the storm, and that you love him.",
                                "comment-author": "FaraSha_Au",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "title": "My sister seems like she has started to dislike us and started being mean towards us. I don't know why",
        "post-author": "Fresh_Crow_2966",
        "text": "I think I need advice. I keep thinking about it and don't know why she is like this all of a sudden, I can't think of something bad I've done to her. \n\nStarting from the beginning of the changes about 2 years ago she got off one medication she had for mental health. She had a really hard time and we helped her but she seemed to think we didn't care about her. We let her know we love her.\n\nShe got better over some months and started working. All was well but she got a boyfriend and changed. Barely spending time at home. Getting more mean complaining about every little thing and things she would enjoy with us she didn't want to anymore. She was never really given a hard time or had us be mean to her.\n\nShe complained she was doing too many chores over the year but over time we did more and she did less until she was only expected to take out the trash and doesn't do that anymore.\n\nJust one example, I spent a couple hours cleaning the garage but next day she started leaving trash and putting stuff and I asked her to clean it and she just gave me a lot of attitude and never cleaned it.\n\nShe also barely spends time at home, I'll be lucky to see her for 30 minutes once a week. Even on my dad's birthday she only came over for 30 minutes and on mother's Day even less time. Spending time with her boyfriend at his house instead.\n\nBut then she says she feels guilty like she is ruining her relationship with her family and cries about it, but we are always there if she needs it. It makes me sad and I miss her.\n\n\nAlso I apologize if this doesn't sound coherent I'm up late and barely awake.",
        "comments": [
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            }
        ]
    },
    {
        "title": "don't feel close to anyone in my immediate family mainly due to politics",
        "post-author": "Gbpxl",
        "text": "My wife is a different race and this our daughter is biracial. She was born about a year ago. My sibling told me (years ago) that they view biracial people the same way they view retarded people. they have spent most (all) of their adult life thinking about race, studying it, talking about race, etc. it's a non-starter for me. Regardless of the tons of other douchey things they say, this one was a bridge too far for me. I just don't enjoy their company.\n\nMy other sibling has said that vegans are retarded, this was about a year before I went vegan (I am no longer vegan, as of right now.) but it still showed where their mind was.\n\nmy parents are super conservative which is fine but I don't have anything to go on about with them. my dad doesn't believe in climate change and dabbles in conspiracy theories. my mom has a \"Team Trump\" purse.\n\nmy aunt referred to her son in law as a \"freak\" after he came out of the closet.\n\nI'm not sure where I'm going with all of this but maybe I am just wondering if anyone else lives a similar life that i do where the people who are supposed to be closest to you are simultaneously the most uneducated, racist, and douchey people you know.",
        "comments": [
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            }
        ]
    },
    {
        "title": "Is it normal for your family to never visit you while in college?",
        "post-author": "Williym",
        "text": "I’m a 3rd year undergrad student, and I’ve always noticed that everyone’s family comes and visits them—whether for moving in/out, parents weekend, or even just in general?\n\nI’m going into my senior year and my family has never—not even once—visited my campus. My mother is 3 and a half hours away by car, and my father/older sister are about a 3 hour PLANE ride away. \n\nI’ve always had to move in and out of my dorm by myself, including packing my own stuff. I know I’m an adult, but I’ve always seen ALL of my roommates have their families come in multiple times a year or even a semester.\n\nMy family is not rich by any means, we don’t come from a lot of money; I’m a first generation, low-income student. But, my family hasn’t even attempted or tried to look into the area. I know they can afford plane tickets and hotels… I just, don’t get it?\n\nDoes anyone else experience this? It’s honestly embarrassing when my friends ask about my family, or when they’re coming in to help move (they never have).\n\nIf it’s not ‘normal’ then, how do yall deal with it? It’s honestly starting to affect me. I wish they’d try.\n",
        "comments": [
            {
                "body": "Have you asked them to visit you? Maybe they think you don't want them there?  Also, do they travel - my father never goes anywhere.  I'm sure he'd theoretically love to  see his only grand child in college, but it's simply a bridge too far for him to drive or fly or get there in any way.  \n\nGood for you being so independent, and for being a first generation college student!  You will see, as you go through life, things thatyou didn't question or maybe found easy, are insurmountable for many, many people. It just is.",
                "comment-author": "sfomonkey",
                "replies": [
                    {
                        "body": "I have asked all of them atleast a few times throughout the years. Sometimes my mom travels back to visit the rest of my family with me—my sister travels on occasion, too.\n\nMy dad almost never travels but he does once in a blue moon for family.\n\nThe independence is nice, but, sometimes it’s too much ‘independence’ for one person, if you know what I mean lol",
                        "comment-author": "Williym",
                        "replies": [
                            {
                                "body": "I do know what you mean. I've been fiercely independent my whole life, and now in my 50s, I find I've made myself sick from overwork and worry, which were caused by needing to be independent and not failing while on my own. \n\nIt's a lot to be proud of, but can be a double edged sword. \n\nMay I suggest that as you enter your senior year, you should know when graduation is.  Tell your important ppl when it exactly is, and offer to help plan travel and accommodations, perhaps increasing the chances your VIPs will be there.",
                                "comment-author": "sfomonkey",
                                "replies": [
                                    {
                                        "body": "Will do, thank you dear <3",
                                        "comment-author": "Williym",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "Yes i asked my parents never to come here because its not good for their convenience . Im happy with that decision",
                "comment-author": "Obvious_Debate_2425",
                "replies": [
                    {
                        "body": "Yay :) I’m happy for you. Do they respect your boundaries?",
                        "comment-author": "Williym",
                        "replies": [
                            {
                                "body": "Yes and its mainly my place has alot of walking and their used to cars",
                                "comment-author": "Obvious_Debate_2425",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "It’s not normal. It’s painful. This happened to me. It made no sense. My parents could afford it to and chose not to visit. Money wasn’t the issue. I didn’t feel unloved necessarily but I wondered….\nThere were always good reasons (I don’t like the city, I don’t like to fly, I’m busy, we have other children) the list goes on. Then I stayed in that city for 14 more years and in that 18 years of time my dad visited 4 times and my mother visited twice. \nYou could try to dig deep into the issue and figure out why your parents won’t come see you, but you may not like the answer. I suggest you build a life and if you ever become a parent yourself, visit your kids in college.",
                "comment-author": "Lost-Bake-7344",
                "replies": [
                    {
                        "body": "I’m sorry it happened to you, too. It’s a very unique kind of pain, one that’s dull but can feel spiked on those special days.\n\nSometimes I ask them why they don’t and it can be due to personal responsibilities, or even financial aspects.\n\nHowever, I know that those responsibilities are things that can be shifted, and if they really cared—the money would be saved.\n\nI think it’s because they don’t care /enough/. I know they care, I think?\n\nMaybe they don’t care enough? Idk.",
                        "comment-author": "Williym",
                        "replies": []
                    }
                ]
            },
            {
                "body": "If your family is low income, they can't afford plane tix and hotels!  Low income is like 50K/yr.  Plane tix and hotels would cost at least a couple of thousand.  How could they afford that? \n\nAlso, some families think that college students want privacy, don't want to be bothered by family showing up.  They'll come for graduation.  \n\nIf you want your mother to come visit, invite her.  Don't invite your father - if they're really low income, they cannot afford it.  Of course, if they can afford it, then they're low income only on paper.",
                "comment-author": "snowplowmom",
                "replies": []
            }
        ]
    },
    {
        "title": "My family members are idiotic",
        "post-author": "Fun-Try7241",
        "text": "Every single one of them has caused pain and repeated ones. It’s incredible the amount of abuse I’ve put up with. I basically keep to myself and don’t really interact with them unless I need to. And unfortunately I’ve needed to. ",
        "comments": [
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            }
        ]
    },
    {
        "title": "Had my mom fill out one of those books that asks a bunch of questions",
        "post-author": "oooopsiforgot",
        "text": "TL;DR my mom filled out one of those books with questions about her childhood and life and all that and I read it just now and it was heartwarming and sad too\n\nFor Christmas I got one of those books advertised all over social media for a parent to fill out and answer a ton of questions. She gave it back to me on Mother’s Day today and I read through it and UGHHHHH I wish I could hug her younger self.\n\nMy mom is really unique - very shy, no friends except my dad and me, didn’t go to college and worked at the same place for 34 years - I don’t want to call her boring but can’t think of a better word. She’s happy as she is but sometimes tells me she feels depressed and lonely because my dad let her retire and she has nothing to do all day. Shes very dependent on my dad and when it’s just she and I, I feel a need to look after her like a child (from a place of care and love). \n\nAnyways, I just read the book. She left a lot blank because I don’t think she feels like she has a lot of “worthy” things to add. But what she did fill out was so bittersweet to read. So much about being a mom and loving my dad, and I hate she thinks that’s all she is. She answered a lot about her childhood and that was really nice to read as well. It gave me a different perspective of who she is and why she is that way. \n\nIt was a really good reminder that she was a kid and then a young adult before she was a mom and she experienced so much before I existed. \n\nI do recommend getting these if you want a nice keepsake and something to reflect on every so often. My dad will be giving me his on Father’s Day and expect a much different product lol (in a good way - he’s just different than my mom). I got the books on TT shop but I see them everywhere and they’re pretty inexpensive. ",
        "comments": [
            {
                "body": "I did this about 20 years ago for both my grandparents.\nWhen they passed neither of them filled in more then a couple pages. \nI now wonder why and feel let down .Maybe I should have been more proactively involved and talked to them about it.",
                "comment-author": "shellyprincess45",
                "replies": [
                    {
                        "body": "I really think my mom has this idea that she has nothing of value to say. The way a lot of the responses read is as if she was unhappy with her answers. I told her how much it meant to me that she tried and that I’m forcing her to do it again next year lol. I’m sorry you had a similar experience but don’t beat yourself up over it. I think it can be hard for older generations to see the value of something like this and they don’t really understand how much it means or they think we don’t care as much as we do.",
                        "comment-author": "oooopsiforgot",
                        "replies": [
                            {
                                "body": "My husband was given one of these for a holiday by his daughter. She usually acts like he is a necessary nuisance in his life, though. He will probably never fill it out. \"If she wanted to sit with me and write it down, I'd do that, but she has no time for me so I don't know why she would want this\" is the gist of what he said.",
                                "comment-author": "MsTerious1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Welcome to r/family! \nIf this post is compliant with our guidelines,\nupvote this comment. If not,\ndownvote this comment. Also, if you haven't already, remember to join our [discord server](https://discord.gg/VwDNbde)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/family) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "What is this book? I’ve never heard of it. Please can you link or suggest where to buy? \n\nI wish I’d done this with my grandfather. He had so many stories to tell but because I was still young I didn’t write many of them down and now I’ve forgotten most of them. He accomplished so much in his life and travelled to many countries when travelling wasn’t that common. He set up many charitable projects in different countries and helped so many friends and family and we have very little record of what he did. \n\nI’d love to be able to do this with my own parents now. They haven’t lived as diverse and exciting life as my grandfather but they still have memories and personal experiences that I’d love to preserve.",
                "comment-author": "soupywarrior",
                "replies": []
            }
        ]
    }
]