[
    {
        "title": "My friends had a blowout.. on my birthday",
        "post-author": "ViolinistNo6198",
        "text": "This is my first reddit post so i don’t know what I’m doing but i need advice please So for context I’m in my first year of uni, i have 2 friends, lets call them Sarah and lucy\n\nSarah and I are incredibly close, we of course have small arguments but she is fiercely loyal and she is my best friend. She took a year out of uni to work so shes definitely distanced herself from some of our friends but our friendship remained strong and never one sided but her and lucy have distanced alot, sarah says that lucys actions have been immature recently and theyre just at different life stages which is a fair assessment\n\nLucy and i have known eachother since we were really small but only became close the same time i became friends with sarah (4 years ago). Lucy has a friend who unbeknownst to lucy bullied me when i was 12. I never told her as it was a long time ago and awkward to bring up. Sarah knows and we both dislike the friend(call her mary). Mary has gotten incredibly close to lucy since we began uni and lucy has changed alot (why sarah feels she way more immature).\n\nBasically theyve both distanced, which is fine but i kept up my friendship with lucy. More context sarah has a boyfriend of 5 years and theyre stable and happy Lucy recently got a boyfriend who we somewhat know in our friendgroup, this is her first boyfriend since her breakup with her first love(another massive change to lucys personality)\n\nNow sarah is open in saying that she doesnt see her and lucy being friends anymore. Lucy seems to think that sarah is distancing herself and not trying with any of their old friends This alone is enough of a mindfuck for me They were both respectful that i still hung out with both and never made me feel forced to pick or side, that’s until…\n\nCut to my birthday, i wanted to go out with some friends and my boyfriend. Me, Sarah, her boyfriend and my boyfriend met up first and it was so much fun. Then lucy and her new boyfriend and some other friends came. We went bar hopping and ended up in this spot, Sarah was being incredibly civil to lucy which i appreciated. But i went to the bathroom and when i came back the air was AWKWARD. Apparently Sarah and her boyfriend were making nsfw jokes(nothing out of the ordinary for them at all and nothing wildly inappropriate ) and lucy straight up went ‘ew thats so gross’ which took everyone aback, then sarahs boyfriend said something unrelated, trying to move the conversation and lucy commented‘thats so gay’, this is really unlike lucy (and to me it sounded like she was trying to act cool in-front of her boyfriend or something dumb) Sarah got very upset and angry quietly. Lucy soon left with her bf and so did others because it became so fucking awkward bc lucys comments.\n\nThe initial 4 of us went somewhere else where sarah basically pulled me aside and said thats not what a friend does on YOUR birthday and gave this speech of how lucy isnt showing up for me. Still it was my birthday and i didnt need to hear it and i got very upset I spoke to sarah the next day and she apologised for saying that and i did say it was disappointing what went down and i probably didnt need to hear it at that moment. she said she was sorry and it was just the rage in the moment for me and her bf.\n\nLucy never said anything.\n\nSarah can be hot headed and can occasionally overreact, but my bf who was there, and is the most unbiased person ever , even said how out of the blue and wierd lucys behaviour was, it was completely unprovoked.\n\nSarah is a real one, lucys contact has been so so recently and it making me realise that i need to talk to her about it. The fact there was no apology and the same effort to be civil wasnt made by lucy\n\nBut i dont want to throw away a friendship and lucy feels avoidant about it Help me idk whats happening (Also i can understand that your time is taken up by a new spouse so i have grace for it) I just feel like my friendship to her doesnt matter as much as it matters to me, shes made alot of new friends and im definitely pushed down the priority list\n\nThis is a horribly uncomfortable situation, i need advice on how to deal (btw this is a month later)",
        "comments": [
            {
                "body": "Basically, Lucy is an AH. Do you want to continue being friends with an AH?",
                "comment-author": "Puzzleheaded-Low5896",
                "replies": []
            },
            {
                "body": "You're all still young so this is par for the course I suppose.\n\nWhy would Lucy apologise if she doesn't feel she did anything wrong? You'd have to talk to her about that.\n\nIf you don't keep a friendship up, then it fades. Did you even try to talk to Lucy? If you didn't then the friendship is dead already.\n\nSo, go talk. You know that already, why haven't you done it?",
                "comment-author": "silent_cat",
                "replies": []
            }
        ]
    },
    {
        "title": "My friend keeps lying to me regarding an affair she's having. Should I give her a pass or is she not a good friend?",
        "post-author": "VolatilityVixen",
        "text": "She (30F) is having an affair on her fiancé that she lives with. The other guy is a known player and doesn't have much going for him other than looks. She knows my distaste for him and that i dont agree with what she's doing. \n\nShe continues to swear up and down that she's not seeing him anymore but i continue to catch her in lie after lie, indicating that she is still cheating. \n\nBecause she may feel embarrassed or ashamed of her actions, i understand why she may be dishonest. But still, should I give her a pass or should I dump her as a friend? \n\n",
        "comments": [
            {
                "body": "Do not associate yourself with this person as you are the sum of the people you spend your time with",
                "comment-author": "unrealaz",
                "replies": []
            },
            {
                "body": "Is this a real question?\n\nETA anyone with more than 1 brain cell knows you won’t dump them as a friend if you’re even asking this question. Your friend is trash and so are you",
                "comment-author": "Old_tshirt72",
                "replies": []
            },
            {
                "body": "I would say, you can’t or shouldn’t control her life decisions. \nIf you don’t like her behavior, then she’s not suitable for being your friend. Cut ties and move on. \nIt’s her life and her decision. \nPS: I don’t support affairs but you really can’t do anything!",
                "comment-author": "Icongau",
                "replies": []
            }
        ]
    },
    {
        "title": "2 Months Friendship/Talking Curse",
        "post-author": "idontknowwhatoname11",
        "text": "Is two months of getting to know each other and being friends a curse or something? Like after two months, the other lose interest and fades away...or ghosts. Does it happen to others too? Or just me? ",
        "comments": []
    },
    {
        "title": "Am I being unkind?",
        "post-author": "Far_Supermarket_844",
        "text": "Me and my best friend of 12 years are incredibly close and she's starting to consider dating this guy and taking it slow. I'm anxious seeing it develop because I'm scared he'll change everything about my friendship. What if she goes to him for advice now instead of me? We've always been each other's no.1, what do I do now? She's adamant it won't change things and we do talk about it, but I don't think she can avoid that completely. I personally don't know what she sees in him and I find myself selfishly just wishing he'd go away. Then again, it was going to happen to one of us eventually, I think I just assumed it'd happen at the same time rather than me watching it happen to her. Part of it is also jealously as I recieve no male attention and she does. My main question is, when she tells me sweet things he does, I really am happy for her. But I can't make it show on my face, and I know I could be more supportive. I just hate him so much. I'm not being a good friend and I wish I could be more accepting and find everything cute, but instead it makes me cringe and want to puke. I can tell she doesnt talk as much about it as she knows my thoughts. Am I awful? I don't want to hear anything about him or anything they do, the more I distance myself the more I hope me and her can just stay the same. I want her to be happy, but I'm honestly so upset about it as it feels like a betrayal even though it's not of course. ",
        "comments": []
    },
    {
        "title": "Need advice.!",
        "post-author": "Proof-Squirrel-8718",
        "text": "It’s going to be a long one, but please hear me out. I am 31F. I have had this friend since we were 9-10 years old. I used to call her my best friend.  She would fight over small things and give me silent treatment for days until I begged her to talk to me. I would be on eggshells around her. We had two other friends, one day they decided not be friends with me anymore and stopped inviting me. I moved on. This friend returned to my life after 3- 4 years, I had put everything in the past and welcomed her with open arms. We started hanging out more and were quick to get back closer until a few years ago when I realised it’s the same cycle again instead of silent treatment it is now endless flow of messages about how I am a bad friend. I slowly distanced myself but kept being her friend saying things she wanted to hear and avoiding conflicts to save the drama. Again eggshells. I would be so anxious the day we were to meet. I would simply sit nodding to what she says. It had clearly become one sided. She would keep talking about how her personal life is a mess, how professionally everyone is conspiring politics against her. I thought she was in a really bad phase and wanted to be there for her. It’s been more than 4 years she is still stuck in the same cycle. I don’t know the people she talks about, I just know her narrative but it started to feel like she puts herself in the victim category all the time. When I put a boundary she keeps saying I have no idea how hard her life is and so on. I moved countries and had to meet her less often and things got better. I got married, had less time for her and things got even better.\n\nUntil last year when she was visiting Europe actually for a wedding and asked me to meet her somewhere and gave me a few dates. I told her I cannot on those dates due to a pre-booked vacation. She got mad saying things like she is travelling across continents and I am not meeting her. I told her that if she was planning a trip especially to meet me she would have informed me well in advance so that I can make necessary bookings. Anyhow things were then back to normal. She talking, me listening. \n\nUntil again this year. She told me in January she would like to visit us here. I said that would be lovely and gave her a few dates in June which were possible for us. She told us in February she cannot make it and that we should go ahead with our plans. We still waited another month before making plans. Mid April she again asked me if it’s still possible and is it too late. I said it’s late and we have plans with other friends but if she wants she can join us. The plan was decided.. 4 days in this country, 3 days at our home and then she visits another friend. I approved this plan. Then she started saying things like how she will be uncomfortable on the trip because the others are all couples and she wishes it would be just us (me and my husband) and her and all of that. She mentioned this 2-3 times so we decided to ask our friends to drop out or for us to look for another accommodation with her because she also did not want to stay alone. They agreed and canceled being on the trip. One of them was apprehensive with his health anyway, others dropped out too. So that is still okay but my Husband was upset because they are his best friends. Mine too, the family we have here actually. Then two days later after she confirmed her plans, she went to book everything. I was at work, she was messaging me about things. I told her I am at work and that I will get back at her in the evening. But she had already booked by the time I was home. After checking I got to know she has extended her stay at our place for two more days making it entire work-week. Sunday - Friday. I had approved a date, plus/minus 1 day. But that got me really mad. I still did not say anything and only after she asked me what is wrong I told her my problems. Which were: \n1. I share a home with my husband and that I need to be sure that he is okay with it even if it’s 1/2 days.\n2. He also works from home and I work from office, so he will have to take the responsibility of hosting more than me while it is my friend who is visiting not his. \n3. We do not have an extra room, our living room is his office and our guest room. \n4. I have anxiety issues with sudden changes in plans especially when I need to cater more. I need some time to grasp and cool myself down. \nShe started a big fight emotionally blackmailing me that she is coming here to meet me, prioritising me and it’s just one extra day and what is the big deal. But the entire time in her conversation she has mentioned multiple times how she doesn’t want to travel alone, how she is on a string budget, how she is here to have fun and we can go around doing our stuff and she won’t bother us. It kind of feels like she wanted to free load a Europe trip and we were just a convenience. But what about us? I just expected her to ask me instead of assuming and taking things for granted. It is not easy to host someone on a work week 5 days in a row. She called me a jerk for asking her to travel all the way to Europe and doing this to her. (I did not ask her to travel but she is making it look like I asked her to travel because she did not meet me last year). She wanted a vacation I was just a free accommodation. She kept on going about how she hates travelling alone, she is scared to travel and live alone and I am asking her to travel 4-5 hours alone, that I should have some empathy about her situation and her problems, basically the same victim mode again. I am literally sick.. physically sick puking with anxiety about this situation. I don’t want to host her now but I cannot say no of course. And I have mentioned about my anxiety, with change of plans in the past and about being in therapy for it. If she actually would have listened or had empathy to understand she would have not done what she did by adding “just 1 day” in her language.\n\nHow do I cut this friend? It’s been killing me inside. Her remarks make me doubt myself and I need some validation. Is it actually my fault?",
        "comments": []
    },
    {
        "title": "Am i allowed to be upset that my friends cancelled and don't want to go out to eat with me on my birthday?",
        "post-author": "noclue_insertname",
        "text": "This is my first post on reddit, so please bare with me.\n\nI (25)  turn 26 in a few weeks. It happens to fall on a big cosplay convention in my country (Dokomi ) and all of my friends will be there as well. I was very excited and  happy I get to spend the day with my close friends. When they found out that it's my birthday on one of these days they said they would like to celebrate and what I would want to do. I said they because it's a con  celebrating there would be uncomfortable and suggested going out to eat in the evening so we can spend some quality time together. That was almost  a year ago. \n\nFast forward a few months and I asked if any of my friends had an idea on where to eat, when one of the friends said they're already eating sushi with their boyfriend on that day but that i am welcome to join them. The others said they would still like to go out to eat with me and that they would talk to the people they room with that they're busy that day or ask if it's okay if they join me to go out to eat with me that day.\n\nA few days later ( aka today) I wake up to texts from one of my friend telling me that they decided to invite another friend of theirs to eat on Thursday before the 3 day event with the same friend that is eating sushi on my birthday and that since we already plan on getting ramen on Friday together that they won't be going out to eat on Sunday with me for money reasons.\n\nA bit sad about that I asked the other friends if they're still up to go out and eat with me but they said that they're going out with other friends. \n\nWhich leaves me alone.\n Idk if I am in the right to be upset about them not going out to eat with me on my birthday because for other people its just a normal day and I don't want to make a scene and say hey but it's my birthday and we agreed to go out to eat together to celebrate. We will be hopefully seeing each other during the day but with a visitor count of 350.000 people per day it's not easy to meet up during the con. So I guess I was just happy that there was effort to spend my birthday together somehow.\n\nEspecially since the last 3 birthdays have been absolutely shitty with people blaming me for leaving them and making new friends and insulting me, standing me up on my birthday and so on. (Don't worry I'm not friends with those people anymore) \n\nI know that it's okay to be sad about it and I want to say something to them and ask if they forgot about the plans (even though we talked about it a lot) and if they would still be willing to go out with me on Sunday and cancel their plans/ lay them on another day ?  I'm not even sure if i should make such a big deal out of this, just suck it up and say nothing or talk to them about it? \n\nSo I don't really know how to go about this. So any advice would be really really helpful!! \n\nIf it comes to it I guess I will be going out to eat alone.\n\nSorry if the grammar is off, I was tearing up a bit while writing 🫶 ",
        "comments": [
            {
                "body": "I can understand being upset, especially I'd they choose other friends over you like that.  A friend wouldve at least made it up to you some kinda way so have every right to feel upset and sad about it.  Dont let it harsh your vibes for the whole day tho!  Treat yourself on your birthday, do what you want even if by yourself!  Yea, may just be another day to others but it's a special day for you and deserves to be celebrated how ever you like!",
                "comment-author": "BlackwargreymonXOXO",
                "replies": [
                    {
                        "body": "Yeah I will definitely try and not let it ruin my day! I guess it all falls back onto priorities and such. I will maybe ask around if someone else wants to eat together and if not I will treat myself to something nice! \n\nThanks for the kind words 💚",
                        "comment-author": "noclue_insertname",
                        "replies": []
                    }
                ]
            },
            {
                "body": "So the con falling on the same day is unfortunate.\n\nJust celebrate it on a different day that works for everyone.\n\nI never celebrate my birthday with friends on the day itself because it's often a workday and everyone has stuff on. I sometimes do multiple parties just so I get to see everyone.\n\nI dunno, maybe it's because I've had too many birthdays, but I'd rather have a party that people turn up to than expect it to be on a particular day.",
                "comment-author": "silent_cat",
                "replies": []
            }
        ]
    },
    {
        "title": "I can’t get out of bed, I’m grieving a friend who isn’t that person anymore",
        "post-author": "beksnxb",
        "text": "I lost my bestfriend one month ago (not death she just left) . To start, she had been in and out of a toxic relationship. She finally came back, told me she missed me and loved me so so much. She told me how she thought of me the entire time she would go hang out with her bf, how she felt horrible for leaving me, even told me I was her wings. She told me she would never go back to the guy. Then, a week later kinda stopped replying to me, I was like wtf and then she ended our friendship. Went BACK to the guy but she claims her ending her friendship had nothing to do with that. She just said I’m too controlling (mind you I told her never to go back because he was cheating on her the entire time) and I asked her why and she said it’s different blah blah blah. I kinda went off and I’m blocked now. I’m HEARTBROKEN. I can’t get out of bed. This was my bsf and she’s gone, I lost her, idk what to do. There is so much more to the story but that’s the main part. She rly is hard on claiming it’s not because she went back, I think it’s bullshit, I think she just didn’t want me to know. I ended up apologizing and telling her how horrible I’m doing. (Ik stupid but) I just can’t. I’m in so much pain. I genuinely can’t do anything. I can’t eat I can’t sleep. I used to see her 24/7 she was my light my everything. She’s completely gone, I’m grieving a person who isn’t there anymore. ",
        "comments": [
            {
                "body": "hey, u did your best and not to give u false hope, but she may come back once she truly sees her shitty ex/bf for who he is. he may have told her to cut contact with u, if he knows through her that u do not support the toxic relationship. \n\ni’d talk to friends and family for support as much as possible and maybe even contact her friends to see what’s up, if u have mutuals and if that doesn’t seem too out of line. talk to chat gpt about difficult scenarios where u can’t talk to anyone (it genuinely helps) and take care of yourself as much as possible. \n\nprotein shakes, soup, and your fav foods are good to help get something down. as for sleep, exercise, hot showers, a warm non-caffeinated drink, comfort shows/vids, a book, and pets are good ways to wind down.",
                "comment-author": "FancyPomelo9911",
                "replies": []
            }
        ]
    },
    {
        "title": "Need help making friends",
        "post-author": "Help_Neede",
        "text": "Hi I’m 22 and have unfortunately found myself with no friends over the past couple of years I really need help making new ones. Does anyone have any advice of suggestions on good ways to make friends when you don’t have any direct access to making them.",
        "comments": []
    },
    {
        "title": "How long does it take to form deep friendships & sense of community in new place?",
        "post-author": "Strange_Coconut3641",
        "text": "I moved to a new city about two years ago. I enjoy the change of scene and have friends—but no good friends and overall just feel like I’m lacking a sense of community and belonging despite making an effort. I don’t know if I should try more / different groups or if it’s not the right place for me. What has your experience been? ",
        "comments": [
            {
                "body": "2 years sounds long  \nbut for deep friendships—it’s barely halfway through the trust curve\n\nreal bonds need:\n\n* **shared history** (which takes time)\n* **consistency** (same ppl, same spaces)\n* **vulnerability** (most ppl never go there)\n\nyou might not need *new* groups  \nyou might need to go deeper with the ones you’ve already found  \nand show up more *as yourself*, not just as a polite guest\n\nbut also—sometimes the city’s just not it  \nif you’ve tried, opened up, followed through, and still feel invisible... that’s data\n\nThe [NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) drops blunt strategies on building real connection, not just surface-level socializing  \nworth a scroll if you’re done feeling like a ghost in your own life",
                "comment-author": "Thin_Rip8995",
                "replies": [
                    {
                        "body": "Interestingly, the \"shared history\" doesn't have to be now. Shared experiences in the past can also work: similar bad experiences growing up for example. But that's only the opening, you still need to get through the other two...",
                        "comment-author": "silent_cat",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Be proud of yourself for being open. I think it does take a long time to build close friendships and community. And it’s certainly not easy.\n\nI would encourage you to try more groups. \n\nI know for myself I tend to have a wall. And stay in my own corner. And it feels like it takes me a lifetime to make one good friend. But I keep trying.",
                "comment-author": "Reader288",
                "replies": []
            }
        ]
    }
]