[
    {
        "title": "My Husband (38m) Didn't Get Me (33f) Anything for Mother's Day and He's Upset",
        "post-author": "BabyCakes324",
        "text": "My husband (38m) and I (33f) have been married a little over a year now. I have 2 kids from prior relationships and we have been talking about having a child together, but I don't feel right now we should because we have a lot to work on in our marriage. I his mind the baby will save everything. Been there, done that... It doesn't....\n\n\n\nA little backstory: we moved during my birthday month (January) and with that move we said we were going to postpone Christmas and celebrate it in February. So I didn't get anything for Christmas (I still got him something) or my birthday. February comes around and we didn't celebrate Christmas and I didn't get anything for Valentine's day, but I got him something. Our anniversary was in March and I went all out because it was our first and he didn't get me anything. His excuse was \"I didn't have any money\"! Mind you, he is the bread winner. I handle the finances, but if he says I need money I give it to him. \n\n\n\nNow fast forward to mother's day... I've been telling him how much it bothers me that especially for our anniversary he didn't get me anything and I went all out for him! I felt unloved, unwanted, and underappreciated (especially after finding other women in his phone not once but twice and have been working on forgiving him). He said nothing. Hasn't apologized or acknowledged my feelings.\n\n\n\nMy family invited us out to eat for mother's day, but he didn't want to go. Just wanted to stay in the house, as usual, and be on his phone and watch TV! I decide to go! Had a great time with my family, but also was down because he wasn't there. We didn't talk or text the entire day!!! Finally text me saying he needs gas for work..... Get home and still no words between us. I'm guessing he thought I was going to bring him something home to eat, but I told him we were going to a buffet! As he gets ready for work, he's slamming doors, throwing stuff, and cursing. Then left the house without his ring on! I know I'm not in the wrong and I'm not going to tell myself or let myself feel like I'm in the wrong, but wanted validation from others! Sorry for the long post! Just really needed to vent!\n\n\ntl;dr: My husband didn't get me anything for mother's day and he's upset! ",
        "comments": [
            {
                "body": "It’s the thought that counts, but he didn’t even think. \n\nAlso, he’s probably cheating on you. Just going to be blunt here - you’re in the process of forgiving him for, I’m guessing talking to other women? And he makes no effort for you? Please stand up for yourself. \n\nHappy Mother’s Day! Please choose happiness.",
                "comment-author": "bonfigs93",
                "replies": [
                    {
                        "body": "My thoughts exactly! I prefer handmade gifts but some form of a gift. \n\n\nI did he was cheating on me, emotionally. At the beginning of our marriage he encouraged me to gain some weight because he likes \"thicker\" women. He cooked constantly and my weight began to increase but then the intimacy slowed down. That's when I found the plethora of women in his phone while I was feeling low. Decided to start working out and get back into shape and rebuild my self esteem/ confidence and he doesn't like it because now I want to go out more like we use to. \n\n\nThank you!!! Happiness all the way!",
                        "comment-author": "BabyCakes324",
                        "replies": [
                            {
                                "body": "He doesn’t like thicker women.  He just didn’t want others to covet you.  He wants your self-esteem lower and you being needy and can only get attention from him.\n\nIt won’t get better, I’m sorry.  He’s not going to suddenly realize how much he loves gift giving and be amazing.  He wanted you.  He got you.  He’s done trying.",
                                "comment-author": "AnyDecision470",
                                "replies": [
                                    {
                                        "body": "I need to listen to myself more because I was feeling this way at the time I gained all that weight. I would turn to him for the love and affection I needed and wanted and he would be so cold 😥.I decided to try to lose the weight to become more attractive to myself and my husband but I know I need to just do it for me. *Sigh* because he obviously doesn't want me for me and like a lot of the comments said, he doesn't like me. 😕",
                                        "comment-author": "BabyCakes324",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Why are you upset about mother’s day and not the plethora of women on his phone? Are you ok?",
                "comment-author": "MaiBoo18",
                "replies": [
                    {
                        "body": "I'm still upset and trying to heal from that, but that was months ago, while mother's day was just yesterday.",
                        "comment-author": "BabyCakes324",
                        "replies": [
                            {
                                "body": "I don’t think you’re upset enough! This man is showing you by his actions he doesn’t care for you, not deeply. He wants to control you . I’d seriously be reconsidering this relationship, don’t waste more time with him.",
                                "comment-author": "Ok_Leadership789",
                                "replies": [
                                    {
                                        "body": ">he doesn’t care for you, ~~not deeply~~ at all.\n\nThere, fixed it for you. \n\nOP, he doesn't care. My wife doesn't buy me much in the way of presents (without my input or sending her my wishlist) because she doesn't know what to get me, but she'll always get me a card and one of the many things on my wish list and will try and make the day special. \n\nSorry to be blunt OP, but your husband doesn't care about you at all. I would be looking for a divorce lawyer as this won't get better.\n\nEdited to clarify point.",
                                        "comment-author": "gooderj",
                                        "replies": [
                                            {
                                                "body": "*sigh* \n\n🫤 I appreciate the bluntness",
                                                "comment-author": "BabyCakes324",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "body": "Yeah, it sounds more like rug sweeping than healing; OP is fixating on the gifts to avoid the real reason her husband's attention is elsewhere. \n\nShe needs to allow herself to feel her anger and tell him she won't stand for infidelity or being treated like an ATM.",
                                        "comment-author": "Irn_brunette",
                                        "replies": [
                                            {
                                                "body": "I'm not fixating on gifts. I've read plenty of post about women who are in a similar boat with spouse or bf not showing love through gifts. How should the healing sound? I wouldn't say I've swept it under the rug. I've voiced my anger! I've shed tears! I've done what I could on my end and tell my husband how I felt. I have to give time to see the changes take place to be fair. If we were just dating yea sure, you gotta go, but we are married.... I can't just give up as easily because I said I do. If things don't change, then yes, a future together wouldn't be healthy for me and I need to take the signs and walk away.",
                                                "comment-author": "BabyCakes324",
                                                "replies": [
                                                    {
                                                        "body": "Honest question but what’s your limit? How long can he keep fucking around before the“he better change soon” free pass expires? How many chances does he get? How soon after he betrays you will you forgive him again and repeat the cycle?",
                                                        "comment-author": "thegoldinthemountain",
                                                        "replies": [
                                                            {
                                                                "body": "That is a good question... Honestly, Im still holding out hope (even though a part of me knows not to), but if it were to happen again I wouldn't be able to take the betrayal and neglect anymore. The trust has been broken and I've been trying to forgive, not just for him but for myself, to move on but it's hard when situations like this happen. There aren't any more big holidays or commercial reasons to get me anything and he's not going to get me a \"just because\" gift. Won't know what will happen until Christmas comes around again to see if there is some thought of me there.",
                                                                "comment-author": "BabyCakes324",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": ">that was months ago \n\n>we just celebrated our first anniversary \n\nGirl. Fucking yikes. You can love yourself more than this. He offers no warmth, no gifts or consideration, and no apologies. He disrespects you and your marriage by cheating, then turns it around on *you* as if it’s your fault that he sucks so bad. \n\nThis man is not the one. Throw him back.",
                                "comment-author": "thegoldinthemountain",
                                "replies": [
                                    {
                                        "body": "I have been trying to love myself more. Do more for me and things that make me happy. Trying to turn a negative situation into a positive one, but at the end of the day, I know I need to learn to love myself more! *Sigh* 😮‍💨",
                                        "comment-author": "BabyCakes324",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Your marriage is a disaster..not sure you fully comprehend this.",
                "comment-author": "Global-Fact7752",
                "replies": [
                    {
                        "body": "All marriages have there problems and mine is no different!",
                        "comment-author": "BabyCakes324",
                        "replies": [
                            {
                                "body": "UpdateMe! 1 year",
                                "comment-author": "perthguy999",
                                "replies": [
                                    {
                                        "body": "I will message you next time u/BabyCakes324 posts in r/marriageadvice.\n\n[Click this link](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Update&message=UpdateMe%21%20u%2FBabyCakes324%20r%2Fmarriageadvice) to join 4 others and be messaged. The parent author can [delete this post](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Delete&message=delete%201kkkdp9)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/UpdateMeBot/comments/ggotgx/updatemebot_info_v20/)|[^(Request Update)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Update&message=SubscribeMe%21%20u%2Fusername%20r%2Fsubreddit)|[^(Your Updates)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=List%20Of%20Updates&message=MyUpdates)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=UpdateMeBot%20Feedback)|\n|-|-|-|-|",
                                        "comment-author": "UpdateMeBot",
                                        "replies": []
                                    },
                                    {
                                        "body": "UpdateMe! 1 year",
                                        "comment-author": "River_star",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "Yep I was right...denial.",
                                "comment-author": "Global-Fact7752",
                                "replies": []
                            },
                            {
                                "body": "You’re kidding right? Are you in denial or something? Marriage is not supposed to be anything like that at all. \n\nHow would you feel if one of your kids had a spouse that cheats on them and treats them like dirt and doesn’t even think about them, ever? This is what you’re currently showing them is a-ok behavior in a marriage. ",
                                "comment-author": "Complete-Design5395",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Why are you with this man? What does he actually do to make your life better?",
                "comment-author": "Low_Ice_4657",
                "replies": [
                    {
                        "body": "He wasn't like this when we were dating. He was sweet, nuturing, caring, attentive, funny, just short tempered, but since we've gotten married everything has changed. At the time we got married, we had a lot going on which started to put stress on us but I always tried to uplift us and look on the bright side. Idk. I feel like now because we have gotten married he feels that he needs to stop \"dating\" me.",
                        "comment-author": "BabyCakes324",
                        "replies": [
                            {
                                "body": "This man is trying to get you dependent on him. Je wants to get you pregnant so you have no option but to stay with him. He could not be telling you any more plainly (through his actions) that he only cares about things that are important to him, and if you stay with him, you are an accessory to your own mistreatment. Narcissistic people are great at manipulation—which is why he was so charming to start with—but when they have you in a subordinate position where they want you, you then become their lowest priority. Where did you get the idea that that is what you deserve?",
                                "comment-author": "Low_Ice_4657",
                                "replies": [
                                    {
                                        "body": "*Sigh*.... A part of me was feeling like he was just trying to trap me, but tried to convince myself that's not it. That maybe he's just misunderstood... Trying to gain understanding as to why he treats me like this. Which causes me to look down on myself like I'm doing something wrong and I know I'm not. His words don't match his actions all of time. 😔 I deserve better I know I do, but it's so hard to let the love go. I never been one to be dependent on anyone. I'm a very independent woman and have no problem putting in the work.... Just hate the idea of having to start all over again.",
                                        "comment-author": "BabyCakes324",
                                        "replies": [
                                            {
                                                "body": "Well, the writing is on the wall. I’m truly sorry that he misled you into thinking he was worth sticking around for, and you’re far from the only person who has ever fallen for a man who misrepresented who he was, but please be a friend to yourself and get out of this marriage before it becomes even harder to do. 33 is still very young! Don’t waste a single day more with this AH. \n\nAgain, I ask you to reflect on what you think you deserve. He manipulated you into thinking that he would make you a priority with how he treated you in the beginning, and that’s nothing to be ashamed of—that’s on him. But if you waste time staying with him, that’s on you. You’ve given him chance after chance to make loving gestures towards you. He is telling you, through his actions, that he’s not going to to do this.",
                                                "comment-author": "Low_Ice_4657",
                                                "replies": [
                                                    {
                                                        "body": "As I read your comment, one song came into my head *Everybody Play the Fool* I'm no expectation to the rule.\n\n\nI have been trying to become my own best friend and love myself more but that's a process in itself. I know I deserve better. I should be with someone who gives me as much love as I give them and then some. 😮‍💨 Sadly, a lot of you are right about his actions. They are all saying he doesn't care about me or our marriage which hurts to say, but I know sometimes the truth hurts 🤕💔",
                                                        "comment-author": "BabyCakes324",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "You've done everything right, nothing wrong.  Your feelings are spot-on justified.  \n\nYour husband has neglected you.  For a partner not buy your spouse a gift of any kind for all those special occasions, even a small or handmade one, or flowers from the grocery, is cruel.  He's showing you that you don't matter, aren't cherished or special. \n\nHe seems to be trying to trap you to him with a baby which will be just another responsibility on you.  What he really needs is to learn how to talk about and share his feelings.  He needs to learn to give love, affirmations, be unselfish.  I highly suggest two books - SECURE LOVE by Julie Mennano and FIERCE INTIMACY by Terrence Real. Both of you should read these together.",
                                "comment-author": "Quiet_Water0128",
                                "replies": [
                                    {
                                        "body": "Thank you for the validation!!!! Sometimes, he will downplay the situation and make it seem like I'm overreacting or being too emotional (because in his eyes women are very emotional creatures). I will look into those books! Thank you for the suggestions!",
                                        "comment-author": "BabyCakes324",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Divorce? You deserve better.",
                "comment-author": "darkhorse4725",
                "replies": []
            },
            {
                "body": "He doesn't like you, let alone love you.\n\nPlease let him go. You deserve so much more than this.",
                "comment-author": "empress-888",
                "replies": []
            },
            {
                "body": "Bye Felicia.",
                "comment-author": "Throw_RA099",
                "replies": []
            },
            {
                "body": "Op, this man is showing you that he doesn’t like you or appreciate you. It is intentional and very vindictive. Trying to purposely hurt you like that\n\nDon’t accept his low level love. Something has got to change start by choosing yourself, your peace and mental health. He has shown who he is, believe him.\n\nSending hugs",
                "comment-author": "BeautifulTerm3753",
                "replies": [
                    {
                        "body": "Thanks for the hugs 🤗🤗🤗 \n\n\nI would tell him I don't feel like he likes me or loves me and then he'll become super affectionate. I know how he is treating me isn't right and agree something has to change, on his end, but how long should I continue to wait for a change? I have started to seek self peace 😌 with exercising, going out with friends and started talking to a therapist. I asked him to do the same but there was an excuse with that 😮‍💨",
                        "comment-author": "BabyCakes324",
                        "replies": [
                            {
                                "body": "Good for you exercising, talking to friends, and a therapist.   \nYour husband isn't trying to change or grow so it's hard to know how long to keep going down a tunnel that has no cheese.  If he was working on himself, or recognized you with communication, a gift, affection all without you or having to ask, that would be a healthy sign. But instead he's pouting and giving silent treatment which is a form of abuse.",
                                "comment-author": "Quiet_Water0128",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You’re focused on the mother’s day detail that you’re biggest the billboard sized picture. this man does not like you at all",
                "comment-author": "throwaway291919919",
                "replies": []
            },
            {
                "body": "I'll tell you the same thing I told another woman earlier; no effort is worse than low effort. He doesn't care to give you either because he doesn't care about you. Obviously he'd rather cheat on you so I don't know why you'd expect him to give you any kind of gift. If you're settling for his treatment of you now you can bet it'll never get better. \n\nGive yourself the gift of love and peace,  leave him. Happy Mother's day, Birthday, Valentine's and Christmas. You deserve better!",
                "comment-author": "madworld3232",
                "replies": []
            },
            {
                "body": "Get yourself the best gift possible… divorce. You deserve someone who cares about you. Stop settling as there will be someone who loves you completely. Sending hugs 🥰",
                "comment-author": "Cwtchfairy1979",
                "replies": [
                    {
                        "body": "Thanks for the hugs 🤗🤗🤗 and kind words",
                        "comment-author": "BabyCakes324",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I am so glad for you that you are to taking care of yourself &. Your mental health.\n\nI think do ask how much longer. Because remember if wants to change he can! If he wants to appreciate and celebrate you, he would! The same energy he puts into throwing tantrums, throwing things and removing his ring, this are all conscious choices done to hurt you intentionally.\n\nHe can be better but he wont! So ask yourself op, how much longer can this be your normal, how much longer can his chosen low level for you be your normal ? A year ? 5 years? The next decade?",
                "comment-author": "BeautifulTerm3753",
                "replies": []
            },
            {
                "body": "Hope everything will be going great for you.",
                "comment-author": "VikingLinh",
                "replies": []
            },
            {
                "body": "Way to bury the Lede! He is talking to other women and you are upset he didn’t get you anything for Mother’s Day. Honey, that is the least of your worries! Can I ask what you are getting out of this relationship? He doesn’t even LIKE you! Please do NOT get pregnant with this 🍑 hole! Do you want to spend the rest of your life like this? Because it is only going to get worse, get out while the getting is good! \nUpdateme",
                "comment-author": "Complete_Pea_8824",
                "replies": [
                    {
                        "body": "The talking to other women happened months ago and was addressed. Like I said in a different comment, if I'm supposed to working on forgiveness, I need to allow time to forgive and see change. Since then, there hasn't been any other women. Mother's Day was just yesterday and very fresh! As far as what am I getting out of the relationship.... Everything he is \"giving\" me I can give myself. Since we've gotten married, he has tried to get me to work less and less but I couldn't give that up. Will have to get a second job to cover my finances but I've worked 3 jobs at once so that's nothing.... I guess he's given me more time to spend with my children since I didn't have to be the bread winner.",
                        "comment-author": "BabyCakes324",
                        "replies": []
                    }
                ]
            },
            {
                "body": "You're married to a boy and not a man. A am a professional marriage helper. He's immature and a one man band - meaning he's not relational. Relational people are aware of the responsibility of keeping a marriage alive, and they actually want to, and enjoy, doing things that make their partner happy. Being relational is a give and take proposition. Two people working together to make easier and more enjoyable for each other. \n\nSounds, too, like you are a mother figure to him more than a wife. He asks you for money? Come on. A confident man wouldn't be comfortable in that position, he'd make sure he had his own funds available at all times. And the funniest part is he talks to other women! The nerve! If they knew more about how he is they'd run for the hills. He is no prize.\n\nIn the end, he's not grown up enough mentally and emotionally to give you what you need. He literally does not comprehend the necessity of it. He probably could change, but I'd bet a lot that he won't. The pouting and emoting is a prime example of where he is developmentally - at about the 9 year-old-level.\n\nI'm so sorry. I wish I could wave a wand and make it all good for you. I want to make sure, though, that you feel validated about your concerns. They are valid, and your marital situation is seriously bad.",
                "comment-author": "HawgLovah",
                "replies": []
            }
        ]
    },
    {
        "title": "Sex advice needed!",
        "post-author": "BigSalt8161",
        "text": "Hello first of all I was half tempted not to post this but I really need help. I 20 F have had 0 sex drive the past month or so, my husband 27 M has been asking gently if we could have sex we try and I just can’t get wet at all. He’s started thinking I’m not attracted to him but I am. I need advice on how to fix this. Before anyone ask yes I have went to my gyno and she said everything is working as it’s should medically. I want to have sex with my husband I really do because he is an amazing lover. He hasn’t been pushing me or trying to guilt trip me, but I can see how much he is beating himself up about it.\n\nTL;DR I can’t get wet for my husband and I need help. He hasn’t done anything wrong ",
        "comments": [
            {
                "body": "are you on any medications? There are some medications that cause low libido and or vaginal dryness",
                "comment-author": "cdt1998",
                "replies": [
                    {
                        "body": "I’m on Prozac could that be it?",
                        "comment-author": "BigSalt8161",
                        "replies": [
                            {
                                "body": "Yes, that is likely the reason if there is no other medical issues. SSRIs are commonly known to cause low libido and vaginal dryness",
                                "comment-author": "cdt1998",
                                "replies": [
                                    {
                                        "body": "Is there a way to combat this without stopping my medication?",
                                        "comment-author": "BigSalt8161",
                                        "replies": [
                                            {
                                                "body": "Just google \"prozac sex drive side effects\" without the quotes and you will get lots of information. Sometimes another drug can counteract the Prozac side effects.",
                                                "comment-author": "SemanticPedantic007",
                                                "replies": [
                                                    {
                                                        "body": "Thank you so much. Hopefully this will help",
                                                        "comment-author": "BigSalt8161",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "body": "Unfortunately there isn’t usually much you can do. SSSRIs can cause delayed orgasm and issues reaching orgasm too, so even if you use lubricant you may not be able to orgasm when it’s all said and done.\nYou can look into and talk to your doctor about switching medications, Wellbutrin is a popular one a lot of people switch to when faced with this issue.",
                                                "comment-author": "cdt1998",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I believe it all starts in the mind, are you stressed, depressed, carrying the mental load at home?",
                "comment-author": "Ok_Leadership789",
                "replies": [
                    {
                        "body": "Well yes and no. I am the breadwinner in the house because he can’t work right now because of his health. He does do all the chores for me and always has dinner ready when I get home. So in no way am I unappreciative of what he does for me",
                        "comment-author": "BigSalt8161",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Does he treat you like a princess?",
                "comment-author": "Complex-Orchid5863",
                "replies": [
                    {
                        "body": "More like a queen lol. He is an amazing husband and I am incredibly lucky to have him",
                        "comment-author": "BigSalt8161",
                        "replies": [
                            {
                                "body": "Is it possible that i talk to him instead because talking to you will not help your situation.",
                                "comment-author": "Complex-Orchid5863",
                                "replies": [
                                    {
                                        "body": "This isn’t his fault at all though. It’s all my body being weird. I want sex just can’t get going right to make it pleasant and comfortable for us",
                                        "comment-author": "BigSalt8161",
                                        "replies": [
                                            {
                                                "body": "There are personal products you can use for that.",
                                                "comment-author": "Ok_Leadership789",
                                                "replies": []
                                            },
                                            {
                                                "body": "I understand where you come from and how you feel about it. And no doubt some of it has to do with you. But certain things are more nuanced than they look. I would like to discuss it with you but that will do more harm than good. So i only want to speak with him because I know how to fix it as it is what i do for a living.",
                                                "comment-author": "Complex-Orchid5863",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "title": "I have no idea where to go from here",
        "post-author": "Rebel-x-Heart",
        "text": "So let me start off by saying that  I have my wife blocked on here temporarily in order to avoid any confrontation in a negative way while seeking advice\n\nI (33 m) no longer find my wife (30 f) physically attractive. She has really let herself in the past year and a half and completely stopped caring. She says she doesnt see why it matters. The most physical activity she has done in this time period is every day she walks around 2000-3000 steps from the parking lot at work to and from her car. She then will counter this with a half a sleeve to a sleeve of Oreos or something similar portion size as a \"reward\". I have a job that requires me to stay fairly phycally active, as well as hobbies that require the same.\n\nWhen she attempts to make progress in the right direction and she will do it one time. When she can't do a single part of it, she is done. She attempted yoga. When she couldn't do one of the poses, she went into full on mental breakdown and never touches it again. I've offered to quit going to.the free gym at work and start going to Planet Fitness with her. She says it's \"Out of the budget\"  We make six figures as a household. If PF is out of business, we need to reevaluate out here.\n\nThe point where I got tired and frustrated was this past week going to see Metallica in concert. It was in a small city where there is no adequate parking at the actual venue. We had to park in a garage about 3/4 of a mile away. I was walking at a fairly normal pace. I had to stop every 2-3 minutes because, according to her, I was \"running\". Walking back after, me and my dad were both intoxicated and it only got worse to the point where I was having to stop about twice as often as I did on the way to the concert, in addition to the traffic leaving.\n\nI'm at the point where I have no idea what I need to do here. Every time I mention a solution to her, she has a excuse. She SAYS she wants to be more physically active and get back in shape... But her actual physical actions say the opposite. I can only do so much to help her\n\nTl;dr: I am not sure what to do in this situation. I am starting to think I'm not attracted to my wife's laziness when it comes to her physical health.",
        "comments": [
            {
                "body": "There is a lot that can cause the body image issues are describing.  My wife has struggled with similar problems.  Depression, trauma and anxiety to name a few.  \n\nCandidly some of them may be above your pay grade.  Talk to her in a non-accusing and non-judgmental manner.  If needed, get her help.  It can be a journey.",
                "comment-author": "Ok_Substance1072",
                "replies": []
            },
            {
                "body": "She’s unhappy. Try to spice up your relationship and try to encourage her by truly loving her and going back to ways you were when you first met and see what happens. How old is she? Is she going through menopause? That could be an issue? Have you made negative comments, paid a whole lot more attention to your scrolling over time? Take a hard look at what’s going on and not going on and be honest. Ask her if something is troubling her and truly listen. Ask about marriage counseling. Do what you have to do. There’s more going on here than Oreos",
                "comment-author": "GrannyGoose64",
                "replies": []
            },
            {
                "body": "I think you should gently be honest about how her weight is affecting your attraction to her. You don't have to be cruel but, you should be honest. \n\nSome will deny it but most women do care about how they look and if their partner finds them attractive. I know for sure if my lifestyle was affecting my husband's attraction to me, I would want to know.",
                "comment-author": "mhbb30",
                "replies": [
                    {
                        "body": "It feels that she truly doesnt care. She was raised in a household where they let her do whatever she wants and when there is any pushback, she breaks down. I've attempted to have the conversation in the past where it is basically \"Hey... I love you.. But I would like to see this change for us...\" and she completely shuts down",
                        "comment-author": "Rebel-x-Heart",
                        "replies": []
                    }
                ]
            },
            {
                "body": "2000 steps is roughly a mile, so, regardless of oreo rewards, that distance shouldn't be a problem for her. \n\nWhat happened a year and a half ago? Is her job overwhelming, young children at home, death on the family, medical diagnosis?\n\nAs far as exercise, if she has a good tolerance for walking, get a treadmill or walking pad that she can use in front of the TV.  Take over cooking some meals and make healthy meals and snacks. Go on walks together after dinner and maybe scope out some nice, beginer friendly trails and go for a hike & picnic date on the weekends.",
                "comment-author": "UpOnZeeTail",
                "replies": [
                    {
                        "body": "I dont see how you could say \"Regardless of Oreo rewards\". A serving size for Oreos is three cookies. She eats roughly 16 in a sitting. Thats a problem. Nothing has really changed. We dont have kids. I have bought her a treadmill in the past. It sat in the corner of the room was was rarely ever used, although she specifically asked for the treadmill. I attempt to take over cooking but she will eat 2-3 times the size of a portion and she won't eat vegetables. She won't stick to the healthy snacks. She will just go to the store and buy the unhealthy snacks. Meal prepping had helped for a short period.. But if she has to eat the same thing more than maybe 2 days in a row, she will go behind my back and eat out without telling me. We work opposite shifts... So when I leave for work, she is leaving the office. When I get home, shes in bed sleeping. When she gets up.for work, im sleeping. We have attempted to.do hikes and such. It works for a short while but then she gets lazy about it",
                        "comment-author": "Rebel-x-Heart",
                        "replies": []
                    }
                ]
            },
            {
                "body": "This sounds like a breakdown in communication and empathy, along with your need for a routine in place to me. She might also be suffering from anxiety/depression/unhappiness and that she thrives on spontaneity, while you thrive on routine.\n\nWhy don’t you try getting a list of meals that you can prep from a batch of materials and use a die to randomize it? You have your routine while she has spontaneity. Maybe find a mutually acceptable outlets to unwind together? It’s pretty clear her endurance is low currently so maybe a low impact activity like swimming? How far were your walks? I’m guessing they may have been a little far for her and she got tired and gave up, so maybe try talking to her and gauging when she starts to get tired? Try increasing the distance weekly and inserting an activity she considers fun right after the walk? \n\nI’m well aware of the single mindedness you are likely able to devote to a task day after day, as my brother is very similar in that respect. Your wife is not like that and she needs a ramp up to activities. She cannot be at your level immediately and my guess is that’s why she is stopping, she knows you can’t come halfway to meet her until she catches up and gets frustrated.",
                "comment-author": "seraphimcaduto",
                "replies": [
                    {
                        "body": "I've attempted to find her outlets. She would rather sit on the couch and color... While I would rather do something like going out to a paintball game. She doesnt want to do the swimming or walking or really any activities. We have attempted the swimming. She just goes and floats. Thats not a workout thats just floating on your back. She gets tired pretty easily. From the minute we get to somewhere we have to walk, about 30 seconds in it turns into \"This is stupid.\" \n\nI will probably say that I contributed to this somewhere along the way. Im not currently, but in the past, I was extremely depressed. I sat inside and played video games alot. Now that I have outdoor activities I enjoy doing, ive developed the mentality for myself that I don't want to be a fat piece of shit and make it a habit to do things outside instead.\n\nI believe she is dropping because when things get hard, thats what she does. Ahe is like that in other aspects of life. When she gets pushback, instead of pushing through, she shuts down",
                        "comment-author": "Rebel-x-Heart",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Quit making her do anything. If she doesn’t want to she’s not going to. If you want her to be slimmer, take over the cooking and cook healthier meals with healthier portions. Take her out on the weekend where you know she’ll have to walk a lot. It’ll be hard in the beginning but she’ll improve if you keep it up. Get a dog and go walking together. Get her a binoculars and go bird watching together, she’ll walk miles without realizing it. Don’t be so hard on her. Did you only married her for her looks?",
                "comment-author": "MaiBoo18",
                "replies": [
                    {
                        "body": "First off, I'm not MAKING her do anything. I attempt to take over the cooking. She will go back for seconds or thirds and she refuses to eat essentially any vegetables. I try to take her out on the weekends. She doesn't want to go. She bought walking shoes... She went walking like once. We have a dog. She will take the easy way and won't take the dog on walks longer than MAYBE 5 minutes around the cul-de-sac, even though we live in a nice area. I am not attempting to be hard on her but when she promises she will do things then she doesn't, it's frustrating. I did not marry her for just her looks. She has always been a bigger girl since I've known her... And I love that. I dont want a girl who looks like a railing... She lost alot of weight before the wedding and now in the past two years has gained it back in addition to more",
                        "comment-author": "Rebel-x-Heart",
                        "replies": [
                            {
                                "body": "I get this. It's not the weight that turns you off, its the lack of trying. It doesn't take any effort at all to forego second and third helping at dinner, or leaving the Oreos in the cabinet. I have totally no sympathy for someone who complains about their weight and then posts pictures on SM of them eating a banana split.",
                                "comment-author": "SuluSpeaks",
                                "replies": [
                                    {
                                        "body": "Its not even the lack of trying. It's the lack of giving a shit. It's the promises that are broken the minute she gets any pushback. Its the \"Hey we had this conversation about how I would live to see you put in effort and now your dad's calling me telling me not to come home\". Its the having \"friends\" on Reddit who she seeks the attention of more than she seeks my attention.",
                                        "comment-author": "Rebel-x-Heart",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Metallica doesn’t play in small cities.",
                "comment-author": "Want_to_be_a_mermaid",
                "replies": [
                    {
                        "body": "Not saying this is real or not, but they played at Virginia Tech last week.  Blacksburg is not a huge city.",
                        "comment-author": "Ok_Substance1072",
                        "replies": [
                            {
                                "body": "Thats the show I was referring to",
                                "comment-author": "Rebel-x-Heart",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "I mean... Blacksburg, Virginia isn't a huge city. Pretty much the only thing there is the college",
                        "comment-author": "Rebel-x-Heart",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "Husband (33m) is mad at me (28f) for saying something",
        "post-author": "throwraforiegnmk",
        "text": "My husband (33m) and I (28f) have been married for 2 years together for 8. I was taking my dog out on a walk today and when I called her over, I noticed she was limping. I asked my husband if she hurt herself while playing earlier with him and he said no and called her over and made her stand on two legs on the ground and two on his lap to cuddle. All I said was it’s not time to snuggle and that I wanted to see if she was still limping. But we had plans to watch a movie after and now he won’t sit in the same room as me. When I went to the bedroom to lay next to him, he left to the living room and told me to go do my own thing which I’m doing now since I’m not going to force him to sit in the same room as me. But I did ask what was wrong and he said that I was trying to make him be the bad guy earlier and was accusing him of hurting our dog. I wasn’t though and know he would never hurt her.\n\nAll I wanted to do was make sure our dog was okay and I didn’t say it meanly when I said what I said. But I feel like I always say the wrong thing with him and he always says I cause him to react this way. However, this time he didn’t say that or blame me for his reaction. What can I do to help this situation and get him to not be mad at me? \n\nTl;dr: I was worried my dog was hurt and asked my husband not to cuddle with our dog at that time. But now he is mad at me.",
        "comments": [
            {
                "body": "It honestly sounds like he has a history.  When things simmer down, it would be beneficial to perhaps have an earnest chat with him about your motive.  Perhaps inquire more about what it is that is causing him to feel accused.  \n\nWhen he answers you may feel attacked or accused yourself, but you need to put on some shields against that because he is operating from a trigger in his past. Perhaps a mother who did a lot of passive aggressive antics. An ex girlfriend who manipulated him and always made him to be the attacker.  A sister who teased him and blamed him for things he never did. The causes are almost endless, but he will never be able to break that reaction unless he begins to acknowledge the past hurt. \n\nPerhaps some therapy?",
                "comment-author": "jbenk07",
                "replies": [
                    {
                        "body": "We have done two sessions but it wasn’t helpful because he during the session he wanted to focus on why he did t want to celebrate holidays because of his principals and the therapist said he didn’t show much empathy for me and he didn’t like that",
                        "comment-author": "throwraforiegnmk",
                        "replies": [
                            {
                                "body": "This is why you keep going though. Couples counseling is meant to bring a third neutral party into the relationship to help identify where there might be things to work on, clearly identify what those things are, and give you a direction to move in once those things have been acknowledged. From all of your comments and rereading your post, he sounds like a closeted narcissist, and those are generally the most dangerous towards a partners psyche. The lack of empathy the therapist pointed out and his reaction to being told that, are the biggest red flags that honestly you need to take a serious look at. Understand that he won't get better if he doesn't continue therapy, and I was additionally suggest he start doing solo therapy separately from couples therapy so he can learn more about his narcissistic tendencies and learn how to start managing them.",
                                "comment-author": "Objective_Pop8407",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Cause him to react that way? Is he a robot you programmed or a puppet ? Does he not have his own conscience? Why is a grown adult blaming someone else for his shortcomings?",
                "comment-author": "sah48s",
                "replies": []
            },
            {
                "body": "Red flags this is an abusive relationship:\n\n When one person gives another the silent treatment and avoids them out of anger, that's emotional abuse.  \n\n*\" silent treatment often functions as a method of emotional abuse. An abuser may use this tactic to exert power over their partner, reinforcing their dominance in the relationship. When one partner withdraws communication, it can create an imbalance that leaves the other feeling isolated and desperate for connection. This is especially harmful in relationships characterized by ongoing conflict or tension, where one partner may already feel vulnerable.\"*\nhttps://www.psychologytoday.com/us/blog/invisible-bruises/202411/stonewalling-as-a-form-of-emotional-abuse\n\nHim accusing you of something you didn't do is also a bit abusive.  You tried to explain, and he doesn't want the truth.  \n\nIt's also not healthy that he's staying angry and punishing you for many hours over something so tiny\n\nRed flag that he's more worried about his idea he was accused than if the dog actually is injured.   \n\nYou can do couples counseling to understand better what's going on and to recognize healthy/unhealthy behaviors.",
                "comment-author": "ProtozoaPatriot",
                "replies": []
            },
            {
                "body": "Is this a common theme for you two? I could see how the tone, or the way you worded it, could feel like an attack if this is something that happens regularly. If you are typically critical of him, what you said could imply that he did something wrong while they were playing to cause the dog to get hurt.",
                "comment-author": "SevenBraixen",
                "replies": []
            },
            {
                "body": "He’s behaving like a petty child who got his feelings hurt. Tell him to get over himself.",
                "comment-author": "jazzyjane19",
                "replies": []
            },
            {
                "body": "It’s time to leave the relationship. Imagine if you had kids. Starting tomorrow make a plan to leave in 4 months. Don’t put anything on paper that he can find. Put everything in your phone. There is a way to password protect your notes. Don’t discuss your plan with family or friends. He’ll be blindsided but it’ll keep your family and friends out of it until you’ve moved out.",
                "comment-author": "Acrobatic-Pen6880",
                "replies": []
            },
            {
                "body": "Hope you will be doing well.",
                "comment-author": "VikingLinh",
                "replies": []
            },
            {
                "body": "In the future I would try to rephrase your questions to where they don't sound like an accusation.\n\nYour husband is also acting like a child",
                "comment-author": "Apocalypstik",
                "replies": []
            },
            {
                "body": "Sounds like he does have something to do with the dog limping. I'm sure he didn't mean to but he might think that you'll twist it into something making him feel whatever way he starts feeling.",
                "comment-author": "Global-Reacharound87",
                "replies": []
            },
            {
                "body": "Hi OP — I’ve read both your recent posts, first about the rental car situation, and now this one about your dog, and I just want to gently reflect some patterns that are emerging. I say this as someone with a therapeutic lens and with deep compassion for what you’re experiencing.\n\nIn both situations, you're expressing very reasonable concerns — clarifying rental policies, checking on your dog’s limp — and your husband’s responses have involved emotional withdrawal, defensiveness, and blame-shifting. What’s particularly important is that when you try to express how his behavior affects you, you're met not with understanding, but with comments like “you’re too sensitive” or being told to “control your emotions.” This is a form of emotional invalidation, and over time, it can leave a person feeling unsafe, unseen, and unsure of themselves.\n\nThere are also some markers in your posts that may suggest narcissistic traits in your husband’s behavior:\n\nA tendency to externalize blame and avoid responsibility\n\nReacting with coldness or silent treatment rather than communication\n\nDismissing or minimizing your feelings\n\nBecoming angry or rejecting when gently confronted (as in your couples therapy experience)\n\nAnd consistently needing to be “right,” even at the expense of emotional connection\n\nIt’s also quite concerning that you’ve begun to internalize this dynamic, saying things like “I always say the wrong thing.” That kind of self-doubt is often a result of being in a relationship where your emotional needs are regularly invalidated.\n\nIt’s clear you’re trying very hard to communicate respectfully, to de-escalate, and to care for your relationship. But emotional safety has to be mutual - and right now, it sounds like you’re carrying the emotional weight alone.\n\nIf it’s accessible to you, I’d strongly encourage individual therapy - not because you are the problem but because you deserve support, clarity, and a space that’s just for you. You’re not overreacting, and your feelings make sense in the context you’ve described.\n\nYou deserve to feel heard, respected, and emotionally safe - consistently.",
                "comment-author": "Objective_Pop8407",
                "replies": []
            },
            {
                "body": "I’m sorry but he seems like a child. Some men you have to coddle them through the way you speak because of their egos. It seems like he’s one of those men. personally I don’t see anything wrong with what you said but most men don’t want to be told anything especially from a woman, and act pissy if you do. which would explain why you feel like you’re always saying something wrong to him because you’re always having to tell him something. I’m sure if you sit down with him and get down to the root of the problem you will come to this conclusion. Change the man or change yourself. Only 2 options.",
                "comment-author": "Dapper_Frosting_8400",
                "replies": []
            },
            {
                "body": "We’ve all had it. The dog screams or is limping or something and the question is what did you do the dog. It’s not that the dog jumped off a wall and sprained its leg or that it stood on something sharp. \n\n It’s what did you do to the dog",
                "comment-author": "0hip",
                "replies": []
            },
            {
                "body": "Sounds like a sensitive guy, maybe he needs a hug.",
                "comment-author": "listeningisagift",
                "replies": []
            },
            {
                "body": "You're  not responsible for hus reactions - but you should have left out the parental, \"Now is not the time to play\" preamble, and when the dog got down just said you want to see her walk or if she's limping. \n\nIt's all in your delivery.  Read the Gottman's books or Terry Real's ° FIERCE INTIMACY \" asap.  Your marriage is in peril,  and not tomorrow or next month, but your WP doesn't know how to confront you about things you say or do that hurt him... he's trying now. Don't ignore the opportunity to have a partner, and not mother your husband.  He's a grown man who's survived in the world just fine. Allow him dignity.",
                "comment-author": "Quiet_Water0128",
                "replies": [
                    {
                        "body": "He cared more about his ego and dignity then the fact that their dog was seen limping. How are you glossing over that?",
                        "comment-author": "Objective_Pop8407",
                        "replies": [
                            {
                                "body": "Not glossing over anything.  I'm addressing the bigger issues OPis asking for help with. Read her post again. He'd never hurt the dog and there's nothing to indicate that at the time of occurrence.  What he cared about was being judged and yelled at for reassuring the dog. How you speak to a spouse matters. She could have accomplished the same result without the parental admonishing tone. \n\nIt's not about the dog. She wrote that he feels this way repeatedly from her.\nAnd I did say she's not responsible for his reactions, but it is a good sign he is telling her over repeated interactions How she makes him feel.  A relationship is a 2-way street.",
                                "comment-author": "Quiet_Water0128",
                                "replies": [
                                    {
                                        "body": "So I feel the need to ask if you saw OPs statement about their short stint in couples therapy and what the therapist said about him? A licensed professional said he lacked empathy to HER feelings. I'm getting the feeling her husband is a narcissist, not emotionally neglected. Therapists for couples are usually pretty spot on about mentioning who is neglecting who both physically and emotionally, and theirs called him out, not her. I'm not saying that there is no scenario where you wouldn't be spot on. I'm sure there are plenty. I'm also sure this isn't that scenario, and he is a narcissist.",
                                        "comment-author": "Objective_Pop8407",
                                        "replies": [
                                            {
                                                "body": "I don't diagnose psychological disorders via reddit posts. Imho, \"Narcissist \" gets thrown around all too often, when a narcissistic behavior or emotionally immature lack of coping or communication skills exist and may be present. \n\nMCs are not all good ones. So I tend to disagree to a point that they're \"usually spot on \".  Many miss avoidants who aren't able to identify and express their feelings. I'm not taking his side. I'm pointing out two people are in the conversation and OP has agency over her words. His silent treatment is also abusive and useless.\n\nThe books by Terrence (\"Terry\") Real, LICSW, \"US\" and \"FIERCE INTIMACY \" address relational communication in eye-opening ways.",
                                                "comment-author": "Quiet_Water0128",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I have this problem with my wife. Give your husband my solidarity.",
                "comment-author": "Double_Aught_Squat",
                "replies": [
                    {
                        "body": "she asks you a question and you completely overreact and ignore her?",
                        "comment-author": "lilac_moonface64",
                        "replies": [
                            {
                                "body": "There are ways to say things without the chance of being accusatory. “Something seems wrong with the dog. Let’s make sure she’s not hurt.” is way better than “Hey, did the dog get hurt earlier when YOU were playing with her?”",
                                "comment-author": "tendrils87",
                                "replies": [
                                    {
                                        "body": "That's not accusatory, though. She referenced an exact activity. Not every statement someone says is a personal assault. Sometimes, you just have to take a question at face value instead of trying to read between lines that don't exist. That is actually a form of projection. Psychology deems projecting as a defense mechanism, usually in people who don't know how to deal with their own feelings.",
                                        "comment-author": "Objective_Pop8407",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "If he's constantly telling you the same thing then it's time for you to stop doing that thing. I gonna assume he didn't say anything this time because you never listen in the first place so why bother saying it again for the 100th or 1,000th time. I'd advise you to sit down with him and have him explain in detail what it is you do that bothers him in a way you can understand, because it seems that the way he's telling you, although he probably thinks you should understand, you don't. He's getting tired of it. And this situation right now might not seem like a big deal, having to tell your partner the same thing over and over again is draining and ends up in resentment. Try to pay attention to what he says without thinking of a response back, listen to listen, don't listen to respond.",
                "comment-author": "NelsonFiggy",
                "replies": []
            },
            {
                "body": "Story is swiss cheese",
                "comment-author": "Icy-Gene7565",
                "replies": []
            },
            {
                "body": "You should consider getting rid of the dog. They cause all kinds of relationship issues with their bad behavior and overabundance of germs and shedded hair. Your marriage will thank you.",
                "comment-author": "JazzlikeTrick88",
                "replies": [
                    {
                        "body": "She should consider getting rid of the giant man-toddler. Her future self will thank her.",
                        "comment-author": "one_little_victory_",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "I might start going to church again, and I don't know how my wife will react",
        "post-author": "truthhurts2222222",
        "text": "I'm 36M and she's 40F. We clicked immediately after meeting, and one reason is because we shared political and religious beliefs. (I was raised extremely catholic, but later became a militant atheist. My wife, however, has never even baptized and has never held religious beliefs ever). That was years ago now, and I'm at the point in my life where I'm really missing a sense of community, which is something I always found at church. Even if I don't believe in everything, I really miss building a sense of community with people obsessed with love and forgiveness. I have spoken with her about this, she said she will respect my  beliefs, but right now it's all conjecture before I actually go back. \n\n\nTL;DR  I might start going to church again but my wife will most likely never have religious beliefs. Has anyone experienced something similar?",
        "comments": [
            {
                "body": "If this is something that is important to you , then do it.\n\nAs long as you understand that she will not be partaking , and you are doing it alone.",
                "comment-author": "Extension-Issue3560",
                "replies": []
            },
            {
                "body": "If you’re building a community without her, it’s not going to end well regardless. \n\nYou should also consider that you are likely romanticizing the whole “obsessed with love and forgiveness” part. \n\nMe and my husband are both left leaning atheists. If either of those things changed, I don’t think I would respect him or want to be with him anymore. \n\nWhy not try other avenues to build community? Like hobbies or intellectual groups.",
                "comment-author": "PrimaryKangaroo8680",
                "replies": []
            },
            {
                "body": "My husband started going back to church recently and I make room for that. As long as he isn’t pushing his beliefs onto me and pressuring me then it’s no big deal! \nTake your wife at her word- unless there is reason not to.",
                "comment-author": "Future-Ad-5033",
                "replies": []
            },
            {
                "body": "Obvious it will be a problem, you could just be someone who didn’t care or believe in religion but instead you swung all the way to be a “militant atheist”.  Now you swinging all the way back into the church and you’re worried about your wife instead of worrying about yourself. You sound like an unhappy person who goes down every rabbit hole in the hope it will make a difference.",
                "comment-author": "777ecco",
                "replies": []
            },
            {
                "body": "I dont see where that would be a problem...just cause you are married you dont need to be joined at the hip. If you need a spiritual component and she does not..that's perfectly ok..isn't it?",
                "comment-author": "Global-Fact7752",
                "replies": []
            },
            {
                "body": "You should convince her that she is closer to the grave than you are since she's significantly older than you, then maybe she'll start thinking about the afterlife more.",
                "comment-author": "JazzlikeTrick88",
                "replies": []
            }
        ]
    },
    {
        "title": "Should I (25F) stay and work on this relationship with my fiancé (25M), or is it time to leave?",
        "post-author": "LevelWord5893",
        "text": "I’m 25F and I’ve been engaged to my 25M fiancé for the past 6 months. We were in a relationship in our early 20s, broke up, and then got reconnected through our families a few years later. We decided to give it another chance and eventually got engaged. While there’s been an emotional connection, there’s also been a recurring imbalance in how we show up for each other.\n\nOver the past year, I’ve been managing fibromyalgia, chronic fatigue, and recently got diagnosed with depression. Despite my health, I’ve continued working full time and have done well in my career. He has been struggling after losing his job a few months ago. That said, the emotional distance and avoidance were present even before his job loss.\n\nThroughout our relationship, I’ve made multiple efforts—clearly expressing my needs, asking for couple therapy, and even traveling to see him despite serious health issues. He hasn’t once visited me in the last 6 months.\n\nWhen I shared my depression diagnosis and said I’d appreciate him checking in around my doctor appointments, he said I was “acting like a kid.” I stepped back briefly to process things, and in that time, his parents called me to say they wanted to end the engagement. He didn’t contact me directly—not even to check on my health.\n\nWhen I later called him out on how emotionally unavailable he’d been, he lashed out, called me “stupid,” said I made everything about myself, and that I was emotionally too much. He also said he wanted a “soft and peaceful” partner and that I made him feel unsettled.\n\nI’m not perfect—I’m emotional and I express what I feel. But I’ve tried hard to make this relationship work. I know he’s going through a hard time, and I don’t want to disregard that. Still, the way he’s handled my vulnerability and health challenges has left me wondering whether I feel emotionally safe in this relationship at all.\n\nI still care about him deeply. I wanted a life with him. But now I’m stuck wondering:\n\t•\tAm I being unreasonable in what I asked for?\n\t•\tShould I wait and see if he comes back with genuine willingness to work on this?\n\t•\tOr is this emotional pattern unlikely to ever change, no matter what I do?\n\nWould really appreciate any honest, kind, or even tough-love advice—especially if you’ve been through something like this.\n\n⸻\n\nTL;DR:\n25F engaged for 6 months to 25M. Struggling with health and emotional needs while he’s been distant and dismissive—this has been a pattern even before he lost his job. After I shared my depression diagnosis, they want to break off the engagement, not him. He later lashed out, saying I’m “too emotional” and not peaceful enough. I’m starting to feel emotionally unsafe and unsure if this will ever work.",
        "comments": [
            {
                "body": "By work challenges , if this means he is unemployed after 6 months ..\nrun.",
                "comment-author": "Global-Fact7752",
                "replies": []
            },
            {
                "body": "Why do you want a life with him? Is it fear of being alone and not finding someone else? You’re dealing with a lot and he doesn’t sound like he’s there for you , you’re telling him your feelings and he’s making out you are the problem. You don’t want to live like this do you? Rather be alone and have peace than what he can offer. I say walk , fast. You deserve better, don’t settle.",
                "comment-author": "Ok_Leadership789",
                "replies": []
            }
        ]
    },
    {
        "title": "Not sure what else to do in my marriage",
        "post-author": "ContentAppointment39",
        "text": "I (29M) and my wife (31F) have been together for 5 years and married for 3. I have had issues with my wife for the past 1 1/2 about sex, consideration for our 2 year old son, how she treats herself, how she treats me, and her lack of motivation to take steps in the right direction. She has past ptsd that she refuses to address with her therapists, doesn't ever want to be vulnerable with me, and when I try and give her more resources to support her, she claims she is too \"prideful\" to accept it or never uses it at all. Our sex life took a hit after my son was born but I was understanding because of what pregnancy does to the body, etc. She was supposed to see a pelvic doctor and obgyn's but always missed appointments and sometimes never followed up. I suggested different alternatives in the bed but was meant with a firm no. I later found out besides bodily pains post pregnancy it included prior self body positivity issues, yet I was still being met with insults like \"I'm too vanilla\", didn’t want me to flirt with her (even though when I stopped she would ask what's wrong?), made fun of my features / hair loss, and didn’t want to physically be around me. \n\nMoving on, there are times when I need her to help me get our son's edicational paperwork filled out, or turned in, or just contact our's son pediatrician for documents. She procrastinates then I either have to pick up the slack, we argue, or she asks me to do it. I'm an army captain and work in areas that keep me from having my cell phone (office phone has no caller id or missed call function), plus I have meetings on top of a bunch of other things that could cost me if I don't perform great. I get no slack or understanding ever from her because she didn't get it prioir to her medical retirement from the military, which isn't right both ways. \n\nI usually end up doing all the adulting, get yelled at if I neglected a chore which is fair but she doesn't alway hold herself to the same standard or when I make note of it she gives me the cold shoulder. She takes online classes and our son is in daycare usually from 0700 to 1800. To top it all off she puts all of her friends above me when it comes to spending time or planning events (I'm not invited to anything even then mixed gendered stuff, yes I asked).\n\nI have enrolled and payed for us to go through marriage counseling twice (currently enrolled now) I think its kind of helping but I have also made it all known to her and reached my wits end. Back in February and told her if nothing changed I would start the divorce process after we PCS because I can do better being alone and raising our son instead this uphill battle and with always more effort on my part.\n\ntl;dr wife not being considerate enough thinking of divorce",
        "comments": [
            {
                "body": "Its never a good idea to embark on a relationship with someone who has unresolved \" stuff\" but hindsight is always excellent...After reading your narrative I think you should definitely consider moving on. You are not being met half way in any sense of the word.",
                "comment-author": "Global-Fact7752",
                "replies": [
                    {
                        "body": "That makes sense and I want to do that but also the thought of my son growing up in a co-parent household doesn't sit right with me but is not an excuse to \"tough it out\". \n\nI think she is in a slightly better headspace now but she told me (a year or two in) that she had certain \"thoughts\" before our relationship and I was part of the reason she didn't have those anymore. I am afraid of her possibly going down that path again and not sure how to handle type of situation if should arise.\n\nedit: added \"not\"",
                        "comment-author": "ContentAppointment39",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I think you need to leave. And take your child with you. This woman has zero motivation to adult.",
                "comment-author": "Fuzzysocks1000",
                "replies": []
            },
            {
                "body": "She is too prideful to accept help You are too vanilla to make her happy. There is a lot going on. Good luck. With the right therapy maybe this might work.",
                "comment-author": "buckit2025",
                "replies": [
                    {
                        "body": "I sure hope so but expectations are not optimistic",
                        "comment-author": "ContentAppointment39",
                        "replies": [
                            {
                                "body": "Set a timeline. If it does not get better leave. Alone is better than together and miserable.  I’m not sure how to set the timeline   Good luck.",
                                "comment-author": "buckit2025",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "No offense but you need to leave. You don't want to raise a child to believe this is acceptable behavior. If you won't do it for you do it for your kid.\n\nAll she has is excuses. I find it interesting that ptsd issues don't come up until years into a relationship. She had no issues doing everything needed until you got married and it wasn't as easy to walk away. I don't say this lightly. I was SA repeatedly as a child. My hubby was my first. We dealt with issues early on, and again when the trial happened. It's not like I went years and then it was an issue. At that point it's an excuse.\n\nMaking fun of you, your hair loss, body etc is ridiculous to me and just plain mean. Fyi there are a whole lot of women into bald men. My hubby was losing his hair at 19. He shaves and is absolutely sexy as hell, and that's after 31yrs together. I still love it.\n\nYou are with the wrong person. I rarely suggest divorce because I feel like most people don't even try now days but the exception is abuse. It's not just you she is neglecting, abusing and hurting. It's your kid.\nGood luck",
                "comment-author": "-ladylove-",
                "replies": [
                    {
                        "body": "Thank you for the advice! I think amongst other things that I commented on. There are some people who I feel are waiting on this all to fall apart and I part of me if fighting to prove them wrong but the other half is done. I'm hoping this therapy helps but I am also mentally preparing myself to file for divorce.",
                        "comment-author": "ContentAppointment39",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Adulting is hard. Sounds like you got a rotten one",
                "comment-author": "Icy-Gene7565",
                "replies": []
            },
            {
                "body": "How did she react when you brought up divorce?\nWas she surprised?\nDoes she seem resigned that it's going to go that way? Is that what she wants?\nWas she desperate to keep you?\n\nRemember that if you want your marriage to work, it has to be the two of you against the problem, not against each other.\n\nRelationships are frustrating, because you can't make someone do something they don't want to do, even if you know it would be a great outcome for all parties.\n\nWhen you've been tolerating things like this for a while, you can end up enabling bad behaviour by walking on eggshells, and tolerating their crap. You can also want to pick a battle from every problem.\n\nWith the phone calls for your kid, I suggest you take it on yourself for now. Find a way. Email. Respond out of hours. When you need to pick an appointment time, give them 5 options to choose from. Sure it will be longer and more painful, but it takes one stress or away from your marriage. \n\nWhy exaclty is your wife medically retired? Is she still physically hurting from the incident? Mentally hurting? \n\nI get the impression she's kind fo given up on life and is completely overwhelmed at the mountain of challenges she sees ahead of her to get her life back together. \n\nEvery time you want sex, give her a non sexual hug for 30 sec. and then don't make any moves. And accept no sex. Keep doing this a million times. Eventually she will initiate sex again on her own terms, once she feels unobliged. \n\nInvite her on a date where you both get dressed up. \n\nTake care of business. Women don't want to have sex with a man baby. If she's had to clean up after you, she feels like your mom. Make sure you've given her no reason to feel like your mother. \n\nStop worrying about what is your fair share and do extra for a while. See what happens. \n\nDon't chuck away your marriage. You'll have to see each other constantly to coparent your child for a very long time.\n\nIf she won't go to therapy, go alone. They will teach you skills for things you can do without her participation.\n\nYou think walking away will be an escape from all your problems. But you may find it's just a whole new set of problems.",
                "comment-author": "Pristine_Egg3831",
                "replies": [
                    {
                        "body": "I originally told her of my frustrations and possible divorce she just shut down, which she does every time I try to address any problem or she says, \"I do not know what you want me to say?\". She expressed she was sorry I felt that way but nothing else was done afterwards.\n\nShe was forced out of the military due to a combination of physical and mental problems. But you are right in that she has made it very clear of not want to be here (like exist) anymore but not to the point where she has a plan or is committed to anything. She's just majorly depressed and even our therapist has recommended she seriously consult with her doctors about her medicine not being as effective anymore but I have no faith she will follow through and have it checked.\n\nI want to initiate more dates but it always feels I'm the one putting the time into plan everything meanwhile she is always is searching for the next concert or trip to see her friends. I am the one planning the family vacations, she may suggests ideas but if I don't put the follow thru it won't happen no exaggeration. \n\nI'm not delusional to think relationships will always be 50/50. But when I'm doing an overwhelming portion of everything in the relationship it gets tiring not knowing when the scale will tip in the other direction so I can get some support. I have tried putting extra work in around the house while maintaining at work a few months ago for a month, couldn't sustain that before reaching the verge of a mental breakdown. Didn't see a change which led to me telling her of my thoughts of divorce.\n\nI am working on myself through therapy because I'm not perfect but her lack of change is the unsettling part and she currently has anxiety we will be moving close to her mother who can be critical but also gets on her for not taking care of business to support.",
                        "comment-author": "ContentAppointment39",
                        "replies": [
                            {
                                "body": "This sounds super hard. Was she always depressed the whole time you've known her? If not, how long has she been depressed now? She doesn't need couples therapy, she just needs therapy. Unfortunately she might be so depressed that therapy sounds pointless to her.\n\nI have definitely been depressed, and have come back from it. I like to feel that I'm protected from it happening again, as it was triggered by multiple depressing things. And when some of them resolved, and I learnt some skills, I'm now resilient and able to avoid the risk again. Unless a lot of terrible things happened!\n\nMy sister and her husband divorced after 30 years. His mother died at the 15 year mark. And he stopped working. Then he claimed he couldn't work because he was depressed. He was also emotionally abusive to her and the kids. She had been out the door for 2 weeks and magically he was back working again. I know him fairly well, and I honestly believe he did feel too depressed to work, and I think the fear of needing to be able to get a mortgage to buy out his half of the house was enough to \"snap him out of\" at least enough of his funk to magically go to job interviews after 15 years of barely working.\n\nYours isn't a clear cut case. It seems like lots of your wife's stuff is about her being depressed. And then trying to address any issue just makes her feel more hopeless.\n\nIt's really hard, because you're trying, and she's fighting you. So you just want to give up! Just be aware that this isn't rare. I assume its instinctual in some circumstances.\n\nYou may well come out the other side of this happier and stronger than before. But probably not before it gets worse. You've got to ask yourself how much energy you have for that. And how good it really ever was. If she really was once an awesome person who you could see yourself growing old with, I'd encourage you to keep going. \n\nBut don't use your current approaches. Change it up entirely. Anything you'd normally complain about, don't. Anything you normally don't bring up, bring up.\n\nI also wanted to comment on the shut down thing. I have to admit, I do that. I do it when I don't feel safe, when I think I won't be heard compassionately, when I think my partner is listening just to argue the opposite. Basically if I know I'm going to lose the fight, I'll disengage. If I feel confident that the conversation will only have negative outcomes, I won't participate. I now have a better partner who can tell when I'm doing this, and seems to know how to get me to talk. But I am still resistant at first from so many bad experiences, starting with my dad, or just wanting to be contrarian, rather than resolve the issue.\n\nHave you tried a book or audio book that goes into lots of depth on turning your relationship around? One from someone who has been doing this a long time, like Dr Phil or Tony Robbins or the men are from Mars guy. I feel like that tradional Dr Phil one really switched something I my mind. That you can only change yourself. And inspire the other perosn to change. You can't convince them to change.",
                                "comment-author": "Pristine_Egg3831",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I'll be the asshole.\n\n\nAre you absolutely sure you are the biological father of your son?\n\n\nI counted 4 huge red flags in this post alone.",
                "comment-author": "Throw_RA099",
                "replies": [
                    {
                        "body": "I'm sure he looks like my clone.",
                        "comment-author": "ContentAppointment39",
                        "replies": [
                            {
                                "body": "Good luck.\n\n\nThe 4 major red flags just so you can sleep tonight:\n\n\n1. The history of psychiatric/health issues and refusing to get evaluated.\n\n\n2. Refusing to accept help/not taking accountability for household chores and child care\n\n\n3. Not confiding in you at all, the one person she should feel safe to talk to about anything.\n\n\n4. The dead bedroom and refusing to compromise or even come to the table for a discussion and insulting you about your sexual preferences. \n\n\n5. The deprioritizing of you and not inviting you out with her friends even when couples and her female friend spouses are invited.\n\n\nRead your post again and didn't catch #3 the first time even.",
                                "comment-author": "Throw_RA099",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "title": "Husband is helpless",
        "post-author": "Living_Watercress",
        "text": "Mt husband and I are seniors. He is partially disabled. He is very obese and has issues related to that. He also has a hot temper and loves to yell and cuss at every little thing. He can't really do any heavy lifting. So he is constantly asking(ordering) me to do things. Lift this move that. I am sick and tired of being the strong man. I am a 73 year old woman. He treats me like a servant. Then he wants to know why I am in a bad mood. He has no friends or male relatives to help with anything. I am sick to death of having to help constantly. It's not my fault he is obese. I am just venting.Tl;dr I am tired of being a servant.",
        "comments": [
            {
                "body": "That’s awful. I hope you can find a caregiver support group and home health aides. Having your own time and friends who understand the stress. The idea of « selfless devotion » as being a good wife is total BS and it sounds like he expects that and guilt-trips you with it. \n\nMaybe he does feel guilty about bothering you, and maybe he’s hating himself for being the way he is. Doing whatever he can for himself could be a constructive way to combat those feelings. A therapist could help him to see that. But first, you need and deserve to have a life of your own. \n\nGod bless!",
                "comment-author": "Character_Candle7274",
                "replies": []
            },
            {
                "body": "It’s ok to be fed up, sounds like you need a really long break from him. Are you able to get him into a nursing home or have home care come and help you out? It’s also ok to just tell him that you can’t keep going like this and that you want to leave. You have to look after yourself or you will end up collapsing from the stress of having to do it all yourself.",
                "comment-author": "Perfect-Day-3431",
                "replies": []
            },
            {
                "body": "You don’t deserve to carry all this alone. You are not a servant. \n\nYou have every right to rest, to set boundaries, and to ask for help. Please take care of yourself and protect your peace. It’s okay to say “no,” and it’s okay to prioritize you for once. You matter too 💖",
                "comment-author": "Beneficial-Cut5635",
                "replies": []
            },
            {
                "body": "Just because he gives you 'an order', doesn't mean you have to do as he says, he's not your boss or keeper. You need to start standing up for yourself & telling him no. Tell him that perhaps if he asks you nicely, then you'll help, but you're not his fucking servant & until he can ask you respectfully, you're not doing his bidding anymore. Going forward, he has 2 choices; he can either ask you nicely or do it himself.",
                "comment-author": "EnerGeTiX618",
                "replies": [
                    {
                        "body": "Yeah, what’s he going to do if she doesn’t do whatever he yelled about? Yell more? Cool. Then it definitely isn’t happening. Just like training a toddler: wait until they say it in a nice way and then get it with a lot of praise. “Look at you! You managed to use your respectful words!”",
                        "comment-author": "davenport651",
                        "replies": []
                    }
                ]
            },
            {
                "body": "You don't have to help him. It's not too late to go on strike, and it's not too late to get divorced",
                "comment-author": "Drakeytown",
                "replies": []
            },
            {
                "body": "Sounds like he should be on a low carb diet and be told no with walking away so you don’t have to hear his complaints and bad mood. Don’t make excuses for why you can’t do this. Be firm from now on how you’ll be treated or walk to another room and get away from him.",
                "comment-author": "Similar_Cranberry_23",
                "replies": []
            },
            {
                "body": "Do you ever stand up for yourself in the relationship?",
                "comment-author": "777ecco",
                "replies": []
            },
            {
                "body": "He needs counseling. It’s unreasonable to expect you to never become resentful. Or maybe he could do occupational therapy?",
                "comment-author": "AdAgreeable2528",
                "replies": []
            },
            {
                "body": "I'm so sorry. It'd be one thing if he was appreciative. But to be a total dick about it. While it's probably misplaced aggression, there is no excuse for it. Next time this occurs, go out for a drive. Take a couple of hours. Put him on mute and enjoy the blue sky. And keep doing that till he gets it thru his thick head you're not going to take it anymore. You're worth more",
                "comment-author": "Rmir72",
                "replies": []
            },
            {
                "body": "Boundaries. Tell him you are done. He can see his doctor and get a referral to a skilled nursing facility or for home help. He can get a referral to a weight loss clinic if he wants to try to improve his health.",
                "comment-author": "sunshine_tequila",
                "replies": [
                    {
                        "body": "I would love this but I don't think he can afford a nursing facility. Home health won't help because he can still drive. He is seeing a bariatric clinic but he isn't cooperative with their advice.",
                        "comment-author": "Living_Watercress",
                        "replies": [
                            {
                                "body": "You are not responsible for him. If you are in the US this is what Medicaid is for regarding a nursing home.\n\nI highly recommend you read “Unfuck your boundaries” and do the attached workbook. You will be so much happier when you honor your boundaries.",
                                "comment-author": "sunshine_tequila",
                                "replies": [
                                    {
                                        "body": "What are you saying here? \n\nThey are an older couple and married so yes at this point they are responsible for/to each other. ... \n\nI'd suggest they hire outside assistant for help tho...",
                                        "comment-author": "something_lite43",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I feel for women who grew up with infamous boomer American ‘men'. You guys did get the short end of the stick. He’s ass, from teenager right until death, would be single and lonely today. \n\nTell me he isn’t one of the guys on an electric scooter at Walmart. 🤣",
                "comment-author": "Minute-System3441",
                "replies": [
                    {
                        "body": "No. He has used them a few times. Many of the men in my generation died in Vietnam. The healthy men served then came back dead or damaged.",
                        "comment-author": "Living_Watercress",
                        "replies": []
                    },
                    {
                        "body": "Umm my husband uses one of those carts and he’s not a boomer.  Walmart carts are trash btw lol",
                        "comment-author": "PaleDifference",
                        "replies": []
                    }
                ]
            },
            {
                "body": "You vowed for sickness and in health through good and bad. Deal with it.",
                "comment-author": "adiboxer",
                "replies": [
                    {
                        "body": "I don't beleive in that. And there is also something about honoring your wife which he doesn't do.",
                        "comment-author": "Living_Watercress",
                        "replies": []
                    }
                ]
            },
            {
                "body": "It sounds like you want a divorce",
                "comment-author": "ProtozoaPatriot",
                "replies": [
                    {
                        "body": "At 73....c'mon 😩",
                        "comment-author": "something_lite43",
                        "replies": []
                    }
                ]
            },
            {
                "body": "We went to dinner today,  Mothers Day. Guess who paid? I did.",
                "comment-author": "Living_Watercress",
                "replies": []
            },
            {
                "body": "Go! He's obese because he eats too much that's not your issue..",
                "comment-author": "Global-Fact7752",
                "replies": []
            }
        ]
    }
]