[
    {
        "title": "I’m afraid I don’t love my wife anymore",
        "post-author": "Impossible-Self-8534",
        "text": "Hello everyone - using a throwaway account to tell you about my situation.\n\nM33. I have been in a stable relationship with F32 for almost 10 years, 7 of which I have been living together and the last 3 of which I have been married.\n\nMy wife has never been the “party lead”, she is introverted and rather closed off. However, with me she has always been outgoing and friendly, intelligent, we share the values of life. We have always been well and in good balance - after all, getting married means choosing yourselves, and we have done so.\n\nRecently, however, I had an epiphany: in the last 2-3 years I have almost no recollection of my wife being enthusiastic or laughing happily about anything. She is always anxious, depressed, sullen. She always comes home sad. She relies on me for everything. Every day there are problems and anxieties, and she tells me that I am the only positive thing in her life.\n\nShe has few friends, zero hobbies, she almost never wants to go out. Ever since I had this epiphany, I can't shake it off. I feel like for the past few years I have been on standby taking care of her, but since I realized this I can't do it anymore. I just can't do it anymore. Being alone is now almost a relief. I feel like there is no positivity in the house.\n\nWriting these things is very heavy, frankly I feel like crying. Writing them down makes them a little more real than in my head. I feel a lot of guilt in doing so.\n\nWe’re also on the point of trying for a baby. I’ve already told her I don’t wanna live in a sad house. I wanna live with joy, especially with kids. Sharing this to collect your thoughts - has anybody been here before? What did you do?\n\nThanks\n\nTL,DR;\nSuddenly thinking my wife is not the person I wanna be together for the rest of my life. Guidande?",
        "comments": [
            {
                "body": "One things for sure is put the baby making on hold until you figure this out. Don't bring a kid into a broken home. I think this is a fixable issue if she's truly willing to work on it.",
                "comment-author": "Bxsnia",
                "replies": [
                    {
                        "body": "Surely the kid is on hold. Gotta speak to her first ofc",
                        "comment-author": "Impossible-Self-8534",
                        "replies": []
                    }
                ]
            },
            {
                "body": "She obviously depressed about something, have you straight up asked her about it?  If not have you tried therapy?  I think based on your previous 7 to 8 years you should at least try to get her to open up.  Definitely do this before having a baby, she should be in a good mindset before that life change.",
                "comment-author": "Cranjesmcbasketball1",
                "replies": [
                    {
                        "body": "Completely agree. Introverted doesn't mean sullen and anxious. I'm very Introverted and I laugh all the time, there's a lot of joy in my life. \n\nOP, I think your wife needs help with her mental health. Medication could absolutely 180 this situation.",
                        "comment-author": "SpookyKitter",
                        "replies": []
                    },
                    {
                        "body": "Wtf with your comment? 🤨 Im also an inteovert and in not depressed... You should read about the personalities before make a judgement without any knowledge...",
                        "comment-author": "chameleon-369",
                        "replies": [
                            {
                                "body": "I'm an introvert too but my comment has nothing to do with the fact that she's introverted.  He stated she comes home everyday sad and it hasn't always been that way.",
                                "comment-author": "Cranjesmcbasketball1",
                                "replies": []
                            },
                            {
                                "body": "Did you ever read what OP wrote about his wife?",
                                "comment-author": "TrustyBobcat",
                                "replies": []
                            },
                            {
                                "body": "Being introverted doesn’t mean being sad everyday. The wife clearly is going through something that has nothing to do with being introverted.",
                                "comment-author": "turnpoopintowine",
                                "replies": []
                            },
                            {
                                "body": "OP said “she is always anxious, depressed, sullen.”",
                                "comment-author": "Worth_It_308",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "So, she’s depressed. Have a sit-down talk with her and express how you’re feeling and how it’s starting to seriously impact your relationship. Come from a place of concern and love. Talk to her about her seeking therapy, the potential for medication, and what you can both do to try and bring back her old self. \n\nMarriage is about working together through tough times. This is your opportunity to do so. Exhaust your options before deciding love has been lost.\n\nWhatever you do, keep up on birth control and make sure you do not bring a child into this until you’re both in a better place.",
                "comment-author": "chicolegume",
                "replies": [
                    {
                        "body": "You struck me here… I gotta exhaust all options before declaring love is lost. Thanks",
                        "comment-author": "Impossible-Self-8534",
                        "replies": [
                            {
                                "body": "Can I asked why you didn’t think depression could be an option? It sorta ticks all the boxes… not acting like herself, sad all the time… did you just think she was a difficult person ? Genuinely curious",
                                "comment-author": "turnpoopintowine",
                                "replies": [
                                    {
                                        "body": "She always has been the “sad” type let’s say. This is consistent with her personality. I even wrote it in the post - i was basically in autopilot with her “sadness” because I am so used to it. But ofc, to external eyes might be clear it’s something else.",
                                        "comment-author": "Impossible-Self-8534",
                                        "replies": [
                                            {
                                                "body": "Oh interesting because based on your post it has only been the way the past couple years over the course of your decade long relationship.\n\nEither way a good marriage probably is based on communication and if want to see if this is salvageable, you should probably talk to her and she why she is feeling the way she’s feeling or if she’s open to working on it. \n\nI think you are going to get some negative replies because your post kinda comes off like you’ve done nothing to try to connect with your wife on this and just want to throw in the towel… not saying that is how you feel but it does come off that way..\n\nI really hope whatever happens you both do what’s best for both of you! Good luck!",
                                                "comment-author": "turnpoopintowine",
                                                "replies": [
                                                    {
                                                        "body": "Thanks for your inputs on my post. English is not my first language and I wrote it quite rapidly. Hopefully people will try to relate like you did.",
                                                        "comment-author": "Impossible-Self-8534",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "body": "It does blow my mind a little that you even used the word \"depressed\" to describe her but didn't think of clinical depression--like, I literally thought that was what you meant, but apparently not.",
                                                "comment-author": "OkSecretary1231",
                                                "replies": [
                                                    {
                                                        "body": "In my first language, “depressed” is not always literal. More often than not it means “very sad” but not something related to mental health.",
                                                        "comment-author": "Impossible-Self-8534",
                                                        "replies": [
                                                            {
                                                                "body": "It's not always literal in mine either, *but*, it's also used in the medical sense enough that saying it would at least ping your brain and make you wonder if the person *was* literally depressed.",
                                                                "comment-author": "OkSecretary1231",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "body": "it may be that she \\*really\\* needs something but can't ask. Communication is sometimes hard, when big emotions are at stake... and that's why there are people we can go talk to about it. If you care about each other... try to tackle it head on rather than running away: you may well be very thankful later, and it shoudl deepen your relationship too, and capacity ascaring humans, whatever eventually happens.",
                                                "comment-author": "richardhod",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Yeah, you have been together 10 years. You can't just give up after having a realization. ",
                                "comment-author": "Catsrfurever",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Have you tried talking to her about it? Does she knows how you feel? Before making any sudden moves you need to try to figure out of this is fixable…",
                "comment-author": "Entire-Section2152",
                "replies": [
                    {
                        "body": "This. And also counselling for the two of you! She sounds like maybe she's depressed, and could also talk to someone about that",
                        "comment-author": "richardhod",
                        "replies": []
                    },
                    {
                        "body": "I get real \"I've tried nothing and I'm all out of ideas\" energy from this post. He talks about how she has kind of just coasted along for the past few years but it sounds like he has too. \n\nHis wife is responsible for dealing with her mental health, but he's her husband, he should have been pushing her to get help and supporting that this entire time. Instead it sounds like he's just sat back and watched her spiral.",
                        "comment-author": "Boomshrooom",
                        "replies": []
                    }
                ]
            },
            {
                "body": "You sound tired. Yeah living in sad home can make you feel drained but your wife seems to have more complexed issue than being an introverted. Because I know from myself. I am very introverted person and I have calm energy but I like to be around extroverts. However If I feel very depressed I withdrawl everything… unfortunately your wife seems to need some support. So if you really dont love her anymore that’s okay to seperate ways but if you are not sure it can be useful to look at the reason of the lack of motivation in your wife’s life",
                "comment-author": "OkIndependence305",
                "replies": [
                    {
                        "body": "Thanks dude. Yours is the only comment which tries to relate with me. I’m very tired. But I gotta go to the bottom of this I guess",
                        "comment-author": "Impossible-Self-8534",
                        "replies": [
                            {
                                "body": "Yeah, has she tried therapy or anything?  She needs to figure out the root of her unhappiness.  I’m an introvert.  So is my partner.  We both do go out a tiny bit, but we’re homebodies overall.  We aren’t sad or unhappy though!  ((I do have major depressive disorder, amongst other mental health issues.  I take meds and do therapy)).\n\nWe aren’t sad or unhappy just because we’re introverts.  My partner has had bouts of depression, I’ve had it lifelong.  We both manage ours so that we lead happy lives.  We’re just happier in than out.  We have hobbies, can do things on our own, or together.  We each have friends, chat with them, meet up with them a bit, etc.\n\nYour wife may need some external help (be it just therapy or meds or a combo of) to regain herself.  \n\nI def wouldn’t try for a baby (especially with how hormones can lead to depression, and post partum depression, anxiety, psychosis, etc can actually start prenatal!) until she’s seeing someone and feeling more like her old self and very comfortable opening up with someone if anything changes.  A baby makes every problem 10x worse, not better!",
                                "comment-author": "art_addict",
                                "replies": []
                            },
                            {
                                "body": "If you didn’t want to actually work for this relationship instead of trying nothing, why did you get married? I feel like you wrote this out looking for permission to leave your wife after not even *talking* to her about it.",
                                "comment-author": "Lulu_42",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "She sounds depressed. I think if you care about the marriage it's worth to try therapy.",
                "comment-author": "schecter_",
                "replies": [
                    {
                        "body": "Thanks. Didn’t think it could be depression. Will try to talk her",
                        "comment-author": "Impossible-Self-8534",
                        "replies": [
                            {
                                "body": "Agreed, she deserves a conversation, at the very least. And while it could be chemical depression, it could also be that sadness begets sadness. No friends or hobbies, doesn't do much of anything, etc., it could be that those behaviors and actions are leading to those outcomes. My BIL is with a woman like this, but they brought a kid into it - it sounds like you're grounded enough to not subject a child to that reality, but it's been my observation that this type of thing truly builds on itself. Though, depression is certainly a possibility - talk to her from a place of love and concern",
                                "comment-author": "abqkat",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Dude your wife is clearly having mental health issues. Get her in therapy, discuss meds with her doctor. Support her mental health first and foremost.",
                "comment-author": "thehotdogman",
                "replies": [
                    {
                        "body": "Yup, I've been that wife before. I've been in therapy for years but adding meds helped a lot. The fact that OPs wife says that he's the only good thing in her life and it appears he wants to leave... Well I feel for her because my spouse has never tried to dump me when I'm at my worst. That doesn't mean OPs feelings aren't valid, my spouse struggled a lot when I was struggling, it's hard when your partner isn't at their best, it can be very lonely, but if OP is feeling this shitty I can only imagine how his wife feels. \n\n\n\n\nPossible controversial opinion. I guess I could add that because of my mental health background I was able to reach out for help eventually vs someone not educated or perceptive might struggle and think that feeling horrible all the time is just normal. ",
                        "comment-author": "Scarlet-Witch",
                        "replies": []
                    },
                    {
                        "body": "Right. Thanks",
                        "comment-author": "Impossible-Self-8534",
                        "replies": []
                    }
                ]
            },
            {
                "body": "No offense man, I may be only 26 about to get married but you said “in sickness or in health” be the one that encourages her. Love is a choice not a feeling. Make her joyful by taking her out, surprise her, flirt with her again. Fall back in love with her by trying to woah her again.",
                "comment-author": "Awesomemike1600",
                "replies": []
            },
            {
                "body": "She’s depressed. Consider options such as medication, requiring her to do talk therapy, etc before throwing in the towel. Def no baby right now absolutely not. Hope things get better",
                "comment-author": "dispoable123",
                "replies": []
            },
            {
                "body": "First sentence says “stable” but proceeds to tell the complete opposite of it",
                "comment-author": "Clear-Trifle8862",
                "replies": [
                    {
                        "body": "Thanks for your valuable input",
                        "comment-author": "Impossible-Self-8534",
                        "replies": [
                            {
                                "body": "Of course now time to make it real stable. It shows who is/are the unstable one based on the story and how you narrated the story.",
                                "comment-author": "Clear-Trifle8862",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "My 2 cents worth..she might be depressed, but speaking from experience she sounds more exhausted and overwhelmed. It sounds like some where during \" living\" she started \"just existing\" \n\nFor me this happened when my husband and I bought our house, it meant making sacrifices to keep that house, it's meant working un fulfilling jobs and working endless hours to just pay a bill, it meant spending time together but none of it was quality time. I personally lost myself, I stopped having fun, I stopped going out because I was over worked and tired ALL the time. Then one day I said to my husband I could not remember the last time me and him laughed..a genuine laugh, one where we were hyper ventalating. I couldn't remember the last \"care free\" relaxing and fun day was. My life revolved around making sure the bills were paid and we were looked after. \n\nA few months ago I decided to go back to a career I loved, it meant working even more hours but they were hours I actually enjoyed. It also meant a little.extra money and that lifted some stress as well. I'm slowly finding myself again, and it has 100% improved my marriage\n\nYour wife sounds \"lost\" and sounds like she's just existing. Try talking to her and see if you can get any aspirations or goals or passions out of her. Stimulate her mentally and see if that can help her find her self again\n\nLove isn't lost, it's on a back burner tho, it can be saved!",
                "comment-author": "ticklemee2023",
                "replies": []
            },
            {
                "body": "“In sickness and in health.”\n\nLove is easy when things are going as expected, but life only gets harder as you age. You will both experience difficulties with work, physical health, finances and more. The true reward of a relationship is in working together through these challenges and finding someone you can completely trust. \n\nYour wife is depressed. She probably is so depressed that she can’t see a way out. But she confides in you and trusts you. You need to help her get therapy and assistance. Be the man your wife needs. ",
                "comment-author": "m1sch13v0us",
                "replies": []
            },
            {
                "body": "Jeez mate get her some help. You never know when the shoe will be on the other foot and I’m sure you hope she’ll be there for you rather than walk away.",
                "comment-author": "Major-Novel-7275",
                "replies": [
                    {
                        "body": "Thanks. She might be, a lot of ppl are saying this. I didn’t think it could, but I’m starting to believe it",
                        "comment-author": "Impossible-Self-8534",
                        "replies": [
                            {
                                "body": "All good. Reading your replies it seems you care about her and are genuinely a caring person. Sometimes it’s hard to see the obvious when you are so close to it and perhaps having to deal with it for the last 3 years may have led you to be a bit depressed as well. Seek out some help and take care of yourself as well.",
                                "comment-author": "Major-Novel-7275",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "To hell with those wedding vows I guess..",
                "comment-author": "ThrowRAboredinAZ77",
                "replies": [
                    {
                        "body": "Care expanding?",
                        "comment-author": "Impossible-Self-8534",
                        "replies": [
                            {
                                "body": "It’s clear that your wife is struggling. I sincerely doubt she is sad and introverted to punish you or to make you unhappy. It sounds like she is depressed or has another mental health issue. A good spouse who cares about the other spouse communicates and cares and is worried. You come across as callous and incredibly selfish. This is a marriage, not a fling. You made vows with this person.",
                                "comment-author": "steviethered",
                                "replies": [
                                    {
                                        "body": "She is. I’m sorry if I’m coming across as “incredibly selfish” - in the last years caring for her is basically all I did. Supported her through everything. I’m just feeling tired and started having doubts about my emotions. How is this selfish? Isn’t this human? I’m seeking guidance, asking for it, not judgement.",
                                        "comment-author": "Impossible-Self-8534",
                                        "replies": [
                                            {
                                                "body": "Have you talked to her about her mental health? Would you do this if she had a physical illness? Try having a conversation with her. Use the words therapy and depression and express that you are worried about her. Give her real time to get help and to make positive changes. And if she doesn’t change and she refuses to get help, then talk about ending the marriage.",
                                                "comment-author": "steviethered",
                                                "replies": [
                                                    {
                                                        "body": "Thanks. I’ve tried talking about this to her a couple times, clearly not strong enough I guess. Your suggestion is a good approach.",
                                                        "comment-author": "Impossible-Self-8534",
                                                        "replies": [
                                                            {
                                                                "body": "I know it can be really difficult to live with someone and take care of someone who has mental health problems, particularly if they are not actively seeking treatment or trying to get the appropriate help. I would try to sit her down and say very seriously that you are worried about her and that you can see her struggling. Say that you think she needs help and that you will help her get into therapy. Be clear that you don't want to live this sort of a life and that you will leave if she doesn't take it seriously. Please give her the chance and the time to get help and to change.",
                                                                "comment-author": "steviethered",
                                                                "replies": [
                                                                    {
                                                                        "body": "Will do. Thanks for your guidance",
                                                                        "comment-author": "Impossible-Self-8534",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "body": "Do you know if she has been like this her entire life?  Did you not see this when dating your wife?  How has she responded when you have tried to engage her about this?",
                                                                "comment-author": "Original-King-1408",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "body": "Sooo you only wanted to support her a little bit? Not too much though? That was a condition for marriage?\n\nWhat do you mean by \"support\" her? Was it literally just like, listening to her talk? Comforting and cuddling her? Maybe had to drag her out of the house a few times to go out? Because if so damn dude that's the bare minimum.",
                                                "comment-author": "sky_lites",
                                                "replies": []
                                            },
                                            {
                                                "body": "What kind of \"caring for\" are we talking about? I've noticed a lot of caregiver language getting thrown around lately for situations where someone's just not satisfied in a relationship, and I think it kind of muddles the language for when we need to talk about people who are literally performing round-the-clock medical care for their partners and wiping asses, kwim?",
                                                "comment-author": "OkSecretary1231",
                                                "replies": [
                                                    {
                                                        "body": "I know and I’m sorry if I’ve offended you, I’m clearly struggling with the form I’m giving to my words tonight.\n\nCaring means, for the last years, I tried to support her through everything - cheering, motivating, listening, consoling, etc.",
                                                        "comment-author": "Impossible-Self-8534",
                                                        "replies": [
                                                            {
                                                                "body": "Some degree of this is just part of being in a relationship, though ideally it's mutual and each of you helps the other through your rough patches. If her depression is treated, then she might be more able to reciprocate.",
                                                                "comment-author": "OkSecretary1231",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "body": "sounds like your having some caretaker burnout.  I know from experience",
                                                "comment-author": "Downtown-Swimming-47",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "body": "How is it callous & incredibly selfish to finally realise that he’s been emotionally drained by her for years while being the supportive “good spouse” & that meant his own happiness wasn’t even considered?\n\nThis is something he can tell her to give her a chance to stop using him as her emotional punchbag & address her issues for her(his) own well-being.\n\nI’ll give him grace for feeling the sudden loss of love but based on the post & all he’s done for her during the relationship I don’t think that’s what he’s actually feeling. I’d guess he’s experiencing a rush of sadness after realising the reality of the situation & what it says about himself, his wife & their relationship.",
                                        "comment-author": "djjmar92",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "You don't love your wife anymore because she struggles with her mental health. My comment was pretty damn straight forward. Remember vowing \"In sickness and in health\"?",
                                "comment-author": "ThrowRAboredinAZ77",
                                "replies": [
                                    {
                                        "body": "Does she love him or has he just been her emotional punch bag for years?\n\nHe clearly has loved & supported her for years without realising how emotionally drained he is. It’s completely normal that after realising & acknowledging that to have a strong emotional response.\n\nHe might perceive that as a sudden loss of love but it’s more likely to be his own sadness about himself & his wife hitting home after his perception of their life was shattered.",
                                        "comment-author": "djjmar92",
                                        "replies": [
                                            {
                                                "body": "As I previously stated, I guess his wedding vows don't mean that much to him.",
                                                "comment-author": "ThrowRAboredinAZ77",
                                                "replies": [
                                                    {
                                                        "body": "They mean more to him than his wife from the info we have & given what we know this sudden change in feelings about the relationship after realising the negative impact it’s had on him is normal. \n\nHe hasn’t filed for divorce or abandoned her.\n\nHe’s coming to terms with his shattered reality  & judging by his comments realises that it’s not good to continue being her emotional punchbag so is looking at professional help for her and their marriage.",
                                                        "comment-author": "djjmar92",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "OP, don’t listen to that person. They are almost certainly in a miserable marriage themselves, not strong enough to leave, thus they lash out at other people who consider that an option. It would make no sense of whatsoever to stay with somebody for life that you’re not in love with, just because you said some words one day in a church. That’s mythical nonsense.",
                                "comment-author": "Radiant_Bank_77879",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "She needs help. I mean professional help. But only she can tell herself what she needs. \nYou seem drained by being around her. It makes sense, depression or anxiety or whatever she has can definitely impact the people around her. I think you need some personal time for yourself away from her. You need to also feel supported to support her(if you want to keep supporting her). \nAnd if not it’s okay to not want to live the rest of your life and create a family with someone who you can’t see a future with. \nIf she’s changed or maybe you have or both of you it’s okay to grow up and leave. You guys aren’t at the same space anymore that’s all there is to it.",
                "comment-author": "sadbeyondrelief",
                "replies": []
            },
            {
                "body": "Love is a verb not a noun. It happens when you wake up every morning and say “I’m going to love this person “",
                "comment-author": "handydannotdan",
                "replies": []
            },
            {
                "body": "I agree that she sounds depressed, and of course needs support and likely to find a counselor. But, it is also hard to be the caretaker all the time. I went through a long stretch of really deep depression and sometimes I felt anger towards my partner because he seemed distant and sometimes held me at arms length. But now that I'm healthier, I am able to look at it through a different lens. I was a lot to deal with and he had no one to support him, or fill his cup. There was no room for him to have a bad day. I was not able to be supportive. So I feel for you. I do think it's worth talking to her about it, try to get to the root of what's going on, and get her help. But it's okay to feel tired. It's valid to feel sad and like the love has dimmed on your end because she's not filling your cup. If she's  completely depleted herself, she's probably not able to be good partner. Not on purpose, but when you're really down in the depths emotionally, you can't support yourself, let alone someone else. Do you have anyone to talk to? Being a constant caretaker takes a toll and not having the moments of joy and connection with your partner erodes your relationship. You need to make sure you're keeping yourself resourced as well, so maybe you should seek a counselor for her and for you. You're not a bad person for feeling this way. \n\nWhat do you think has changed for her in the last 3 years that has pushed her into the depression she's seemingly in now?",
                "comment-author": "Mc_Tater",
                "replies": [
                    {
                        "body": "Thank you so much for this comment. Reddit can be harsh - especially when English is not your first language and you don’t fully voice yourself like you would like to.\n\nThanks for your kind words. I know I gotta talk to her about this - I’ve already tried a couple times.\n\nI guess work is what’s changed. She constantly complains about work. I already told her to quit, we can live with my salary alone, but that’s simply no way she will. But work is depleting her",
                        "comment-author": "Impossible-Self-8534",
                        "replies": [
                            {
                                "body": "Yeah, I was reading through the comments thinking that a lot of commenters were being really unfair to you. You are seeking support and advice- and just because you are the 'strong' partner doesn't mean you are in the wrong. It isn't your wife's fault that she is depressed, but at a certain point something has to give. As the mentally unwell party, it is painful to hear that your depression is having a negative impact on your partner and your relationship. It can feel really unfair of them to add to your stress (speaking from experience) but it takes a lot of strength and courage from the 'well' partner to bring it up. No one wants to add to the burden. But ultimately, it did help push me to find a solution for myself because my partner basically told me that he loved me but couldn't live like that forever. Did it hurt? Yes. Did I initially feel a bit betrayed? Yes. But I'm actually really glad that he did because I didn't want to lose him or keep hurting him, and I also didn't want to live like that anymore. My job was the worst of it for me as well. For me, it was scary to leave even though I was miserable because the unknown is terrifying and the idea of being well wa so foreign, it didn't seem like it was possible. And even though I knew my job was killing me, I was also scared that if I left and I still felt that bad, where would that leave me? At least I could hold onto the hope that things could get better. But if I changed the last thing that I thought might be the problem, and it turned out that I was just broken, I thought I would have to just end everything instead. I'm really lucky that I have been able to find a stable and wonderful job that I love. But it did also take me time and effort to rewire my brain to stop being so negative. Is she willing to do the work emotionally to get better? Maybe simply quitting isn't the solution for her but finding a new job, and trying to discover some hobbies that she enjoys. My partner and I kind to get eachother experiences for birthdays, Christmas and anniversary- perhaps some sort of art or sport class might be good for her to try? Or for you to do together? Do you do things together for fun? Go on vacations or weekend trips ever? Date nights?\n\nWhat really helped my partner and I was after having about a week of long, difficult conversations about our relationship, what was working, what wasn't working, what we wanted, and a lot of unresolved issues that had piled up over the years, we went to a spa for a weekend- it was a splurge but worth it. It was sort of like a reset for our relationship. What we didn't realize was that we hadn't done anything like that in a long time. We were in a routine and a rut, and we had not been tending to our connection. And it is really important so do those things. But I recommend having the hard chats first. We dragged out all the skeletons, had a good cry, talked about the good things and why we wanted to keep trying and to be together.",
                                "comment-author": "Mc_Tater",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "it’s okay to feel this way. having a baby won’t make things better either, some people think that having a baby gives them purpose or will completely positively change their lives. this isn’t always true. if she is struggling with basic things, motherhood will\nbe a big challenge. she is struggling deeply with mental health. you don’t want to grow to resent her either. writing things down can help us with understanding what we really feel. your thoughts and feelings are valid. not all relationships will last. people break up after 5, 10, 25 years etc., and that’s okay. if you think you can turn things around, try and help her. life is short. you have to think about you and your health & happiness.",
                "comment-author": "kaileya2407",
                "replies": []
            },
            {
                "body": "Did she get on BC when you got married?  That can cause depression.  You don’t have to continue if this affects you and your health, but if it can be resolved maybe she can get back to herself.  \n\n\nIn general, I wouldn’t say at 29-30 develops depression for no reason. It usually happens before this age.  But onset of depression can happen for various reasons.  She needs to see a functional med doctor, determine what brought this on.  Ask her if she knows why or recognizes this change herself.\n\nYou deserve to be happy!  Definitely, don’t stay if there’s no resolution or if she’s not willing.  But I’d suggest trying to figure it out together first, before giving up.\n\nI’m sorry you’ve been struggling with this.  2-3 yrs is a long time!  And you can’t be her only reason for living.  Each partner has a responsibility to the other to address their own needs.",
                "comment-author": "Adorable-Drag-5225",
                "replies": [
                    {
                        "body": "This is fitting: https://youtu.be/YIz1L6nZ80c?si=nMl0PAU0IDNYK6jk",
                        "comment-author": "Adorable-Drag-5225",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Love isn’t a feeling. It’s a decision.",
                "comment-author": "Sovereign_NW",
                "replies": []
            },
            {
                "body": "Hi OP. 31F but single AF here. First - I’m sorry for what you’re experiencing. It isn’t easy living in a home where you feel the weight of so much is on your shoulders. But please please please - please don’t leave your wife. She sounds wonderful, but that there is something in her life that is significantly weighing her down. Please considering the following:\n\n\\- What did your living arrangements look like before you go married? Is she struggling to live with another person? Does she feel at home in her space? Did you two move away from an area that she was comfortable living in? Does she have her own space in your home?\n\n\\- Does she exercise? Coming from personal experience - If she is struggling with body image or not simply moving enough (less endorphins), that is like taking a non-stop express train to Depressionville. Take her on a little walk and pick her a flower :)\n\n\\- What does she do for work? For me personally, my work environment has drained the life, happiness, and soul out of me in the past. Does she feel like she has purpose in her work? \n\n\\- Are you two intimate? Frequently? If so, are you prioritizing her? Or are you just concerned with how you feel (respectfully)? \n\n\\- What is her love language? Spoil her with it! If it’s physical touch, hug her likes she‘s a forking Costco-sized Squishmallow. \n\n\\- Have you continued dating? Do you set time aside each week where it’s just the two of you spending time growing your relationship? Do you do any romantic gestures towards her (get her her favorite flowers, etc.)? \n\n\\- What hobbies was she interested in? What things does she like? It means so much when a partner can take interest in your interests. What does she do for HER? \n\n  \nShe may be struggling with any or all of these things but want to keep her struggles to herself as to not push you away. From what you described, it sounds like she’s just a shell of what she was - she has no community, no personal interests, etc. It’s hard to be there for others when you can’t even be there for yourself. As hard as it is for you, you are the best and most consistent thing in her life. BUT - you are her husband, and you signed up for this, to stick by her side no matter what. She is your plant - water her, support her, help her grow. Look up the story of Brad Pitt and Angelina Jolie and the concept of \"get her pink back\".",
                "comment-author": "Chuck_the_Duck_17",
                "replies": [
                    {
                        "body": "Thanks for your comment.\n\n•\t⁠yea we were living together even before getting married. That’s not the issue I guess\n\n•\t⁠she does not! But she always complains about her body as well. In general, she has no hobbies or things letting her outside\n\n•\t⁠we are intimate. I would say on average once a week. I always, always “care of her” first\n\n•\t⁠she’s a doctor. This is a good part of this because I guess she identifies with her job and can’t just “reskill” herself and restart, and her work is probably draining her\n\n•\t⁠we do date and go out together, we do. We always had and have. These however have become a little escape from reality, the routine is always the same",
                        "comment-author": "Impossible-Self-8534",
                        "replies": []
                    }
                ]
            },
            {
                "body": "The fact that you're afraid you don't love her means you care enough to be fearful of that. The love is still there, but maybe the spark just isn't? But... in sickness and in health. Like other commenters said, talk to her and tell her you're concerned and want her to feel happiness so you can live a happy life together. Support her in what she needs, and don't take it personal if she is offended at first by the idea of therapy. This seems to weigh on you a lot, OP. Take care of yourself too.",
                "comment-author": "peytonc718",
                "replies": []
            },
            {
                "body": "See if she will speak to a doctor about her mental health issues. You can’t fix her. \n\nMy ex seemed to enjoy wallowing in self pity with me trying to “fix” things. Almost like he enjoyed the attention. His mother was much the same\n\nWhen I did get him to take meds he stopped bc he felt fine. Ofc he went downhill quickly. CBT for narcissism - he just charmed the therapist and fed her what he thought she wanted to hear. \n\nMy point is he got much worse overtime and took his frustration out on me. And yes just like his behaviour is modelled from his mother. One of our adult children has all his mental health issues. The other has relationship issues due to our role modelling. \n\nDo not have children if your marriage is  floundering. My ex wore a mask till we got married and it fell right off once the babies came.",
                "comment-author": "Kryptonite-Rose",
                "replies": []
            },
            {
                "body": "I’ve been in a relationship for a while now not married, but long enough to have faced some serious challenges. I can actually relate to your situation, but from the other side. There was a time when I was the one relying too much on my boyfriend, expecting him to fill all the gaps where I wasn’t loving myself. It took us almost breaking up for me to realize what I was doing. He felt drained, like he was carrying the weight of my happiness, and it got to the point where he started losing feelings. Hearing that from him was a huge wake up call.\n\nSo, I took a step back and did a lot of self-reflection. I started pushing myself to find hobbies, make friends, and build a life that wasn’t just centered around him. It wasn’t easy at first, those new friends didn’t feel like “real” friends, and I still had to work on feeling okay on my own. But over time, it helped. The spark came back between us. Things aren’t perfect, but they’re better.\n\nIt sounds like you’re feeling really burnt out right now, and I get it. It’s exhausting to feel like you’re the only one holding up the relationship. If you’re carrying the emotional weight alone, it’s not sustainable. I’d suggest having a calm, honest conversation with her not out of frustration, but out of genuine concern for both of you. Let her know where you’re at emotionally and how this dynamic is affecting you.\n\nSometimes, taking some space can be a good thing for her to rediscover who she is outside the relationship and for you to see if those feelings can reignite. You might feel like you’ve lost the love you once had, but that doesn’t mean it’s gone for good. Relationships take work, but it’s got to be mutual.",
                "comment-author": "Throw-RA22",
                "replies": [
                    {
                        "body": "Thank you for your comment and words, I’m happy you took the time to understand and trying to relate. This is actually so true - you used words I’m thinking myself: “carrying the weight of her/our happiness”.\n\nThanks. Gotta speak with her",
                        "comment-author": "Impossible-Self-8534",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Please do not have a child with her if you’re thinking this way. Coming from experience with the same thing, it will not end well.",
                "comment-author": "Dense_Reply_4766",
                "replies": []
            },
            {
                "body": "She sounds incredibly depressed. Have you done anything to help her? Ask about the root of it? Suggested therapy?",
                "comment-author": "Evie_St_Clair",
                "replies": []
            },
            {
                "body": "First of all, your wife needs a good therapist. She needs someone to talk to about her worries problems anxieties etc. It's okay to vent to your partner sometimes but daily and constant negativity would be hard for anyone to take everyday. \n\nSecond, you need to communicate. Explain to your wife how heavy this is for you. She's relying on you for emotional regulation. Tell her that you need a break from this. You need emotional support too. She needs to see someone and figure out why she emotionally shut down. You're not her therapist.\n\nThird, I get why you're ready to throw in the towel because you're mentally exhausted, but at least address the issue openly, and give her an opportunity to fix it. It sounds like you've been picking up the slack and doing all the work without complaining for years and she has no clue you feel this way. \n\nThe title of your post says that you don't love your wife anymore. If that's the case, even if she does fix what's bothering you, it wouldn't matter, right? I think you need to decide that before you provide false hope, too.",
                "comment-author": "BlindfoldedRN",
                "replies": []
            },
            {
                "body": "Immediately stop anything you Fe doing towards having a baby. Do not have a baby with someone you are in the process of falling out of love with. \n\nHave you talked to her about how you feel? Maybe there are also some changes that she would like to make.",
                "comment-author": "FrankaGrimes",
                "replies": []
            },
            {
                "body": "It sounds like the idea of having a child is possibly pushing you to be more aware of the issues that you guys have. Once you bring a life into the world, you will be tied to her forever. It’s much more serious than marriage. \n\nFor a child, growing up in a house without Love and stability would probably be painful too. \n\nI think you should show your wife what you’ve written here. Sit her down and lay this all out for her. Give her the opportunity to work with you and work on herself. You’ve married her and promised to stand by her. I think you owe her honesty and vulnerability here. \n\nI don’t think your relationship is doomed here. I think there’s a real shot at happiness for you both if you can be completely honest with her about your feelings, and if she’s willing to meet you there and grow together.",
                "comment-author": "FreyaDay",
                "replies": []
            },
            {
                "body": "Well you should probably get the bottom of the depression first, then see how to solve it. But also it’s not a good thing for her to solely rely on you for fulfillment. She needs to cultivate a life outside the marriage which can fill up her cup. Because now she’s always coming to you with an empty and you always have to pour into hers which is draining. But the situation is salvageable ",
                "comment-author": "Alternative_Pie8641",
                "replies": []
            },
            {
                "body": "Your wife is struggling. She may not even realise something is wrong. Try talking with her. Take the time to talk through issues on both sides first. I will note she may be defensive at first if this has been going on a while and become the new ‘normal’. Through sickness and in health. Let her lean on you and just keep swimming. Marriage isn’t always happy and joyful. Life takes its toll on people.",
                "comment-author": "St3rix",
                "replies": []
            },
            {
                "body": "You're perfectly entitled to put yourself first. \n\nIf she is willing to try and help herself, then there might be something worth saving. Lay out the brutal truth to her as you have done here and ask if she is willing to work on changing things.\n\nShe needs to try and address each area you've outlined.\n\nMake it specific with a time limit and review points.\n\nShe has to be willing to fight for the marriage.\n\nBut of course this could just be who she is and you've only just realised your deep incompatibility. That's fine. It's like sexual incompatibilities - change is rare.\n\nIf she won't or can't change then you have your answer.",
                "comment-author": "TheBurningQuill",
                "replies": []
            },
            {
                "body": "She needs help. Perhaps she needs space to work on herself. Encourage her to join a course on something she is interested in, do a workout class or something like that. Where she can meet people and make some friends. Until she starts fighting these feelings and putting herself out in the world she will be stuck in this rut. If she is unhappy she needs to start adressing the issue and change something. You can't be her only source of happiness. Thats just too much pressure. ",
                "comment-author": "Bouncycorners",
                "replies": []
            },
            {
                "body": "This is sad, certainly we could use more mental health awareness in this world. She sounds depressed, it could be a number of things including work stresses, physical health (hormones issues, side effects of contraceptives etc) or a partner who has seen her decline and hasn't even tried to give her a safe avenue to talk through it. When you're in a dark space, you need people to reach out and that's no reflection on how she sees you because it's just difficult to see and think right when depressed .  a professional can help her work through this and she will need your understanding and support through this too. When you got married you must have sworn some kind of oath to be there for each other in sickness and in health so try remember that. It might not actually be for you now that a problem has come, a lot of people will default to prioritizing themselves and leave their partner. I don't think you're selfish or anything, you just sound clueless and lacking the skills to deal with this, as likely you haven't been through it or had to support someone in the past",
                "comment-author": "NegotiationWeak1004",
                "replies": []
            },
            {
                "body": "I completely understand your position. It’s only natural to want a partner who has their own life, and hobbies. It’s so attractive when my partner is super ambitious and they work hard for it. You need positive energy in your life there’s already too much depressing bullshit everywhere in the world. If you have someone constantly lifting you up while thriving themselves, life can feel like a movie. I’ve dated some wonderful women, and I’ve been guilty of having a 2-3 month dead weight phase with my ex, where she told me to get my shit together and I didn’t. At the time I was offended and hurt but now I see what she meant. Everything’s so easy when your partner is like that. If she’s willing to get help and actually try to fix her issues i can sympathise. But you need to be selfish in life we ain’t got a lot of time buddy.",
                "comment-author": "fridaexxx",
                "replies": [
                    {
                        "body": "Thanks",
                        "comment-author": "Impossible-Self-8534",
                        "replies": []
                    }
                ]
            },
            {
                "body": "It feels like I’m reading my own story..",
                "comment-author": "usernamefoundnot",
                "replies": []
            },
            {
                "body": "She needs you more than ever now. I think it's time to ask her how are you and how can I support you.",
                "comment-author": "Electronic_Pop_9535",
                "replies": []
            },
            {
                "body": "A man and woman can't be everything to each other. Most likely, she has severe chronic depression, and needs to be treated by a psychiatrist who can recommend a treatment plan. A depressed mother and depleted father can be devastating for children who often become parentified on these type families. On the flip side, you may be attracted to damsels in distress because you have a deep desire to be needed. I suggest therapy for you as well. I think your wife is sick. Before leaving the marriage, I would try to see a psychiatrist...not just a therapist. It seems like you've already began to discuss with her that you don't want a sad house. Carrying her emotions and yours is too high a burden. We're you parentified as a child or made a caretaker in some way? You may need to unpack that as well.",
                "comment-author": "Lady_Tiffknee",
                "replies": []
            },
            {
                "body": "You should get couples counseling first. It sounds she is depressed rather than you being incompatible or there being big issues. You made vows for better or worse when you married didn’t you? This is now her worse and don’t just shock her and leave. She might never recover ",
                "comment-author": "Live_Angle4621",
                "replies": []
            },
            {
                "body": "OP, you are alone with how you're feeling. It sounds like she is stuck and in need of counseling ASAP. People don't realize how heavy of a burden it is when someone relies on you to be their sole ecosystem of conversation, support, entertainment, etc.\n\n Does she sound much different than the woman you married? Sure. Should you withdraw your love because she may be suffering from mental health issues? That's questionable lol. \n\nYou got married and shared vows for a reason. It's obvious she's in a mental space that she cannot escape on her own so it's your duty to at least TRY to help her to get professional help. Dealing with mental illness is not easy at all but you would really feel worse if you created a full exit/divorce plan without trying harder to get her help. \n\nIf you need help finding a local or telehealth therapist then send me a private message. And as others have said ......do NOT even dream of bringing a child into this equation.",
                "comment-author": "Keem773",
                "replies": []
            },
            {
                "body": "Your wife is struggling. And you come across as rude and unsupportive. One does not tell their depressed spouse that you “don’t want to live in a sad house.” Statements like that add to her depression and anxiety. Yes, your wife needs therapy and maybe medication. You also need therapy to determine why you are unable to be a supportive spouse. Get your head out of your behind and encourage her to seek help but not by guilting her with ultimatums.",
                "comment-author": "Expensive-Door85",
                "replies": []
            },
            {
                "body": "Your wife needs help. \n\nShe needs to see a doctor. \n\nHelp her.",
                "comment-author": "StrawberryKiss2559",
                "replies": []
            },
            {
                "body": "Reverse the roles in ur head. If u came home tired, uninterested and bothered.. what would you want her to do? This is part of marriage",
                "comment-author": "Katekrr",
                "replies": []
            },
            {
                "body": "Marriage isn’t just a commitment it’s a covenant with God.  It’s til death do us part for a reason.  After 7 years, you knew who you were marrying. You promised to support her in front of God.  My husband was on dialysis for 4 years and life was hard but I would never in a million years leave him while he was struggling.  He’s now had a kidney transplant and I’ve never been more in love with him.   If I had bailed when it was hard I would have missed out on an amazing marriage.  Please, keep your promise to your wife and to God.  Support her and help her through this.  It truly may just bring you two closer in the end.",
                "comment-author": "CherryBlossomLady",
                "replies": []
            },
            {
                "body": "I feel like crying reading this too. I’m so sorry. You sound like you are suffocating and your wife sounds like she is depressed. Since she is saying you are the only positive thing she has , it weighs on you even more but at the same time that statement is very sad to me… and it’s probably why you are losing interest in her… she is too dependent on you. This is very heavy…",
                "comment-author": "InfiniteToki",
                "replies": [
                    {
                        "body": "Very! Thank you for being understanding and trying to relate.",
                        "comment-author": "Impossible-Self-8534",
                        "replies": []
                    }
                ]
            },
            {
                "body": "If you're with the wrong person, falling out of love is actually a great GIFT.",
                "comment-author": "OctoberLibra1",
                "replies": []
            },
            {
                "body": "Leave her and you have no kids. Its just dies not work as you said and if you feel it in your guts, then its the right thing.",
                "comment-author": "Benji_81",
                "replies": []
            }
        ]
    },
    {
        "title": "31m and 26F. F hit me and lied about pregnancy when drunk.",
        "post-author": "Possible_Orchid_2842",
        "text": "Hey everyone\n\nI’m looking to get a few things off my chest and get an outsiders perspective . This girl I was dating and had a genuine connection with really surprised me with something that I can’t get out of my head. Originally the story starts when I saw a dating app on her phone after she told me it was deleted, things proceeded to a little bit of an awkward time, but I was not angry or yelling,  I was just questioning it, of course. This is also two days before my birthday when we were on a trip. the next day we returned to our cities and later that night, we decided to meet for a drink to celebrate my birthday.\n\nHere comes the big part. Almost immediately after singing happy birthday, she looked at me and told me that she was pregnant. She was quite drunk… so for the next few hours, we were taking care of her and went home. Eventually, she asked me to stay the night, which I would have anyway, anyways, considering the news. I remember saying I need to go to the bathroom and come back, and what followed was a couple punches to the face, slamming the door on my hands/face and many insults. At this point, I waited with one of her roommate for her to fall asleep and I ended up staying beside her.\n\nFast-forward to the next day, when I was asking if she will get another test done, then things like that, she had no recollection of what she told me. Only after a little bit, she included and said “ did I tell you I was pregnant?”. She ended up taking a test and showing me it was negative, but I just can’t understand this at all.\n\nLastly, for context, this is one week before I was moving to a different city. We were about to do long distance relationship as that was the last week together. fast-forward to now, we just broke up a few days before she was supposed to come see me and I booked all the flights and everything. \n\nTL;DR. She ended it now and that’s why she didn’t want to come, but I guess my question is, why did it have to get to that point and has anyone else had an experience like that? I don’t know why I didn’t break up after that.\n\nI will appreciate any advice or comments!",
        "comments": [
            {
                "body": "F sounds like a manipulator, I’m sorry this happened to you OP. \n\nIf there are still injuries present you may want to photograph them, this person deserves to be in prison but it is completely your decision to make a case against her. Best of luck in your future endeavours.",
                "comment-author": "Fitz_Yeet",
                "replies": [
                    {
                        "body": "Luckily, there was nothing that bad and I was able to defend myself in a way where I did not hit or raise a hand back. I was just walking away myself and blocking the hits. I think her living with the fact she lied about a pregnancy and hit me should be enough but then again I also wouldn’t doubt it if she just won’t really think about that.",
                        "comment-author": "Possible_Orchid_2842",
                        "replies": []
                    }
                ]
            },
            {
                "body": "She is awful and she did you a favor. Sounds like a personality disorder.  Surely this can’t be the first time her behavior was erratic?",
                "comment-author": "madscientist2025",
                "replies": [
                    {
                        "body": "No, there was a couple other times where things just didn’t make sense or contradicted what I thought. I realize I wasn’t perfect but I didn’t deserve a reaction like that. These were definitely the biggest ones though.",
                        "comment-author": "Possible_Orchid_2842",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Sweetheart, you don’t deserve to be treated that way. You are worth being respected with love and loyalty in return. This girl is toxic, I would suggest you stop having sex immediately and please reconsider your relationship. She does not respect you or love you, she is emotionally unstable and abusive.\n\n\nThese types of relationships are a slippery slope because it becomes a trauma bond situation full of toxic back and forth “love” and you become addicted to it. Don’t go there. Recognize her for what she is, don’t wear your heart on your sleeve and treat her like a lost helpless puppy. She can grow up and get herself extensive therapy. Leave before you become even more traumatized.",
                "comment-author": "xo-moth",
                "replies": [
                    {
                        "body": "I guess that’s the hard thing to accept that Maybe she didn’t care so much but she also just seems like a cold person at times on general… when she would say I love you and want to be with you forever, things like that it did make me feel like it was genuine. \n\nWe’re absolutely not together anymore and blocked on everything so I doubt any more contact. I ended up saying all these things and how bad they were at the end. She got really offended and even messaged My dad telling him I was insulting her and things like that I guess in a way I was but I was simply saying the facts of what happened",
                        "comment-author": "Possible_Orchid_2842",
                        "replies": [
                            {
                                "body": "Oh I misunderstood! Omg sorry. I ran to the comments to tell you to break up bc it’s such a concerning situation. I’m super tired and just got worried about you lol\n\n\nIm so glad you’re away from her. I bet you learned a lot from that relationship… it’s easy to get stuck in that toxic on/off loop. People mistake their toxic relationships for passionate love or are simply trapped with no way out. Wishing you the best 💜",
                                "comment-author": "xo-moth",
                                "replies": [
                                    {
                                        "body": "Thanks so much! No worries at all. It was very concerning and I guess I let it slide because the day I left our city and we were starting long distance, she came to the airport and was the last person I saw.. so leaving with that good memory kind of blurred the things that happened only a week before… I think I also let it slide due to the fact she was drunk….but people keep saying if she hits you once it’s only a matter of time until it would’ve happened over something else",
                                        "comment-author": "Possible_Orchid_2842",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Domestic violence can be woman against man. It's just not reported as often and some women think they can slap, punch and abuse men with impunity and the moment he so much as raises a hand to protect himself he's the abuser. \n\nYou have had a lucky escape. Nobody goes into a relationship expecting violence, and sometimes it's hard to escape once it hits that point. You were able to see her for who she truly was and was able to end it without much complication. I would make sure you let everyone know your side of the story though. I have no doubt she'll spin it to make you the bad guy and that kind of reputation follows you everywhere.",
                "comment-author": "Adelucas",
                "replies": []
            },
            {
                "body": "It helps to remember that 7% of women suffer from severe mental disorders. That’s not to suggest that every woman is crazy - far from it - but that there are enough of them that you will experience one during your dating history. \n\nAs someone who dated a woman with Histrionic Personality Disorder and tortured himself trying to apply reason to the situation before a therapist explained it to me, some times there is nothing you can do. Some people are mentally off, despite presenting as normal most of the time. \n\nBest you can do is to look at what attracted you to her, adjust anything and just move on. ",
                "comment-author": "m1sch13v0us",
                "replies": [
                    {
                        "body": "Yeah, I think that’s the tough thing because everything happened at the end so I did feel genuine things and care and good conversations, etc. however, at the end, like you said, the lying, emotional and physical abuse, whether they’re drunk or not shows a capacity to do things that I personally couldn’t see myself doing",
                        "comment-author": "Possible_Orchid_2842",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Yeah, I’d end things as soon as someone hit me and find a way to document the abuse, then would have waited for a paternity test. The pregnancy lie, would also have been a point to end things. \nIn my opinion, Long distance relationships can only really work with an actual foundation of a happy marriage and children and a home with solid times of return or relocation. I honestly don’t know why people would try them out without all those things being in order. Every person I’ve known to be in one had them end. It’s wise to end things before moving, and I’d advise my own kin the same I’d advise you: don’t do them unless you have to maintain a strongly established legal relationship, and then only if there is a set deadline. If you move choose the path that you know meets your long term goals, end relationships that won’t move with you.",
                "comment-author": "Azrael530",
                "replies": []
            }
        ]
    },
    {
        "title": "Concerned that my (30F) sister (33f) may have some kind of serious mental illness, how to help her/convince her to see a psychiatrist when my parents are enabling her?",
        "post-author": "Time_Cheetah685",
        "text": "Over the past several years, since about 2019, my sister has been having strange behavior that could be symptoms of something like bipolar disorder or BPD.\n\nSome background, she had been living with my parents since Covid, who had been coddling her pretty hard. They gave her a job at their company, bought her a car, let her live there rent free. The way they coddled her was a bad idea and I told them that, she would have random screaming outbursts at my parents and would face no consequences for them, she even yelled at their employees at work and faced no punishment, she's basically been living like a bratty teen.\n\nLast summer she decided to move to my city to do a masters program, even though she hadn't finished her last masters program, my parents paid for this new program, and continued to let her work remotely for their company. I told them that while she needed to disentangle herself from them that this was a bad idea, I live in a very expensive trendy city in another country with my partner and we moved here for my partner's job, but we plan to leave in a year or 2.\n\nCurrently she's living in a crappy illegal studio in a bad part of town, she has no source of income beyond my parents company, but my parent's company hasn't been doing well since the recent economic downturn, and they may need to retire sooner than expected.\n\nYesterday I met up with her and she was behaving kinda manically, she said she feels like she's \"finally home\" in this city, that she feels a deep connection with the culture here, and that she's going to buy an apartment here. She's lived here for less than a year and doesn't speak the language, she doesn't have a work visa (she's still on a student visa) or the means to acquire one, and as far as I'm aware doesn't have much savings. Both me and my partner found her behavior concerning.\n\nHowever this problem is further confounded by my parents, when she brought up the apartment thing, they tried to convince me and my partner to buy an apartment with her. I told them that 1. We aren't looking to buy. 2. Any property we (me and my partner) buy would be for us to raise a family in. 3. My sister has no money and they can't afford to just buy her an apartment in an expensive city.\n\nI have told my parents that I think she has mental problems and needs to see a mental health professional, they agree but then they keep enabling her and don't encourage her to see one. I'm worried that one day my parents are going to die and she's going to end up homeless or be my responsibility. \n\nPotential symptoms she's had include: \n\n* Being paranoid that people are \"after\" our family and \"targeting us\".\n* getting extremely angry like switch has flipped, during these angry fits screaming and breaking things. One time she almost (intentionally maybe?) crashed the car while we were in it while she was in one of these fits.\n* Saying things that are simply not true, like that our father wasn't present during our childhood, our dad was a stay at home dad when we were little and was our main caretaker until highschool.\n* Poor impulse control, she has a big spending problem, like buying 200 dollars worth of cheap clothes on a whim type deal.\n* Grandiose thinking, this is a big one. She told us that she wants to turn my grandma's old house into a music studio? She's not a musician or a producer, I told her that she should first learn music production then and she flips out and tells me that I'm stifling her dreams. She has also frequently said things like \"I need to get rich so that I can save the world\". She often develops random non-nonsensical business ideas, one time she bought hundreds of keychains convinced that she was start a business selling them, these weren't collector items or anything, she didn't make them, they were just random cute keychains she bought, this seems to be tied to the poor impulse control.\n* She goes through almost delusional obsessions with certain lifestyles. Right now that obsession is focused on the city I live in and living a \"city girl life\". For awhile when she was living with my parents she was like this about cottagecore stuff and was convinced that she was going to buy a farm and live \"off the grid\".\n\nTLDR: My sister may have a mental illness and my parents behavior may be enabling it. Recently my sister has moved to my city/country on a whim and this has sort of made her my responsibility. \n\n  \n\n\n",
        "comments": [
            {
                "body": "If I don't reply it's because this is a throwaway and I got locked out, but I appreciate and advice you guys can give.",
                "comment-author": "Time_Cheetah685",
                "replies": []
            },
            {
                "body": "Can I ask first if you want to be there for her during this journey? It seems like you kinda have two choices if she herself won’t see the problems she is causing… You can keep fighting for someone who doesn’t see that she needs help (and trust me she probably doesn’t see herself in that way and thus therapy wouldn’t be as helpful or as big of a “fix”) or you part ways and set better boundaries and not be around her if she is a trigger for you.",
                "comment-author": "cherryblossombloomed",
                "replies": [
                    {
                        "body": "I don't want to cut her off all together, because for whatever reason I'm the person she listens to the most (as much as she listens to anyone). But she is also an emotional drain I'm not going to lie.\n\nAt the same time I think I'm coming to realize that I can't really help her unless she's willing to seek help.\n\nBut I'm scared she's going to crash and burn hard one day and end up homeless or something.",
                        "comment-author": "Time_Cheetah685",
                        "replies": [
                            {
                                "body": "Her choices are not yours, she will make those choices no matter what you tell her or what she truly believes. \n\nIt sounds like she’s just plain scared, covid did a number on everyone in ways that we won’t even realise until it’s studied - it more than likely is already. \n\nOnly thing you can do at this point is set clear markers with her - “I’m not going to continue have a conversation with you about XYZ because it is unhelpful to both of us. If you’d like to talk about other things like the weather or how your studies are progressing - please do that.” \n\nMake it very clear to her that her warped perception of reality is not your own, you won’t entertain it and you will stop responding when she goes deep. \n\nIt may end up that you stop responding and no longer reach out to her at all - your parents are still alive and have to do the heavy lifting here, not you. You have an entire life to live, this is not your burden to contend with.",
                                "comment-author": "hashtagsugary",
                                "replies": [
                                    {
                                        "body": "She also had a horrible relationship in 2019 and I think that did something to her tbh, and then Covid right after that didn't help.\n\nI guess maintaining contact but refusing to engaging in her delusional or harmful behavior and maintaining some distance is the best I can do in the current situation.",
                                        "comment-author": "Time_Cheetah685",
                                        "replies": [
                                            {
                                                "body": "That’s all you got at this point - you left a lot of details out with a bad relationship leading into a pandemic.",
                                                "comment-author": "hashtagsugary",
                                                "replies": [
                                                    {
                                                        "body": "Yeah wanted to write more, but the post was already very long as it was.",
                                                        "comment-author": "Time_Cheetah685",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "She sounds a lot like my sister (diagnosed bipolar - fast cycling). The challenge is that even with a diagnosis not much changed tbh. She still lies, manipulates and has now told her psychiatrist she is not bipolar, but Autistic and therefore the meds aren't needed. \nIm only sharing this because I spent my 20s going to therapy to learn how to handle her, my relationship with her, etc. But recently (like 3 months ago) I started working on boundaries with a new therapist and I've found it really helpful. Plus, if you model the desired behaviour maybe she'll go - probably not but who knows.",
                                "comment-author": "singlepringle32",
                                "replies": [
                                    {
                                        "body": "It's funny you say that, last year my sister went through a phase where she was convinced she was autistic, she said that she feels like she's \"masking' all the time and \"faking it\".\n\nBut I think it's much more likely that she lacks a stable sense of self which makes her feel like she's \"faking it\".\n\nI have no idea if bipolar disorder is what she has but it's not autism that much is clear.\n\nMaybe me seeing a therapist about all this would be best.",
                                        "comment-author": "Time_Cheetah685",
                                        "replies": [
                                            {
                                                "body": "Set Boundaries, Find Peace: A Guide to Reclaiming Yourself by Nedra Glover Tawwab has been very insightful for me. My therapist and I are working through the exercises. \nI appreciate your thought on the lack of a stable sense of self - I feel like that hits for my sister too (I hadnt been able to put it into words).",
                                                "comment-author": "singlepringle32",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "If she tried to crash the car you were in also, on purpose, you should have grounds to have her sectioned against her will, for being a danger to herself and others around her. That way she will be fully evaluated and should actually get the help she needs. That's what I would do, if someone I was close with tried to kill me during an episode, anyway. ",
                "comment-author": "Aimeebernadette",
                "replies": [
                    {
                        "body": "The problem is that:\n\n1. Now she's in another country (the country I've been living in but not the country we are from.) This is one of the reasons I was so against her coming here, now she's not in the healthcare system, and is basically at risk of falling between the cracks of society.\n\n2. My parents would never back me up on that, they are extremely permissive and would never try to get her evaluated against her will.\n\nAs far as her intentions I do think that she wanted to crash the car, but not that she wanted to kill us if that makes sense. In those moments of extreme anger her mind is not working correctly, it's almost like she's possessed to use a metaphor.",
                        "comment-author": "Time_Cheetah685",
                        "replies": [
                            {
                                "body": "That still means she is a danger to herself and others, though. I'm guessing the country you're both in is one without socialised medicine? \n\n\nI don't really know how else to help, to be honest. If you can't get her sectioned and she won't get help herself - you may just need to let her hit rock bottom and hope she survives it, then it will be dealt with from there, whether she likes it or not. Sometimes the kindest thing we can do is let people learn from their own mistakes. She's ill and she deserves help - I feel bad - but it sounds like there's nothing you can do.",
                                "comment-author": "Aimeebernadette",
                                "replies": [
                                    {
                                        "body": "Nope, no public healthcare in our home country, and she's too old to be a dependent of our parents.\n\nThere is socialized medicine here, but she never applied for her national ID after getting her student visa so she would not have access to it. Even then foreign students don't receive the same medical access as local tax payers do.\n\nApplying for the national ID is a pain in the ass here, so I offered to help her when she first moved here but she refused. Now her student visa is about to end and she has no plan as to what to do next, if she had gotten the ID she could have applied for a 1 year residency extension but that ship has sailed...\n\nThis is also why I found her idea of moving here to be delusional, she has no plan after September and I'm worried she'll try to stay illegally.\n\nMy partner also said at this point she needs to hit rock bottom to see the problems she's created for herself, but my parents may not let her. If she gets deported they'll just let her live in their house again rent free.",
                                        "comment-author": "Time_Cheetah685",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "There is nothing you can do to stop your parents from enabling her, or that she needs help, unfortunately. Maybe you can tell them you think she's on drugs (possibly true) and that will motivate them, but ultimately everyone involved here is an adult you can't fix.  \n\nYou're going to need to realize asap that you're not your sister's keeper. What she does with her life is not your problem to solve.",
                "comment-author": "Blue-Phoenix23",
                "replies": [
                    {
                        "body": "Tbh she was smoking weed and doing psychedelics in their house too, so unless she's doing hard drugs I don't know if they would stop enabling her, even then I don't know. \n\nBut yeah, that's the answer I keep coming back to, that I can't do anything to change this situation as it stands.",
                        "comment-author": "Time_Cheetah685",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Girl, I think she's just using a little bit. Those 'symptoms' are all consistent w/drug use as well.",
                "comment-author": "TapeFlip187",
                "replies": [
                    {
                        "body": "She does smoke a lot of weed, idk she'd have to have found a new dealer pretty quickly here in my city if she's using something else.",
                        "comment-author": "Time_Cheetah685",
                        "replies": [
                            {
                                "body": "Eh. You don't really have to meet someone, you kind of just need to know where to be. It's a pretty universal language and scene, in my experience..",
                                "comment-author": "TapeFlip187",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "title": "Title: Feeling exhausted in my relationship with my addicted boyfriend, need advice.",
        "post-author": "MaleficentExtreme696",
        "text": "I (26F) have been dating my boyfriend (28M) for a year. He has an addiction problem and although he is currently seeking help, he keeps relapsing almost daily. On top of that, he takes on debts to buy drugs and struggles to pay them back, which often leaves me having to cover for him. I’m emotionally and financially drained.\n\nI had hope that he would change since he started getting help, but nothing seems to be working. I still care for him deeply and want to support him, but I feel stuck. Part of me wants to leave because I can’t take it anymore, but the other part feels guilty and afraid he won’t make it without me.\n\nI really need advice from anyone who has been in a similar situation or knows how to cope with this.\n\nTL;DR:\nBeen with my boyfriend (28M) for a year, he has a drug addiction, keeps relapsing, and taking debts that I end up paying. I’m exhausted and feel like I can’t do this anymore but feel guilty to leave him while he’s struggling. Need advice.",
        "comments": [
            {
                "body": "You should focus on your own life.  You can't do that if you're with this guy.",
                "comment-author": "laffy4444",
                "replies": []
            },
            {
                "body": "It's a slippery slope between supporting and enabling. You need to do what's best for you, and to me, it sounds like that would be leaving this emotionally draining situation, and that does not make you a bad person. \n\nHe may try to guilt you, but he needs to get his shit together before he is capable of being a good partner to anyone. All he's going to do while in active addiction is bring you down and use you, because that's what addicts do; nothing matters more than the addiction.",
                "comment-author": "shyblonde83",
                "replies": []
            },
            {
                "body": "You can’t save him. He can only save himself. He is the only one who can make that decision and necessary changes. \n\nYou need to focus on yourself and what’s best for you.",
                "comment-author": "Putrid-Cupcake-1547",
                "replies": []
            },
            {
                "body": "You’re doing yourself a huge disservice if you remain with this guy. Ask anyone who had to date or standby an addicted partner and you’d understand that it hardly ever gets better. Do yourself a favor and break free. Your exit out of his life may be that final push he needs, or maybe not. Either ways, choose yourself first, always! You’re 26, meet more people and live more fgs. ",
                "comment-author": "honeyedbuttercup",
                "replies": []
            },
            {
                "body": "You have to remember that dating is an audition, not a life sentence \n\nHe’s failed his audition. He’s not a stable or healthy partner \n\nYou need to leave asap ",
                "comment-author": "Low-Agency2539",
                "replies": []
            },
            {
                "body": "You leaving him may help him to get the help he needs as you are enabling him. You will lose a lot if you stay. Save his life and yours, leave now.",
                "comment-author": "elissellen",
                "replies": []
            }
        ]
    },
    {
        "title": "my boyfriend follows over thousands of girls on tiktok",
        "post-author": "maria59172978",
        "text": "F/18. my boyfriend M/20 follows over 8000 girls in tiktok. We have dated over a year and he keeps following new ones all the time. I have brought it up once before, like half a year ago. Back then it was 10000 girls! He said he didn’t understand why it mattered, and he wouldn’t care if I did the same. He basically shut down and didn’t want to talk about it. Later he privated his following list. And unfollowed a bunch I guess. But I have noticed that he following goes up a bunch in just a few days at a time. And I know it’s more girls. \n\nI notice this must sound super insecure and obsessive. But I just don’t understand why he does this. It wasn’t explicit models or anything. Just a bunch of regular, non influencer pretty girls. \nIt makes me feel unwanted and sad. I know I should bring it up to him again, but I don’t know if I will get a response\n\nTL;DR: do you have any advice about how to bring up the problem that my boyfriend follows a bunch of random girls on TikTok?",
        "comments": [
            {
                "body": "You're 18 just date someone who doesn't need to spend their free time staring at women online.",
                "comment-author": "ThaSaxDerp",
                "replies": [
                    {
                        "body": "Yeah, like, just date someone who is focused in studies or whathever else",
                        "comment-author": "TheBrasilianCapybara",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I don’t think there is much you can do about it. He’s made it clear that he doesn’t care about your feelings. \nFrankly it’s really creepy that he’s following thousands of random girls. He must be spending a huge chunk of time looking them up. \nAre you sure you want to stay with someone like that?",
                "comment-author": "Paindepiceaubeurre",
                "replies": [
                    {
                        "body": "Well there is something she can do about it. Break up with him!",
                        "comment-author": "Hairy-Commercial-307",
                        "replies": [
                            {
                                "body": "Yes I agree, I meant she can’t make him stop. It’s up to her to decide if she wants to put up with that.",
                                "comment-author": "Paindepiceaubeurre",
                                "replies": []
                            },
                            {
                                "body": "I probably should, but it’s really hard for me. He’s my first boyfriend and I wish he just could act right. I just don’t understand the need for him to lust after other women.",
                                "comment-author": "maria59172978",
                                "replies": [
                                    {
                                        "body": "And you never will.\n\nListen. You can't fix a man.\nYou can't fix anyone.\n\nYou can motivate people to change but they have to be willing to do the work themselves.\nYou've pointed out the issues.\nYou've asked him to change.\n\nHe hasn't.\n\nYou're not in deep enough to do it again.\nYou're not attached to this man at all. Not financially, not with kids, and barely with emotional investment.\n\nCut your losses. Break up with him",
                                        "comment-author": "ThaSaxDerp",
                                        "replies": [
                                            {
                                                "body": "I mean it's the same with her really\n\nShe seems insecure.",
                                                "comment-author": "pythonpower12",
                                                "replies": [
                                                    {
                                                        "body": "There's levels to \"he follows women content creators\" and \"he is following thousands of women who just post thirst traps\"\n\nPlease be for fucking real.",
                                                        "comment-author": "ThaSaxDerp",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "body": "This is the first lesson of dating. You can't date who you wish someone would be. You have to decide if the person they are right now is right for you.",
                                        "comment-author": "sweadle",
                                        "replies": []
                                    },
                                    {
                                        "body": "Why do you want to put up with that behaviour? He’s your first boyfriend. Not your last. \nYou don’t have to be with someone who doesn’t respect you.",
                                        "comment-author": "Paindepiceaubeurre",
                                        "replies": []
                                    },
                                    {
                                        "body": "He's 20. Lust is a main feature at that age. \n\n\nEven if you had sex multiple times a day, every day, he'd still probably follow those women. \n\n\nBetter than actually pursuing all those women though, right?",
                                        "comment-author": "jarrai8000",
                                        "replies": [
                                            {
                                                "body": "maybe true for him, but there are plenty of better guys out there that OP could find instead. leave him with his own problems.",
                                                "comment-author": "shinykaci",
                                                "replies": [
                                                    {
                                                        "body": "I think I am confused. Is the issue here that the bf looks at other women, or that he looks at them while with the op?",
                                                        "comment-author": "jarrai8000",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "......How much time does he spend on there that would necessitate following that many people at all, much less  all these women? Bro's got problems, and not just the blatant disrespect toward his gf. \n\nHes obvs not going to stop. So you have to decide whether you want to be with someone who (constantly, apparently) looks at other women for gratification, or if its an issue you feel fine living with. Because you cannot make him stop. \n\nYou're very young, you have no reason to stay with this guy, and if this is a deal breaker issue then you need to leave and not waste more of your time on him.",
                "comment-author": "Rivvien",
                "replies": []
            },
            {
                "body": "My ex literally did the exact same thing on instagrams and Tik tok. He followed over a thousand girls and non of them even followed him back. \n\nI cried to him so many times to unfollow them and he said he would. He’d remove like 20 and then I’d calm down a bit. Then he’d stop unfollowing them completely until I brought it up again. \n\nI told him I’d break up with him if he didn’t unfollow them and he “bought an app” that let him unfollow them easily. \n\nI felt so disrespected and I felt like I wasn’t good enough for him. \n\nAnyways, it never stopped and I found out in the end that he was sleeping with other women since the beginning of our relationship. \n\nThat’s my story… do with it what you will.",
                "comment-author": "MILFinurhood",
                "replies": []
            },
            {
                "body": "As you grow older dear you will find such traits so unattractive that it won’t make you sad or bothered anymore - you’ll just accept that someone who has eyes for everyone and fills their feed with people to watch and not useful or interesting / funny etc content is an ick to you and you want better than that. \nDon’t fight it, just accept this is who he is. Do you want to be with someone like this or not?",
                "comment-author": "smallf4iry",
                "replies": []
            },
            {
                "body": "He says he wouldn’t care if you followed other men because he knows you won’t. It’s purely hypothetical. He can act callously without consequence because why wouldn’t he? He gets to follow thirst traps AND has a steady girlfriend. \n\nI broke up with my ex for following OF models and liking their pictures. It was so refreshing not worrying what a grown man was doing on social media. I’m now dating a man who only follows Star Trek meme pages and videos of cute dogs. \n\nYour boyfriend isn’t taking you into consideration. He does not care if you feel insecure. He doesn’t deserve a girlfriend.",
                "comment-author": "brielarstan",
                "replies": []
            },
            {
                "body": "You're 18. There's lots of much better men out there.",
                "comment-author": "UpbeatInsurance5358",
                "replies": []
            },
            {
                "body": "That's just his normal one. You should see what he follows on the secret one.",
                "comment-author": "the_ghetto_cowboy",
                "replies": []
            },
            {
                "body": "Could be porn addiction.",
                "comment-author": "anthologyvirgin",
                "replies": []
            },
            {
                "body": "The only reason to bring up incompatible values is when you're breaking up. You're not going to change his mind on this. He's only going to placate you or pretend he's stopped and just make another account to do what he wants. People don't change. You have to decide if this relationship is worth the feelings he's making you feel. You're still very, very young. You dont have to settle for someone who doesn't respect you.",
                "comment-author": "Yuri909",
                "replies": []
            },
            {
                "body": "I mean, you could find another boyfriend who has much more productive and interesting ways to spend his time.   This one's a dud and there's nothing wrong with you.     He's not going to care what you say, because a guy who cared wouldn't act like this in the first place. \n\nI wouldn't even bring it up, I'd just text him and tell him it's not working out, we're breaking up.",
                "comment-author": "Peregrinebullet",
                "replies": [
                    {
                        "body": "Yup, it's just embarrassing, isn't it? Such a waste of time (let alone the super creepiness of it). Like dude, get a hobby.",
                        "comment-author": "halfhoursonearth_",
                        "replies": []
                    }
                ]
            },
            {
                "body": "It has nothing to do with insecurity and more to do with respect. I doubt he would be okay with you doing the same...",
                "comment-author": "----AbRaKaDaBrA----",
                "replies": []
            },
            {
                "body": "Following that many girls is suspect and weird but besides that, how does he treat you?",
                "comment-author": "LaterOrSooner",
                "replies": [
                    {
                        "body": "Our relationship is good in general, but I certainly do not feel like his number one priority",
                        "comment-author": "maria59172978",
                        "replies": [
                            {
                                "body": "You are not his priority. Move on.",
                                "comment-author": "anonuserbrowser",
                                "replies": []
                            },
                            {
                                "body": "That's because he's busy competing in the gooner world champs. The man sounds like a porn addict. \n\nI'm a man who has been through a 'phase' but not near that extent, can't even imagine how much time he's spending watching that and the effect it has in his brain switching through all those women/girls.  It's very easy to fall into online especially with the way the algorithms work but he has to take some responsibility and also treat you with the respect you deserve.\n\nAt 18, I'm not sure if you're that invested in him that you'd wanna help him through that and to be honest it's something he needs to work on himself and overcome. Find yourself a man who has productive hobbies. Basically every guy that age will be looking online at points but not to this extent. You should also take a moment to consider what your boundaries are about your partner in this respect.",
                                "comment-author": "NegotiationWeak1004",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "This isn’t the kind of man you want to be with. don’t wait til you’ve wasted the best years of your life to realize it. It seems like a small thing but it speaks to a much louder character defect that is simply not husband material. Don’t bother",
                "comment-author": "dipss88",
                "replies": []
            },
            {
                "body": "Please don't feel bad about yourself - most women would be grossed out by their partner having like 5% of the amount of girls he is following. It sounds like he has some kind of problem or addiction, it's super creepy to me - it's likely he is reacting and responding to their videos too. You can do better, I promise.",
                "comment-author": "halfhoursonearth_",
                "replies": []
            },
            {
                "body": "Been there done that but it was all pornstars or\nGirls that show off a lot, never be with someone that won’t change. They see it as u being insecure but it’s a respect thing. Such a turn off when ur man lust over females that aren’t you. Dump him, he doesn’t care.",
                "comment-author": "Girlsclub12",
                "replies": []
            },
            {
                "body": "If you break up with him now I promise that within a year you'll feel so much better. He's making you feel like youre in constant competition and it isn't insecure of you to have a problem with this. There are plenty of men who don't lust like that. If you continue this relationship it will never change and even if this specific problem gets fixed it will most likely bleed into other areas of your life. Staring at women in public, etc.",
                "comment-author": "Jaded_Place1184",
                "replies": []
            },
            {
                "body": "Holy shit, what does he do for work? This is super unhinged and compulsive. The time it would take to follow that many people is insane, and if he even browsed the first few pics on each profile that’s a lot of fucking time and focus. What a disturbing dedication to have. It’s not you. He’s probably just packing in as much dopamine as the gaping void within him will allow.",
                "comment-author": "LoRiMyErS",
                "replies": [
                    {
                        "body": "he has the kind of job where he travels away and works a few weeks, and has a few weeks of. it seems like he does this at nights at work. Doesn’t even seem like it takes a lot of time for him lol. The following numbers goes up in a few minutes.",
                        "comment-author": "maria59172978",
                        "replies": []
                    }
                ]
            },
            {
                "body": "That’s really creepy of him. To be honest, if this were me I’d be way too icked out and embarrassed to be the girlfriend of a guy putting all that out there to the public.",
                "comment-author": "BudgetInteraction811",
                "replies": []
            },
            {
                "body": "If you ever have to beg a man to do anything that can be considered basic respect, LEAVE. He will not change for you. The type of person this is likely isn’t one that will ever make you happy. But there ARE men out there who will and so much more. You should not have to lower yourself to begging and crying to be respected as a partner.\nBest of luck to you.",
                "comment-author": "SnooWoofers3032",
                "replies": []
            },
            {
                "body": "8000. Wow. That’s a lot. You don’t need to beg for his undivided attention. He’s too preoccupied with the socials. Strangers are more interesting to him. He’s not prioritizing you, your concerns or your relationship. Let him be online all the time if that’s what makes him happy. Don’t stay though. His focus is not you and him. Maybe he’s not really interested in monogamy but hasn’t quite figured it out or how to have a conversation about it. He said he wouldn’t care if you follow thousands of men so……. \nI’ve followed a mixed bag of people online but the person standing in front of me is my main focus. I follow for the content. If he’s just in it for the aesthetics, you’re not his person versus a placeholder while he continues to look through the online catalog. Maybe I’m wrong 🤷🏻‍♀️",
                "comment-author": "CaneLola143",
                "replies": []
            },
            {
                "body": "Dated someone like this. Dont waste your time, he doesn't care about your feelings, and you will continue to feel bad about yourself because of it. You have your whole life to find someone who isn't a disgusting creep.",
                "comment-author": "Sure_Examination3076",
                "replies": []
            },
            {
                "body": "This is a 🚩because men like that will definitely cheat on you eventually. Leave him while you’re still young enough to find someone else.",
                "comment-author": "style-addict",
                "replies": []
            },
            {
                "body": "honey you’re so young. just break up. don’t waste your youth on a man with no self control.",
                "comment-author": "exploratorycouple2",
                "replies": []
            },
            {
                "body": "Now imagine how worried you'll be if your boyfriend followed thousands of guys on TikTok...I",
                "comment-author": "YourFavouriteJosh",
                "replies": [
                    {
                        "body": "Idk man some of us arent homophobic",
                        "comment-author": "Rivvien",
                        "replies": []
                    }
                ]
            },
            {
                "body": "This is classic one…I think they do it mostly subconsciously to feel safe. Like keeping their options open, so they idealize other women That’s why it doesn’t matter the girls don’t follow him back but if they follow him back it’ll feed his ego",
                "comment-author": "OkIndependence305",
                "replies": []
            },
            {
                "body": "that makes you a convenience for him until he finds the one and only",
                "comment-author": "whatchagonadot",
                "replies": []
            },
            {
                "body": "You don’t need to force yourself to accept this, & not every young man does this bs. If you need to leave then leave. He seems like he has an addiction to it.",
                "comment-author": "leedleedletara",
                "replies": []
            },
            {
                "body": "This is bizarre and reeks of some kind of addiction",
                "comment-author": "Substantial_Chest395",
                "replies": []
            },
            {
                "body": "i had an ex like that (the description fits a lot) and it didnt end well, especially if he’s shutting down during these discussions and also privatising his following list. It shows he knows, but doesn’t want to stop and would rather keep doing it even if you don’t like it.",
                "comment-author": "L3AHMANIC",
                "replies": []
            },
            {
                "body": "From what I read let this guy know it's either you or them the many or the unique no in-between",
                "comment-author": "Good-Nobody-5200",
                "replies": []
            },
            {
                "body": "Ahhh..so young, this seems to be a pretty common point of stress for your age group. You have two ways to see this situation:\n\n1. You spoke to him about it, you're insecure about it, he doesn't care to make any changes to his social media 'hot girl's' addiction. So you literally have no choice but to leave him and eventually find a guy that's not obsessed with following half naked women. \n\n2. IF he's actually treating you good in real life and you two are happy together then stop worrying about who he's following online since it has no effect on real life. You might be stressing yourself out by trying to keep track of his following count.....so stop.\n\nPick a perspective and commit to it.",
                "comment-author": "Keem773",
                "replies": []
            },
            {
                "body": "I follow more women than men forsure. I’d say if you truly do not trust your gut feeling to RUN RUN RUN.",
                "comment-author": "pyerre1995",
                "replies": []
            },
            {
                "body": "Red flags! He's doesn't give a shit about your feelings. So disrespectful and that's way too many. I just wouldn't give my time to a tik tok loser.\n\nMove on. He's showing you who he is. Don't stay and give a green light. Prioritise your self respect.",
                "comment-author": "Confident_Weather403",
                "replies": []
            },
            {
                "body": "A man can’t have hobbies? Let him goon",
                "comment-author": "Illustrious-Swim5657",
                "replies": [
                    {
                        "body": "“My 18 year old boyfriend likes boobs”",
                        "comment-author": "Supalox",
                        "replies": [
                            {
                                "body": "10000 girls is absolutely bonkers though. Definitely don’t bring a UV light into his room…",
                                "comment-author": "Illustrious-Swim5657",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "The type of man who only values getting women and lust is not the type of man the majority of women want to end up with. Very shallow.",
                        "comment-author": "SnooWoofers3032",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I wouldn't be in a relationship with someone who uses tiktok in general",
                "comment-author": "JazzlikeTrick88",
                "replies": []
            },
            {
                "body": "So? You are psycho if you think you can control who someone follows.",
                "comment-author": "Supalox",
                "replies": []
            },
            {
                "body": "I would end it, personally.",
                "comment-author": "Ud0ntkn0wMebtch",
                "replies": []
            },
            {
                "body": "That’s gotta be a new record",
                "comment-author": "awesometim1",
                "replies": []
            },
            {
                "body": "this is not insecurity its disrespect and he’s pathetic and immature you’re still young find someone else",
                "comment-author": "Pure-Professor2050",
                "replies": []
            },
            {
                "body": "How many boys do you follow?",
                "comment-author": "JohnSmithCANDo",
                "replies": []
            },
            {
                "body": "Undateable. There’s men out there who don’t even have social media . Those guys are keepers. For real.",
                "comment-author": "Muted-Singer-7974",
                "replies": []
            }
        ]
    },
    {
        "title": "My gf says I drain her energy (F30) (F26)",
        "post-author": "Interesting_Card719",
        "text": "Hi all, \n\nLong story short, my gf and I have been dating for two and a half years. She is 30 and im 26. We have never had a “good time” in our relationship. In the beginning stages, I was still living with my homophobic family and in nursing school, I let her know it would not be easy and school is a priority, she agreed. However our relationship became so strained she asked me to move in, once I decided to tell my parents and move in, she said she would be scared to cheat on me and wanted to be honest. So we broke up This has happened three times, each time we got back together, i would get incredibly anxious she would do it again I would start fights and need to figure out if she would leave me again. each time we broke up, she would date someone new in a week. I have a huge abandonment wound from this and each time she asked for me back, I would hound her with questions, ask every other second if she loved me, and would accuse her of leaving me again. It caused so many fights. \n\nMost recently we have been together and it’s been nothing but fights since December. I feel awful she broke last month and said she feels like a shell of a human, I told her we can still work past this. My brother just recently got diagnosed with cancer, so naturally I feel emotionally vulnerable, yet she has still stayed. It completely wiped away the past of her leaving me when I needed her most. But is now saying I drain her energy, she has no good memories to hold onto, and she wants to break up but has not officially decided yet and waiting to see if the feeling goes away. \n\nI feel the root of the problem was needing to know she would not abandon me again like previous times and she does truly care. I now know she does, how can I reverse it and not drain her energy. I love her more than anything and the pain of the past definitely took a toll on us. \n\nTLDR: my gf says I drain her energy but we just had a break through that broke the toxic cycle. How can we repair ? ",
        "comments": [
            {
                "body": "Girl, why are you in this relationship, if it can even be called that.",
                "comment-author": "MakarOvni",
                "replies": [
                    {
                        "body": "We loved each other when it wasn’t easy. She has been great in so many ways. But after the first time she left me, I couldn’t figure out if she would abandon me and cause so many fights while she took the hit. It broke her and I feel awful :(",
                        "comment-author": "Interesting_Card719",
                        "replies": [
                            {
                                "body": "She doesn't love you. That's not the behavior of a loving person. Find someone that is good to you.",
                                "comment-author": "MakarOvni",
                                "replies": []
                            },
                            {
                                "body": "You two just seem incredibly incompatible. My girlfriend makes my heart swell and refreshes me. I feel so happy and full of love when I see her. And it's been 4 years of living together. Yes we have fights. But we work through everything and make changes. \nThis isn't the one for you. You deserve someone who makes you feel like you built the sun in your toolshed just for them.",
                                "comment-author": "LordOfStopSigns",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Sounds like neither of you really like each other, that’s not enough for a relationship",
                "comment-author": "Perfect-Day-3431",
                "replies": [
                    {
                        "body": "I love her, I left my family (for myself) but also to be with her. She wasn’t patient enough she says. So she left and dated someone new and that would put her first. It made me resentful when she came back. But since we have gotten back she’s been perfect and I wasn’t fully healed and pushed her away. But now that she’s here when it isn’t easy, I know she loves me.",
                        "comment-author": "Interesting_Card719",
                        "replies": [
                            {
                                "body": "Well, if that's the case, give her some time. If there is no improvement, you know what to do. It will hurt, but it will be better than long suffering.",
                                "comment-author": "Sergio_82",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You might need to get away from each other, permanently.\n\nSometimes you can't salvage a relationship, yours is a match that's been lit 7 times, you just need a new match.\n\nI wouldn't say this if this didn't seem so impossible.\n\nYou just don't work together, when you're with somebody, it's because you want to have more good times together, not having \"any\" means that you shouldn't have been together to begin with, of course you're draining her if she needs to reiterate that she loves you 24/7 and you need her to reassure you all the time because you just don't trust her.\n\nYou're talking about it like it's a life long relationship, but this much drama 2 years in is way, way too much.\n\nAnd I'm not placing the blame on you, her saying that she's afraid she's gonna cheat is very bleak.\n\nI would try to truly separate and block, you need to be alone for a while, not because you don't deserve love, but because you need to see that this isn't what you need.\n\nThat's it for me, hope the best for you.",
                "comment-author": "Shaolan91",
                "replies": [
                    {
                        "body": "It was two years of nursing school and the timing not being right. Not this time, it was needing to trust her again. I want to cut the noise and just make it right. It feels impossible but I know it could work if I never argued again and love her right.",
                        "comment-author": "Interesting_Card719",
                        "replies": []
                    }
                ]
            },
            {
                "body": "You’re tripping. Figure your shit out before even trying to be with someone.",
                "comment-author": "No-Elk1466",
                "replies": [
                    {
                        "body": "But I am getting therapy and doing whatever I can to be with her. I love her with my entire being, i just felt so hurt by the break ups and rebounds, and also saying she felt tempted to cheat at a point.",
                        "comment-author": "Interesting_Card719",
                        "replies": [
                            {
                                "body": "Then you should leave. She’s not good with herself either. It sucks but both of you are not in a place where y’all can love each other let alone love yourselves. Sometimes the love you think you feel isn’t love but attachment that came from going through hardships together or just wanting to feel loved and cared for that you didn’t get from family/friends. You will continue to hurt each other even if not done on purpose",
                                "comment-author": "No-Elk1466",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Your gf sounds extremely hurtful towards you and disrespectful of your need for emotional security in the relationship.\n\nWhile every relationship has its ups and downs, your gf is telling you things like I want to break up but haven't decided yet.\n\nYour gf is playing on your anxious attachment style with their own avoidant attachment style.\n\nYou haven't really broken that toxic cycle since you're here posting about how clearly you're concerned about the future of the relationship, when all you're looking for is safety and security in the relationship.\n\nIt's okay to love someone but still not be compatible. You need something that your gf just hasn't been able to provide - stability, security and commitment.\n\nWe've heard what your GF doesn't like about your relationship, but are you getting what you need?",
                "comment-author": "dkopi",
                "replies": [
                    {
                        "body": "I have tried to explain to her our attachment styles and how we can make it work through healthy communication. Sadly I think I broke her down too much with accusations she would leave me again. I was getting everything I needed from her, but I couldn’t shake how she left me without a home several times, so now that my brother has cancer and she’s still here just distant, I want to make it work more than anything",
                        "comment-author": "Interesting_Card719",
                        "replies": [
                            {
                                "body": "Have you explained to yourself how your attachment styles work?\n\nIt sounds like you're being very accepting of your gf being cold, distant, and unsopportive. You're also somewhat skipping over things that sound extremely material- would someone who truly loves you and cares for you leave you homeless?\nAre you blaming yourself for that (or maybe have been gaslit to blame yourself).\n\nThink about the relationship you want and deserve. Is that the relationship you're getting? If not, it's okay for you too to reevaluate the relationship, and focus on how you build yourself in to a stable place where you aren't emotionally or financially dependant on someone who might not be dependable enough for you",
                                "comment-author": "dkopi",
                                "replies": [
                                    {
                                        "body": "To be honest when she asked me to leave my parents and move in with her, I packed up and moved everything, naturally sad I left my family, she is a CEO and said my energy / fighting was draining her. I also exaggerated how much money I had, so she thought it would be easy for me to find a new place quickly. But either or, when I needed her emotional support esp after leaving. Family, she left me hanging and dated someone a week later. We took 6 months apart, she asked for me back and I couldn’t shake the past or the girls she was with until recently. So yes it was so toxic, but im ready to let go of the past and love her without hesitation. Esp w her being here when it’s not easy w my brother.",
                                        "comment-author": "Interesting_Card719",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Trauma bonds start somewhere. You also possibly sound like Anxious attachment and she sounds like fearful avoidant/disorganized. \n\nWhy are you in it\n\nWhy is she in it\n\nWhat did you do that caused the fights? \n\nCould you have behaved differently \n\nWhat did she do in present time to start fights or were you often allowing your anxiety drive your thoughts\n\nTrust is built by both sides and you have to learn to trust and she has to be trustworthy vice versa. \n\nWhat’s the good in the relationship?\n\nWhat’s your end goal? \nWhat’s a her end goal?\n\nYou both need to do some major inner work. \nYou are both stuck in a toxic cycle. \n\nEither you both have to do the work and both have to make changes or he both need to stop shoving a square peg into a circle hole\n\nExcept each other for who you guys are in the moment and stop trying to change each other or you stop trying to change her or you both have to want to do the work to be better people\n\nOr else choose to stay in this toxic cycle and have no one to blame by yourselves in 10 years because I’ve been there  And we now share a child and we mostly hate eachother. ",
                "comment-author": "VBBMOm",
                "replies": []
            },
            {
                "body": "I’m guessing she was your first love, and those emotions come on STRONG and you feel like you’ll die without that person .  But you won’t.  Most people lose their first love (not everyone! Just most of us), we grieve, scream at the cosmos, and then we get over it and heal ourselves and are more mature and learn not to lose ourselves in another person. \n\nGive that a try.  Heal yourself.  Learn a new hobby.  Hang out with friends.  Meet some people.  Date someone else.",
                "comment-author": "WritPositWrit",
                "replies": [
                    {
                        "body": "Do you think there is a way we can save it ? :(",
                        "comment-author": "Interesting_Card719",
                        "replies": [
                            {
                                "body": "I don’t think so.  She’s got you in a downward spiral, your anxiety is off the charts because you fear the inevitable betrayal.  You’re on a roller coaster and addicted to the extremes of emotion.  \n\nBut life doesn’t have to be like that.   You can’t heal yourself until you let her go.  She is your trigger.  \n\n\nTalk to your therapist.",
                                "comment-author": "WritPositWrit",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "You guys need to break up and not get back together. You both  drive each other crazy in a bad way..",
                "comment-author": "Katlee56",
                "replies": [
                    {
                        "body": "For me, all I need to know is that she wouldn’t leave me in a vulnerable time and when I needed her most. Most couples don’t figure that out until later down the line if they will support you in hard times. So now that she’s here, I don’t feel a need to question her and want to be here with her.",
                        "comment-author": "Interesting_Card719",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "I (22F) want to have a better relationship with my boyfriend (26M), but I am not sure how",
        "post-author": "Any_Profile_4045",
        "text": "There are a lot of things which I don't like in my relationship and at this point, I feel like mostly I am tense, I as if got stuck in all these problems. Obviously, I want to feel relaxed (for now I am rather all tense), I want to have a nice relationship, but I don't know how to achieve that.\n\nI think I should describe what I don't like about my relationship:\n\n1. Our communication, ability to resolve conflicts most of the time sucks. Mostly I am the one who brings up issues and unfortunately, but for my boyfriend talking about issue is like doing a boring task which he does not want to do (he still does though, but sometimes it makes him annoyed and it annoys me that he is annoyed). But often instead of sticking to discussing an issue, we start discussing everything which is not productive at all. And often I feel like my boyfriend sees me as a person who wants to limit him (because, for example, I could be asking him not to talk while playing because it would disturb me). Also often I feel like my feelings are being dismissed because my boyfriend could start telling me that I am too fragile or sensitive only because he would not care about some sort of issue if he was in my position (and I've asked him many times not to do so and explained that it does not even help resolve any issues, only hurts my feelings). And I know that often my boyfriend feels like I am being pushy when I bring up issues because I might be repeating myself over and over which I do, because I am not sure that he understood me.\n\nOverall, it hardly ever feels like I am being understood, hardly ever we quickly resolve any conflicts even if it is something supposedly simple.\n\n2. We have a lot of differences which lead to frustration.  \nFor example, my boyfriend does not like being disturbed at all and his mood can change within seconds, so he might be in a good mood but when I approach him and disturb him all of a sudden he is all annoyed and it annoys me that he gets annoyed so easily. Because sure, I also don't like being disturbed or I might not be in a mood to interact with anybody, but unless I am extremely stressed, it would not annoy me, most of the time I only would get annoyed if I am being disturbed many times despite of me asking not to disturb me.\n\nAlso, most of the time, if something or someone annoyed me, I don't act annoyed towards anybody else. But if my boyfriend was playing and it made him annoyed, he often has annoyed tone with me as well which I don't like and it annoys me because I had nothing to do with his annoyance, yet he has annoyed tone towards me and might even get more easily annoyed with me.\n\nOr another difference is that I am definitely more proactive towards resolving issues while he is not. So if I see that there is an issue (can be issue in our relationship, can be something got broken and needs to be fixed, can be me struggling with something etc), I try to resolve it. While he might be too lazy to resolve anything.  \nIt even creates parent-child dynamic in our relationship because instead of him fixing his issue with forgetting to do some tasks, I end up being the one who has to remind him about those tasks. I was suggesting him to write down tasks, so he would not forget, but he told me that he would forget to look at that list...\n\nI am a quiet person who likes quietness. But my boyfriend almost every day has a need to make random noises, which can disturb me if I am doing something or I simply might find it annoying. Sure, if I am busy and ask him to stop because of that - he does, but if my only reasoning is that I don't like it and I want quietness for now (often I just wear earphones to block the sound but even then, I might still hear him) - then it can sometimes lead to a slight conflict before he maybe stops (like I get it, it is like I am limiting him).\n\n3. I can't rely on him with cooking when I feel bad.  \nWe both cook separately only for ourselves (most of the time) and if it happens that I feel bad, I can't ask him to cook for me. Once I asked him to simply mix spices, so it would make my cooking just a little bit easier, I was giving him clear instructions, but somehow he managed to add too much spices and those spices ended up being on the countertop which he did not notice and therefore he did not wipe that countertop after himself. So instead of getting an actual help, I had to wipe the countertop instead of mixing spices... Since then I haven't asked him to even a bit help me with cooking. I know that he is worried about failing that cooking and I am worried about the same, also it seems easier to cook myself than to ask him even if I feel very bad. I want to be able to rely on him though\n\nThe biggest issue is of course our issues with conflict resolution, but even those little difference contribute to me being dissatisfied with my relationship, often feeling as if my boyfriend is a kid.\n\nI think it could be beneficial if I little by little stopped acting like mom towards him, if I stopped being so controlling. But I would appreciate any other advices on how I could improve my relationship\n\nTL;DR: I don't like the way my relationship is right now and I would appreciate any advices on how I could improve the situation",
        "comments": []
    },
    {
        "title": "Feeling drained two months into a new relationship (22M/22F) and not sure how to move forward",
        "post-author": "Dry_Consequence_354",
        "text": "Don’t like coming on Reddit with personal stuff, but I don’t really have anyone else to talk to. I am (22M) girlfriend (22F) and I have been dating for about two months after meeting on Hinge. Things started out great — she was sweet, respectful, and seemed pretty independent. But lately, I’ve been feeling off about the relationship.\n\nShe’s started expecting me to do everything — I cook for her, buy her food, and she constantly vents or complains to me. She even hinted at me moving in with her to make rent cheaper, which I said no to because it’s way too early for that. She’s capable of taking care of herself, but she just doesn’t. On top of that, she’s really clingy and I barely get time to myself.\n\nI feel guilty for thinking this way because she hasn’t done anything outright “wrong,” but I didn’t get into a relationship to be someone’s caretaker. I want a mutual, balanced relationship — not one where I’m constantly giving and feeling drained.\n\nI don’t want to hurt her, but I’m starting to feel like I’m not in this for the right reasons anymore. I don’t know how to bring it up without causing a lot of pain, but I also can’t keep feeling this way.\n\nTL;DR: 22M dating 22F for two months. She expects a lot from me, is clingy, and I’m feeling drained. I don’t know how to end it without hurting her.",
        "comments": [
            {
                "body": "I think you know the answer to this, which is that this won't work.\n\nI recently met someone on Hinge that I was with for about 3 months. It started out great and thought this would be my next LTR.\n\nHowever, a number of red flags started popping up and it got to the point where the relationship was now a daily stressor for me, which it shouldn't be this early on.\n\nI ended up cutting bait before it got further along.  You may need to do the same.",
                "comment-author": "Muted-Percentage1137",
                "replies": []
            }
        ]
    },
    {
        "title": "Should I (25F) stay and work on this relationship with my fiancé (25M), or is it time to leave?",
        "post-author": "LevelWord5893",
        "text": "I’m 25F and I’ve been engaged to my 25M fiancé for the past 6 months. We were in a relationship in our early 20s, broke up, and then got reconnected through our families a few years later. We decided to give it another chance and eventually got engaged. While there’s been an emotional connection, there’s also been a recurring imbalance in how we show up for each other.\n\nOver the past year, I’ve been managing fibromyalgia, chronic fatigue, and recently got diagnosed with depression. Despite my health, I’ve continued working full time and have done well in my career. He has been struggling after losing his job a few months ago. That said, the emotional distance and avoidance were present even before his job loss.\n\nThroughout our relationship, I’ve made multiple efforts—clearly expressing my needs, asking for couple therapy, and even traveling to see him despite serious health issues. He hasn’t once visited me in the last 6 months.\n\nWhen I shared my depression diagnosis and said I’d appreciate him checking in around my doctor appointments, he said I was “acting like a kid.” I stepped back briefly to process things, and in that time, his parents called me to say they wanted to end the engagement. He didn’t contact me directly—not even to check on my health.\n\nWhen I later called him out on how emotionally unavailable he’d been, he lashed out, called me “stupid,” said I made everything about myself, and that I was emotionally too much. He also said he wanted a “soft and peaceful” partner and that I made him feel unsettled.\n\nI’m not perfect—I’m emotional and I express what I feel. But I’ve tried hard to make this relationship work. I know he’s going through a hard time, and I don’t want to disregard that. Still, the way he’s handled my vulnerability and health challenges has left me wondering whether I feel emotionally safe in this relationship at all.\n\nI still care about him deeply. I wanted a life with him. But now I’m stuck wondering:\n\t•\tAm I being unreasonable in what I asked for?\n\t•\tShould I wait and see if he comes back with genuine willingness to work on this?\n\t•\tOr is this emotional pattern unlikely to ever change, no matter what I do?\n\nWould really appreciate any honest, kind, or even tough-love advice—especially if you’ve been through something like this.\n\n⸻\n\nTL;DR:\n25F engaged for 6 months to 25M. Struggling with health and emotional needs while he’s been distant and dismissive—this has been a pattern even before he lost his job. After I shared my depression diagnosis, they want to break off the engagement, not him. He later lashed out, saying I’m “too emotional” and not peaceful enough. I’m starting to feel emotionally unsafe and unsure if this will ever work.",
        "comments": [
            {
                "body": "You’re not unreasonable. He’s uncaring and selfish. You better leave girl, he’s not the man of your life",
                "comment-author": "Soft-Ad3140",
                "replies": []
            },
            {
                "body": "This is the definition of flogging a dead horse. \n\n\nYou have listed about 10 reasons why you shouldn't marry this guy and/or how he would make your life **miserable** if you did, and not a *single* reason for:\n\n\n* Why you think this guy is the right life partner for you\n* Why you accepted his marriage proposal \n* Why you have any faith whatsoever that he will stop treating you the way he's treating you now. \n\n\nYour relationship has always had problems. It has never not had problems. So why do you think this guy will actually make you happy? \n\n\nYou love *the idea* of him. But the real him is the one you will marry, and that man will make you miserable. ",
                "comment-author": "ShelfLifeInc",
                "replies": [
                    {
                        "body": "Why? Because she's bought into the sunk cost fallacy probably.",
                        "comment-author": "spac3ie",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Better to leave now before you get through a long and expensive divorce. I can imagine how difficult it might be to leave but find the strength in yourself. 🤗",
                "comment-author": "thatgal15",
                "replies": []
            },
            {
                "body": "There is no other way than leaving him. Wish my partner was like you, would give all the love and attention deserved. Sorry, but he is not into you just as you are into him.",
                "comment-author": "Sergio_82",
                "replies": []
            },
            {
                "body": "So he doesn't care about your health. Doesn't bother to see you in person. Verbally abused you. Is disrespectful. Doesn't care about your feelings. Offers no emotional or practical support...\n\n\nWhy do you want a life with him? You're alone in this relationship. And you forever will be. \"Soft and peaceful\" partner is a codeword for \"functional mummy I can also bang\".\n\n\nRegarding your questions:\n- you're completely reasonable with what you're asking.\n- no, you absolutely shouldn't wait. There is nothing to wait for. What you dream of will never happen.\n- yes, you're right, this emotional pattern will never change. There is nothing you can do.\n\n\nAnd I'm very sorry for your health issues. Please cut him off and give yourself all the care, time, money, and love. ",
                "comment-author": "Silver-Scholar5695",
                "replies": []
            },
            {
                "body": "I'm so sorry sweetie. You deserve better 🥹. Someone who checks up on you and never treats your problems as a joke and call you stupid😔😔💗💗💗 you can get through this. You're loved and precious ,don't let him make you think otherwise. Leave ...",
                "comment-author": "Specialist_Visit4581",
                "replies": []
            },
            {
                "body": "Time to give him what he wants. Stop chasing him. He wants someone who will listen to him, serve him, make his life easier. Soft and peaceful means he wants a quiet maid. He does not want to do that for you - this is a one way street. He's a soft little boy with mammy issues. You're supposed to be his bang maid and not complain. His family created a weak person and they are backing up the petulance. He judges you for having an illness rather than supporting you and admiring your resilience. This is the kind of person, man, who would leave you if you got cancer. He's useless. He thinks engagement is a gift to you. He will not be a good husband. Being alone is better than begging for affection from a selfish child.",
                "comment-author": "woolencadaver",
                "replies": []
            }
        ]
    }
]