[
    {
        "title": "How do you feel about romantic orientation?",
        "post-author": "Ryo_Veine",
        "text": "There are such as: lithromantic, aromatic. You can also add: demisexuality, graysexuality,\nquarromantic. This is all connected with romantic attraction, having invented a term for each. Do you belong to any of them?\n\nIf you are passionate enough about this, then I will ask a question.\n\nHave you ever had a partner who, after mutual love, lost interest in you?\n",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            }
        ]
    },
    {
        "title": "How can i be in a relationship?",
        "post-author": "GEATS-IV",
        "text": "It might sound cheesy, but i always dreamed about romance since i wss little. I always wanted to have a girlfriend and still want to, but i'm incredibly shy and introvert. I have terrible social skills and i'm always afraid of talking to girls and say something weird or boring and be embarrassed. I'm really insecure about my apperence and body. My therepist say i have a beautiful face, but i'm a chubby guy and i know that a lot of woman don't like that. I always feel sad and lonely when i see happy couples doing cute things everywhere, including one of my friends who is in a really cute relationship. I just wanna experince this, been loved and feel love for someone, but it's so difficult ",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "there is someone for everyone and as long as you be your quirky self it’ll come to you , Remember every part of your appearance is something that people someone for generations has fell in love with 🫰🏽🤞🏽keep your head up and as long as you work on being happy for yourself you’ll find someone else to share it with who might be just as shy and introverted to match :)",
                "comment-author": "AtMyLowOfficial",
                "replies": []
            }
        ]
    },
    {
        "title": "How To ATTRACT A PARTNER V - Signaling Mating Readiness",
        "post-author": "Ok_Ratio_4128",
        "text": "",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            }
        ]
    },
    {
        "title": "I need help with my crush",
        "post-author": "FR33_NikolaiXOXOBSD",
        "text": "I need help!!\n\nI also need advice!! Does my crush like me? For context we met at an art club thing, he's a year older than me, we're young, he's autistic and has anxiety/ADHD and these r some things he does\n\n1. He’s made long-term plans with me, not just stuff like “see you tomorrow,” but things that involve the future—like things we might do together later, as if he’s already imagining I’ll still be in his life.\n\n\n2. He told me I’m the person he’s made the most eye contact with, which means a lot coming from him since he’s autistic and making eye contact is usually hard. That tells me I make him feel comfortable and safe.\n\n\n3. He fidgets a lot around me, which might just be part of his ADHD/autism, but I noticed it’s especially when we’re close or when he’s excited to talk to me, like he can’t sit still because he’s happy or nervous.\n\n\n4. He gives me really thoughtful gifts, not just random things. One time, I said I liked deer—and later he gave me a deer plushie. That kind of remembering and personal effort shows he listens and cares deeply.\n\n\n5. He talks to me a lot, like way more than he talks to anyone else. Whether we’re in person or texting, he keeps the conversation going and seems to want to keep me engaged.\n\n\n6. He trusts me with everything, even heavy stuff. He’s opened up about his life, his feelings, and his mental health—stuff he doesn’t tell many people. It’s like he sees me as his safe space.\n\n\n7. He’s nice and loud around me, in a way that feels full of energy and joy. It’s like he doesn’t feel like he has to mask around me. He shows his full self and even gets silly, which I love.\n\n\n8. He once told me about his struggles with his sister, things at home, and his mental health, and I was there for him through it. He made me feel like I made a difference, like I helped him feel supported.\n\n\n9. He said that one time when we played Roblox together, it actually helped him decide not to hurt himself. He told me later that my presence and friendship helped him that day—even though I didn’t know it at the time. That meant the world to me.\n\n\n10. During a game of Truth or Dare, he said he has no secrets he hasn’t told me. That kind of trust is rare, and it felt like he was saying I already know the deepest parts of him.\n\n\n11. When I went on holiday, he texted me “I miss you” or “I missed you” multiple times. It was unprompted, sincere, and made me feel like he really noticed I was gone.\n\n\n12. Even when he’s busy or offline, he replies to me when he checks WhatsApp at the end of the day. He doesn’t forget, and he makes an effort to talk to me even if it’s late.\n\n\n13. He always sits by me and talks to me at art group, like it’s automatic—he doesn’t even look for another seat. He just finds me. It’s like I’m his default person.\n\n\n14. He mirrors my affection, like when I called him “pookie” and said I’d pause my music for him (even though I love music), he replied saying he’d pause his music for me too and called me “pookie” back.\n\n\n15. He said he’d ship any characters I ship, even if he doesn't care about them, just because I care. That shows how loyal and supportive he is of my interests.\n\n\n16. We have inside jokes together, the kind that only make sense to us. It makes our bond feel unique and special, like our own little world.\n\n\n17. He uses silly, sweet, or even flirty emojis when texting me, like 🔥🔥 or exaggerated reactions like “LOL,” and always keeps the tone fun and connected.\n\n\n18. He continues conversations even when he doesn’t know what I meant, like when I said “verbatim” and he didn’t know what it was—he still replied and kept the tone light instead of stopping the convo.\n\n\n19. He consistently chooses me—talking to me, sitting with me, texting me, trusting me—again and again, even when he has other options. That constant effort feels like more than just a “bestie.”\n\n\n\nDoes he like me?? I need advice!! ",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "ALSO ONCE I WAS SCROLLING ON MEMES AND I WAS LAY ON MY FLOOR LEANING ON MY ELBOWS AND HE(not one to initiate physical touch) HELD MY ARM AND LAY NEXT TO ME",
                "comment-author": "FR33_NikolaiXOXOBSD",
                "replies": [
                    {
                        "body": "For this part, this may imply something?\n\nBut I'm pretty sure this behaviour is completely platonic. He's neurodivergent which changes his view of social norms. \n\nHe probably isn't trying to indicate attraction, just initiate a geniune bond with you as someone he dearly trusts. Most neurodivergent affection is misjudged as 'flirting' and to me- as a suspected autistic person- sees these behaviours as fully platonic too.\n\nYour comment here makes me bat an eye though. He might like you back. Maybe he just really trusts you, obviously I can't tell through a screen.\n\nTry asking him about it, but don't make it a big thing. Such as asking for tone tags when he says something that you think is flirting. Be especially careful because he has anxiety and he could start to overthink on how you perceive him.\n\nI wish you well!",
                        "comment-author": "Bright-Excitement864",
                        "replies": [
                            {
                                "body": "Thank you:3 2 of my other friends have said he probably likes me but one of the friends doesn't know him and the other friend only sometimes talks to him",
                                "comment-author": "FR33_NikolaiXOXOBSD",
                                "replies": [
                                    {
                                        "body": "You're welcome!\n\nIt would definitely be a better perspective if it was someone who knew your relationship. Do you have a family member to take reference from? Maybe his siblings? See how he feels about you according to how they interpret your relationship. If you can, that is.",
                                        "comment-author": "Bright-Excitement864",
                                        "replies": [
                                            {
                                                "body": "His sibling would tell him, his sibling is a rat. His sibling is manipulative and no family, but I'm also autistic and I struggle with people and I'm just trying to figure it out with help of others I can trust",
                                                "comment-author": "FR33_NikolaiXOXOBSD",
                                                "replies": [
                                                    {
                                                        "body": "I see. I hope you figure it out soon! You have plenty of time, don't worry.",
                                                        "comment-author": "Bright-Excitement864",
                                                        "replies": [
                                                            {
                                                                "body": "Thank you:)",
                                                                "comment-author": "FR33_NikolaiXOXOBSD",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Also, not sure if this is important but I told him I love him (in a platonic setting) a few times and he said it too idk I'm delulu",
                                "comment-author": "FR33_NikolaiXOXOBSD",
                                "replies": [
                                    {
                                        "body": "Aaaa.. if it's platonic, it's platonic. But I wouldn't call it that! I'd say you're being hopeful. It sounds a lot nicer to think about. It's a good trait to have.",
                                        "comment-author": "Bright-Excitement864",
                                        "replies": [
                                            {
                                                "body": "Its Only a good trait when you're not like me and believing in stuff that definitely won't happen then becoming depressed when it doesn't🥲",
                                                "comment-author": "FR33_NikolaiXOXOBSD",
                                                "replies": [
                                                    {
                                                        "body": "No because that's so relatable why are we like thisssss wwwww.",
                                                        "comment-author": "Bright-Excitement864",
                                                        "replies": [
                                                            {
                                                                "body": "REAL BC WHY??? WHY??????!!! AAAAHHHHHYGHHHUYGHH",
                                                                "comment-author": "FR33_NikolaiXOXOBSD",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "title": "Pack die Badehose ein...und dann ab zum Wannsee. Bei dem Wetter? - Berli...",
        "post-author": "DerArtliteart",
        "text": "Berlin-Wannsee ist nicht nur der bei Berlinern und Touristen beliebte Badesee und Ausflugsort, der bis nach Brandenburg führt, sondern auch ein zum größten Teil zwischen Seen gelegener Ortsteil im äußersten Südwesten der Stadt. Den Hauptbereich bildet die über fünf Brücken erreichbare Insel Wannsee, sowie die Pfaueninsel und der Hauptort Stolpe mit dem historischen Zentrum des Ortsteils und andere romantische Ortslagen. Wir machen eine erholsame Fahrt auf einem Ausflugsdampfer und reisen im Jahr 1988.  \nBerlin-Wannsee is not only a popular bathing lake and excursion destination for Berliners and tourists, extending as far as Brandenburg, but also a district in the extreme southwest of the city, largely located between lakes. The main area is the Wannsee Island, accessible via five bridges, as well as the Peacock Island and the main town of Stolpe, with the district's historic center and other romantic locations. We take a relaxing cruise on a pleasure steamer and travel back to 1988.\n\n[https://youtu.be/SCDqLk9gTI0](https://youtu.be/SCDqLk9gTI0)",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            }
        ]
    },
    {
        "title": "I fell in love with a girl that loves someone else",
        "post-author": "drewav2",
        "text": "Last year I met a girl, we started talking everyday, getting close and I realized I loved her, like I really love her. A few months we were talking about life stuff and she told me about a guy she loves, she actually loves him, they know eachother for months maybe years now, but they dont get anywhere, they just seem to be using eachother for comfort if that makes sense, not in a bad way tho.\nEverytime we're talking and she mentions him, my chest physically hurts, my anxiety goes through the roof, but i cant let her go\nI see myself waiting, and waiting for something, I see her as the perfect girl, I dont know if i should wait, she also helps me a lot, we have an amazing friendship and I don't want to lose that.\nEverytime she mentions him I feel like im an idiot and I'm just negative, I tell her that's not good for her and stuff like that, I do believe it isn't good but I feel like I shouldn't be saying this because it might be a conflict of interest or smtn.\nI can't decide if its worth waiting since she's amazing but also I suffer with anxiety and attachment issues",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "I find it very easy, you need to tell her and she needs to make the decision of keep trying with the other guy or giving you a shot. The worst scenario is not she choosing the other guy and friendzone you (btw this is were you need to move on) the actual worst case scenario is keep putting yourself in a position of loving someone that doesn’t love you and wants to be with someone else.",
                "comment-author": "Soft_Cantaloupe_5805",
                "replies": []
            }
        ]
    },
    {
        "title": "Herbstliche Schlossromantik in Berlin 1988 - Autumnal castle romance in ...",
        "post-author": "DerArtliteart",
        "text": "Das Schloss Charlottenburg umgibt barocker Glanz und königliche Pracht und ist die größte und bedeutendste Schlossanlage der einstigen brandenburgischen Kurfürsten, preußischen Könige und deutschen Kaiser in Berlin. Wir spazieren durch die romantische Parkanlage und kontaktieren zutrauliche Eichhörnchen.  \nCharlottenburg Palace is surrounded by baroque splendor and royal magnificence and is the largest and most important palace complex of the former Brandenburg electors, Prussian kings and German emperors in Berlin. We walk through the romantic park and contact trusting squirrels.\n\n[https://youtu.be/wIp3oUBCEuA](https://youtu.be/wIp3oUBCEuA)",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            }
        ]
    },
    {
        "title": "GF Prefers Finishing Orally but Struggles to Swallow – Will This Get Easier Over Time? Looking for Advice/Experiences",
        "post-author": "WesternCloudy",
        "text": "Looking for some advice and perspectives on a personal issue. During intimacy, my partner usually prefers to finish with oral and always chooses this option when asked. The only difficulty is with swallowing at the end-not because of the taste, but because the amount and thickness can make it feel like it gets stuck in the throat.\n\nShe says it’s not a big problem and continues to choose this, but I want to be considerate and not push beyond comfort. My main questions:\n\nDoes this get easier or feel more normal with time and experience (1yr past)?\n\nOr is it something that might become uncomfortable or tiring in the long run?\n\nHas anyone else dealt with this, and how did you handle it?\n\nI want to keep things positive and comfortable for both of us, so I’d really appreciate any advice or shared experiences from others who’ve navigated this situation.",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "She prefers for you to bust in her mouth? Why can’t she spit it out?",
                "comment-author": "arthritisankle",
                "replies": []
            },
            {
                "body": "She could simply spit it out. \n\nYou could only try to improve the taste (lots of fruits and veggies, no garlic, less meat, and some medicine gives a really bad taste), but that won't do anything with the texture or amount. \n\nDo you really care if she swallows or spits it out?",
                "comment-author": "EuropeSusan",
                "replies": [
                    {
                        "body": "No issues with the taste.. she likes to take into mouth but problem is , she said it stick in the throat . It's like a gum & that's the reason.. \nBut she wanted to swallow ",
                        "comment-author": "WesternCloudy",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "Is it possible to grow a bond from afar after a short in-person meeting?",
        "post-author": "Themedgirllena23",
        "text": "Met someone during a short trip — we had a spark, stayed in touch a bit, and lately he's started texting more regularly. There's some warmth, some nostalgia, but he's still a bit hot and cold.\n\nWe're in different countries, and I’m not sure if he’s just being polite or if there’s real potential. Has anyone here made something work from a fleeting connection like this? How do I create genuine interest without pushing?\n\n",
        "comments": [
            {
                "body": "\nHi, David here!\n\nI wanted to let you know that I just finished putting together my eBook \"**How to Date Any Girl**\" version 4.0 and would LOVE to get some honest feedback from you!\n\nI decided to give it away for free for the time being.    \n\nYou can get the eBook by [clicking here](https://davidhimself.com/goto/ebook/direct-link/How-to-date-any-girl-ebook-v4.pdf)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RomanticAdvice) if you have any questions or concerns.*",
                "comment-author": "AutoModerator",
                "replies": []
            },
            {
                "body": "I met my current boyfriend during a short trip as well. Despite living countries apart our bond grew. We had an online game we would play quick rounds of together (think multiplayer tetris) we would call occasionally for a match until we started using it as an excuse to talk to each other. Having an inside joke, game, or even silly ritual like saying good morning can take you a long way in evolving your relationship. It is definitely possible.",
                "comment-author": "Cunt_In_a_Trencoat",
                "replies": []
            }
        ]
    }
]