[
    {
        "title": "Ong Ye Kung, Chee Hong Tat send lawyers’ letters to Facebook user over allegations they condoned Su Haijin's illegal activities",
        "post-author": "Detective-Raichu",
        "text": "",
        "comments": [
            {
                "body": "The two of them seem to be coordinating their responses… without involving NCM lol \n\nGuy must be feeling especially fantastic, considering how he and OYK were literally co-ministers at MOE",
                "comment-author": "crobat3",
                "replies": [
                    {
                        "body": "OYK never diam the conference room when NCM walked in.",
                        "comment-author": "Flocculencio",
                        "replies": []
                    },
                    {
                        "body": "But why do they need to coordinate with him? NCM isn’t a minister. These two are in the cabinet.\n\nEdit: yeah cabinet not formed but you get what I mean",
                        "comment-author": "chicasparagus",
                        "replies": [
                            {
                                "body": "Cos he is also in PAP and just elected back as a MP? Not to mention the PAP CEC? It does make sense to involve NCM unless they wanna distance from him",
                                "comment-author": "fateoftheg0dz",
                                "replies": []
                            },
                            {
                                "body": "Cabinet not formed yet. Don’t spread fake news.",
                                "comment-author": "mrwongz",
                                "replies": [
                                    {
                                        "body": "The prime minister and other ministers who make up the Cabinet do not vacate their offices upon a dissolution of Parliament, but continue in their posts until the first sitting of the next Parliament following a general election.\n\nOtherwise, there is no current ministers to run the government while election is ongoing!",
                                        "comment-author": "RexRender",
                                        "replies": [
                                            {
                                                "body": "I mean, the joke is boh zeng hu (no government in Hokkien), but it's not literal, otherwise any country in this state will be vulnerable to a lot of things.",
                                                "comment-author": "snowysnowy",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "body": "Are you saying now Singapore bo cheng hu?",
                                        "comment-author": "GeshtiannaSG",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Both of them are cabinet ministers now, with a reputation to protect, along with the govt’s.\n\nNCM is an MP with no positions in cabinet\n\nYou reading too much into it.",
                        "comment-author": "faptor87",
                        "replies": []
                    },
                    {
                        "body": "Both are ministers, ncm isn't. That's all",
                        "comment-author": "-wmloo-",
                        "replies": []
                    },
                    {
                        "body": "Also notably not a POFMA…",
                        "comment-author": "HorneRd512",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Lim swee say wife was able to join him at the dinner in 2022 even though she passed away in 2021...",
                "comment-author": "Hot-Can-7039",
                "replies": [
                    {
                        "body": "haha I saw this analysis in Charles Yeo's post also, timeline really doesn't gel",
                        "comment-author": "Almsoo7",
                        "replies": []
                    },
                    {
                        "body": "Clearly they are hiding a time machine from us.",
                        "comment-author": "cheetosbear",
                        "replies": [
                            {
                                "body": "Maybe that's what Teo En Ming was trying to warn us all along",
                                "comment-author": "Zenocius",
                                "replies": [
                                    {
                                        "body": "immortal jellyfish for next president please",
                                        "comment-author": "darrenoloGy",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "National reserve is completely empty. There's just a giant empty vault with a massive hamster wheel in the middle powering the flux capacitor.",
                                "comment-author": "marcuschookt",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Guy was so despo to hide his tracks, he brought out his mistress instead",
                        "comment-author": "fitzerspaniel",
                        "replies": []
                    },
                    {
                        "body": "> Mr Lim said Su was the only person he did not recognise there, and he had no contact with Su after the dinner.\n\nIn just about all of these dinners, SHJ was the only relatively unknown person there which leads me to think Sam Goi arranged those dinners for the purpose of getting the ministers to know SHJ personally.",
                        "comment-author": "Administrator-Reddit",
                        "replies": []
                    },
                    {
                        "body": "That was not his wife, different woman.",
                        "comment-author": "DeadStoryTeller",
                        "replies": []
                    },
                    {
                        "body": "…which CNA intentionally omitted. Shit journalism or fake news?",
                        "comment-author": "Beetcoder",
                        "replies": []
                    }
                ]
            },
            {
                "body": "How come never pofma but sue in personal capacity?",
                "comment-author": "jkohlc",
                "replies": [
                    {
                        "body": "It’s Shan’s toy and you can’t play with it",
                        "comment-author": "Initial_E",
                        "replies": []
                    },
                    {
                        "body": "POFMA is used against specific claims made on the government, not on its ministers.",
                        "comment-author": "Twrd4321",
                        "replies": [
                            {
                                "body": "This - by law, POFMA can only be used when public interest is involved (e.g. when a government agency's credibility is in question). Hence, why it was used in the case of Ridout Road because the credibility of SLA was called into question by the falsehood, or in one case involving Iswaran, because the falsehood implicated LTA.",
                                "comment-author": "Azora114",
                                "replies": [
                                    {
                                        "body": "this implies that saying 上梁不正下梁歪 enough times in response would be enough to POFMA over. (or is it only if you're a sufficiently public figure to be deemed trustworthy enough to dent the government's credibility?)",
                                        "comment-author": "Winter_Library_7243",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "If POFMA is use AGC lawyers?\n\nIf sue in personal capacity, ownself find lawyer?",
                                "comment-author": "jkohlc",
                                "replies": []
                            },
                            {
                                "body": "Then why is this coordinated by the two ministers by their government press secs?",
                                "comment-author": "HorneRd512",
                                "replies": []
                            },
                            {
                                "body": "ministers are part of the government",
                                "comment-author": "shimmynywimminy",
                                "replies": []
                            },
                            {
                                "body": "That’s what is said. But the truth is vastly different.",
                                "comment-author": "lionelverymessy",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Just speculating. Maybe cos they went to the dinner in their personal capacity? Usually POFMA is used against misformation about the government right?",
                        "comment-author": "thamometer",
                        "replies": []
                    },
                    {
                        "body": "Pofma is for fake news. This is outright slander.",
                        "comment-author": "DevelopmentOpening62",
                        "replies": []
                    }
                ]
            },
            {
                "body": "BBQ le",
                "comment-author": "aeth3rz",
                "replies": []
            },
            {
                "body": "Rich Sng might be Poor Sng after this lawsuit 🤣",
                "comment-author": "helloween123",
                "replies": []
            },
            {
                "body": "taking a page out of shanmugam’s book, learning from the best 👍",
                "comment-author": "drwackadoodles",
                "replies": [
                    {
                        "body": "From Ah Gong LKY\n\nbut rightfully he should kena sued la, talk so much BS, linking vaccine differentiated measures to Hitler War Crimes",
                        "comment-author": "helloween123",
                        "replies": []
                    }
                ]
            },
            {
                "body": "What is stopping them from holding a press conference to clear the air?",
                "comment-author": "deRdit-giNger",
                "replies": []
            },
            {
                "body": "Wasn't the su guy wanted in china ?\n\nSo not only is ICA blur. But ministers as well ?\n\nNow there are photos claiming even foreign officials were at the dinner.\n\nAlong with the earlier questions of whether all these dinners contravened covid rules of mass gatherings and face coverings.\n\nWhether ministers declared if the meals were a gift.\n\nEveryone is giving different recollection of dates.\n\nMsm using a cropped photo which seems to have included minister originally.\n\nWhole situation is begging for an independent investigation but at least lawrence is showing some real leadership by not saying anything...",
                "comment-author": "nextlevelunlocked",
                "replies": [
                    {
                        "body": "That is a good point; if that PRC guy was a criminal over there, shouldn't it flag the ICA? Or are Sino-SG relations not that level yet?",
                        "comment-author": "Dagdade",
                        "replies": [
                            {
                                "body": "Think ica said that china did not request him to be arrested. Perhaps that is a good enough excuse for ica. But not for ministers... luckily their excuse is that they didn't know his colourful history. Which itself brings up the question of who invited su to these intimate gatherings and how could they not know about him after repeated meetings in a small group... \n\nEspecially during covid restrictions... when you expect people to be more selective of who they invite during limited group sizes.",
                                "comment-author": "nextlevelunlocked",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "The China Ambassador to SG was also thr",
                        "comment-author": "Zenocius",
                        "replies": [
                            {
                                "body": "Which makes you wonder what is going on since there were claims that the fujian gang got busted after a visit by china's top official who pressed local authorities to act...",
                                "comment-author": "nextlevelunlocked",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "And so it starts.",
                "comment-author": "ziggyyT",
                "replies": []
            },
            {
                "body": "Lai liao lai liao",
                "comment-author": "guiltycat93",
                "replies": [
                    {
                        "body": "Singapore political drama 狮城风暴",
                        "comment-author": "sneakyweeki",
                        "replies": [
                            {
                                "body": "# 狮城风暴之鸿门宴",
                                "comment-author": "matey1982",
                                "replies": []
                            },
                            {
                                "body": "狮城风暴之杀鸡儆猴 🤣",
                                "comment-author": "Yamamizuki",
                                "replies": [
                                    {
                                        "body": "狮城风暴之吃饭惹的祸",
                                        "comment-author": "MostRandomPasserby",
                                        "replies": [
                                            {
                                                "body": "狮城风暴之夜宴疑云",
                                                "comment-author": "tom-slacker",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "So if NCM doesn’t do the same, then what?",
                "comment-author": "ClaudeDebauchery",
                "replies": [
                    {
                        "body": "I mean, NCM wasn’t a Minister at that time, so what did “Rich Sng“ say about NCM in his FB post exactly?",
                        "comment-author": "marmaladecorgi",
                        "replies": []
                    },
                    {
                        "body": "One of them?",
                        "comment-author": "jofeebee",
                        "replies": []
                    },
                    {
                        "body": "He can't even stand up for himself.",
                        "comment-author": "MostRandomPasserby",
                        "replies": []
                    }
                ]
            },
            {
                "body": "It’s a good diversion, but I’m way more interested about their relationship with Mr Popiah King. What is that about?\n\nLet’s not lose sight of the forest for the trees. Let’s keep asking questions. 🌯🌯🌯",
                "comment-author": "HorneRd512",
                "replies": []
            },
            {
                "body": "> the ministers will have to sue him to clear their names against the false allegations, and uphold the clean and honest reputation of the government\n\nNobody “has to sue” others to clear their own names. Only popiah-skinned ministers in Singapore, babied by decades of propaganda carrying their balls, have to resort to such a thing when tongue-tied",
                "comment-author": "uintpt",
                "replies": [
                    {
                        "body": "It has nothing to do with clearing their name but to punish the people that speak out.\n\nYour average SES Singaporean is not going to be able to afford legal fees to fight even if they can justify the statements as non-defamatory.\n\nJust look at TT Durai, who bullied 2 innocent citizens with defamation lawsuits when they were actually correct but had no money to fight. Dumbass thought he can do the same to SPH and got smacked. The other 2 may be vindicated but the still lost money and their apology is still on record.",
                        "comment-author": "wwabbbitt",
                        "replies": [
                            {
                                "body": "It’s nothing to do with punishing people that speak out. It’s to do with **reputation and misinformation.** It’s only a photo. That’s not good enough evidence to accuse them of condoning money laundering.\n\nIf one day, i accused you of being a child molester, or a serial rapist, will you simply brush it off and say you’re not? No. You’ll want to sue me for defamation, or else if that’s not enough, you’ll want to kill me. That’s exactly what’s happening here. Saying a minister embezzled our CPF or doing money laundering is that equivalent.\n\nBut regarding NCM…. It’s not a good outlook. Not wrt to Su Haijin, but his personality and tons of first hand anecdotes.",
                                "comment-author": "Dorkdogdonki",
                                "replies": []
                            },
                            {
                                "body": "Remember scrooball and Shanmugam?",
                                "comment-author": "buttnugchug",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "It is good to quell baseless speculation. It teaches people to have some evidence before making accusations.\n\nAny Tom, Dick and Harry can come up with conspiracy theories, and others will jump on the bandwagon just to stick it to people they don’t like.",
                        "comment-author": "Descartes350",
                        "replies": [
                            {
                                "body": "Please lah, can quell, then dont have to resort to suing. Suing is a rich man's solution that supposed to wear down the defendant until they drop it, evidence or no evidence",
                                "comment-author": "MadKyaw",
                                "replies": [
                                    {
                                        "body": "If you remember, a similar issue cropped up a while ago when a rich NUS guy behaved questionably around girls, and a fellow student called him out on social media.\n\nGuy sued her, and she was stressed because she can’t afford the lawsuit. Online discussion ensued. Similar comments about rich bullying the weak. Consensus is that the guy was dubious, but the girl was wrong for making false accusations.\n\nSame thing here. It IS suspicious what happened with the ministers, but people should not take it as license to shoot their mouths off.\n\nNo need to pretend that it’s the rich bullying the poor. In the first place people are making baseless accusations.\n\nWell-deserved lawsuit.",
                                        "comment-author": "Descartes350",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "I disagree. You quell speculation by laying out the bare facts with enough detail to shut up any doubters. By hiding behind the legal system and threatening to sue, as politicians, they look more like petulant children and all the more suspicious of hiding things",
                                "comment-author": "uintpt",
                                "replies": [
                                    {
                                        "body": "What do you think courts do? Make judgements without detail and bare facts?",
                                        "comment-author": "toiletthinkercan",
                                        "replies": []
                                    },
                                    {
                                        "body": "Won't doing this in court where you have to lay down all the bare facts be the best avenue then? Rather then going to social media and participate in \"he say she sat\" mud slinging where everyone on the internet suddenly becomes a expert on the matter?",
                                        "comment-author": "biasedrapier26",
                                        "replies": []
                                    },
                                    {
                                        "body": "Actions have consequences. You want to accuse someone make sure you can back it up. Why let random people who want to defame you get away with it?",
                                        "comment-author": "KorribanGaming",
                                        "replies": []
                                    },
                                    {
                                        "body": "Do you know how tiring it is to have to lay facts for every single claim made against you especially if you’re high profile and other faceless people have an axe to grind with you?",
                                        "comment-author": "Legal_Captain_4267",
                                        "replies": [
                                            {
                                                "body": "Wouldn't lawsuits be even more tiring lmao",
                                                "comment-author": "A_extra",
                                                "replies": [
                                                    {
                                                        "body": "You just need one lawsuit, rather than 100 lawsuits though. Look at the US where political parties make up facts about each other (eg Piazzagate, etc) without any consequences even when the truth is known.",
                                                        "comment-author": "OutsideSimple4854",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "body": ">laying out the bare facts\n\nTo who? Court of public opinion? Anyone can say anything. That is why the court exists, to provide a just 3rd party to judge on such matters.\n\nIf the ministers don't sue, the public will instead speculate that they have no case, and thus only prefer to \"say\" but have no confidence to defend themselves. This does not \"quell speculation\".\n\n>hiding behind the legal system\n\nSuing is not hiding. It is quite literally putting yourself into the scrutiny of the court.",
                                        "comment-author": "rEALLYnOOB",
                                        "replies": []
                                    },
                                    {
                                        "body": "It’s near impossible to prove a negative i.e. how does a minister prove they never enabled illegal activity? They can’t possibly show the public every second of their personal lives.\n\nOn the other hand it’s much easier to speculate and throw out allegations.",
                                        "comment-author": "Pretend-Friendship-9",
                                        "replies": []
                                    },
                                    {
                                        "body": "Nah. You're too smart if you're saying things like \"hiding behind the legal system\". Most Singaporeans only care about optics. Threatening to sue is enough for your average aunties and uncle to believe they're innocent. They won't dig deeper.",
                                        "comment-author": "takenusername35",
                                        "replies": []
                                    },
                                    {
                                        "body": "*\"Falsehood flies, and truth comes limping after it, so that when men come to be undeceived, it is too late; the jest is over, and the tale hath had its effect\"*",
                                        "comment-author": "rpianojam",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Yeah LMAO because a massive jurisprudence of defamation and slander cases brought by private citizens totally doesn’t exist\n\nI get that people love their outrage but facts don’t change because you don’t like them",
                        "comment-author": "rieusse",
                        "replies": []
                    },
                    {
                        "body": "It is to uphold the government’s reputation",
                        "comment-author": "happytortellini",
                        "replies": [
                            {
                                "body": "Lol what sai reputation? Today Su ate with Ng Cheebye, tmr Lim Swee Say, day after OYK and Chee Hong, next week Leader TCJ and his lover....he'd have dined with the wholeass cabinet and our govt still wouldn't lift a finger to arrest him until China intervened.",
                                "comment-author": "fitzerspaniel",
                                "replies": [
                                    {
                                        "body": "You so angry for what?",
                                        "comment-author": "happytortellini",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Nobody has to sue. But never sue means it's true. 🥳",
                        "comment-author": "lesshelp101",
                        "replies": []
                    },
                    {
                        "body": "SONGBO",
                        "comment-author": "BenShers",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I visited his profile and the first post I read is an anti-vax rant likening Singapore to the Nazi regime..",
                "comment-author": "-watchman-",
                "replies": []
            },
            {
                "body": "This Rich Sng is also a scammer who suddenly closed down his beauty business (Fabulous Aesthetics Pte Ltd) without prior notice to his customers and leaving them with unfulfilled beauty packages. Even heard that he did not pay wages to the employees. Affected people are unable to get closure. I believe a few customers have since filed a report with CASE. Hope this legal case blows up and the ministers will sue his pants off.",
                "comment-author": "xwhitewhinex",
                "replies": [
                    {
                        "body": "Heard from my therapist that he was still selling packages on the last day of business. If it is not a deliberate move to get “as much money” from his customers as possible, I dont know what is.\n\nApparently, he did not pay his employees CPF (from Jan 25), and their sales comms (for Feb 25 & Mar 25). \n\nKnowing fully that he is planning for an exit and yet, choosing to continue his BAU to collect money to fund wtv he is funding is unethical and irresponsible. Not surprised that he is being sued for running his mouth loose.",
                        "comment-author": "RegisterEducational9",
                        "replies": []
                    },
                    {
                        "body": "Waiting for the part where people find out more about this fella, suddenly their opinion on this case flip prata",
                        "comment-author": "beyondthef",
                        "replies": [
                            {
                                "body": "You can dislike this Rich Sng guy for his alleged scams and at the same time think that the ministers having a private meal with one of the Fujian gang is suspicious enough to warrant further investigation. They're not mutually exclusive lmao.\n\nAnyway, the only one winning here are their lawyers.",
                                "comment-author": "Murky_Rough_4110",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "They won't respond to other fake ads on FB but they would take action on these allegations? There must be some truth to these allegations then. We're getting serious now boys.",
                "comment-author": "Imperiax731st",
                "replies": []
            },
            {
                "body": "Nope that's not gonna change any minds, it's only gonna make them look extra guilty instead.",
                "comment-author": "fitzerspaniel",
                "replies": []
            },
            {
                "body": "In super white and very fair Singapore, I am sure our legal system will come up with very fair verdict that show Rich Sng has defamed our whiter than white Ministers. \n\nThe 65% mandate of Singaporeans shall come crushing down on Rich Sng for his fake assertions",
                "comment-author": "DullCardiologist2000",
                "replies": []
            },
            {
                "body": "Would be a different story it it was the opposition",
                "comment-author": "jofeebee",
                "replies": []
            },
            {
                "body": "The guy easily can post using anonymous account in facebook like thousand of PAP bots. He choose to use his real facebook account to post sure get sued.",
                "comment-author": "Stanislas_Houston",
                "replies": []
            },
            {
                "body": "To me… I think OYK and CHT prob have no dealings with Su. \n\nI don’t think they are willing to risk whatever they have gained so far by being in the top PAP echelons lor.",
                "comment-author": "Intentionallyabadger",
                "replies": []
            },
            {
                "body": "Article says “The ministers have asked Sng to…… pay damages, which they will donate to charity.”.\n\nI never hear they donate even a small percent of their multi-million dollars annual salary to charity before in the past decade at all, now use other people’s defamation damage money to donate to charity, and these ministers “proudly beat their chests and announce to the whole nation” that they are donating the proceeds to charity, lol. All the previous lawsuits all same, all says will donate to charity. I will also say I will donate cos I won’t have to pay a single cent (if I earn millions a year)…\n\nIf they say they will match every dollar of the defamation damages dollar, 1 dollar to 1 and donate to charity, then the whole Singapore will truly salute both of them. But it ain’t gonna happen.",
                "comment-author": "AdditionalAd9114",
                "replies": [
                    {
                        "body": "All proceeds will go to the Su Haijin Foundation.",
                        "comment-author": "MostRandomPasserby",
                        "replies": []
                    },
                    {
                        "body": "> I never hear they donate even a small percent of their multi-million dollars annual salary to charity before in the past decade at all\n\nyou will just call it wayang",
                        "comment-author": "rpianojam",
                        "replies": []
                    },
                    {
                        "body": "“If announce donate, then got donate to charity.” From that, “Never announce other occasions, therefore never donate other times” is a logical fallacy of Denying the Antecedent. (I’m not claiming I know what the ministers do with their salary, or that I know for sure they have donated money to charity; I’m just pointing out that the argument in itself is a logical fallacy—the one does not necessarily follow the other.)\n\nSeparately, why are you complaining that they are donating any damages just because they earn ministerial salaries? If they *don’t* then the outrage is going to be even worse right?\n\nRelatedly, if ministers or similar announce every time they make a donation to charity, also will have outrage right? Wayang lah, haolian lah, whitewashing lah, earn so much of course better donate lah why must announce, etc.",
                        "comment-author": "flatleafparsley",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Can someone explain what exactly is the crime?\n\nIt seems that people are so desperate for any straws that even a dinner from years back has to be scrutinized.",
                "comment-author": "Book3pper",
                "replies": [
                    {
                        "body": "What do you mean? Any dinner with a known convict by government officials should be scrutinized no?",
                        "comment-author": "pendelhaven",
                        "replies": [
                            {
                                "body": "Their supporter automatically give them discounts. No need accountability as minister has been their way.",
                                "comment-author": "CoolBreath7177",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Calm your tits, keyboard warriors. Some of you guys might say that OYK and CHT are petty, but think about it. If i were to accuse you of cheating on your wife or girlfriend without hard evidence, would you brush it off as it’s nothing? NO. You definitely will want to kill me, or sue me for defamation. \n\nSaying OYK and CHT condoned Su Haijin activities with no real evidence has EXACTLY the same gravity. It has happened with numerous defamation cases in the past where idiots accused our ministers with no hard proof, like the **Return our CPF** saga.",
                "comment-author": "Dorkdogdonki",
                "replies": []
            },
            {
                "body": "if rich sng is as rich as he says he can let them sue him. then we can litigate the truth of what rich sng says in court",
                "comment-author": "pillonanter",
                "replies": []
            },
            {
                "body": "Wow this Facebook user/account is also rather idiotic.",
                "comment-author": "tenbre",
                "replies": []
            },
            {
                "body": "What if a couple hundred of people start to post the same image and make the same allegations? How many people will they sue?",
                "comment-author": "Beetcoder",
                "replies": []
            },
            {
                "body": "The fact they wanna take such strong actions instead of just denying says something doesn’t it…",
                "comment-author": "lolo1994SG",
                "replies": [
                    {
                        "body": "Yup, it says we don’t want to go down the rabbit hole of people making up accusations and having negative politics",
                        "comment-author": "OutsideSimple4854",
                        "replies": [
                            {
                                "body": "Uh huh",
                                "comment-author": "lolo1994SG",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Eh people, you can not like OYK and CHT for all you want, but the dude is really unhinged, just go look at his fb posts.",
                "comment-author": "Fearless_Help_8231",
                "replies": []
            },
            {
                "body": "SUE UNTIL YOUR PANTS DROP HAHHAHAHAHA",
                "comment-author": "dt5622",
                "replies": []
            },
            {
                "body": "Must sue if not not whiter than white.",
                "comment-author": "Zantetsukenz",
                "replies": []
            },
            {
                "body": "Bully kechil",
                "comment-author": "Buang-ing",
                "replies": []
            },
            {
                "body": "Am I the only one thinking Chee Hong Tat is a little complacent?\n\nUnlike Ong, he never put up the press statement on his socials, like he doesn't owe a hint of accountability.",
                "comment-author": "Fonteyn-",
                "replies": [
                    {
                        "body": "Just look at his statements regarding the MRT and my favourite “Public transport fares should not be tied to service levels, disruptions” equivalent to employee telling the boss, bonuses should not be tied to work performance",
                        "comment-author": "Double_Trick2020",
                        "replies": []
                    }
                ]
            },
            {
                "body": "That guy or girl is backside itchy",
                "comment-author": "Jammy_buttons2",
                "replies": []
            },
            {
                "body": "Sng sala",
                "comment-author": "lonewolfgambit",
                "replies": []
            },
            {
                "body": "It just donned on me that Su is out of jail for awhile now",
                "comment-author": "Puzzled-Pride9259",
                "replies": []
            },
            {
                "body": "Sue automatically means false?\n\nNo confidence in them until CPIB clears them.",
                "comment-author": "GeshtiannaSG",
                "replies": []
            },
            {
                "body": "Hahahaaha",
                "comment-author": "ghostcryp",
                "replies": []
            },
            {
                "body": "How come they don't use pofma...or is that only can be used by shan?",
                "comment-author": "tom-slacker",
                "replies": [
                    {
                        "body": "pofma, think someone has mentioned in earlier replies above.\n\nif its making false allegation agst the govt agency such that it paints a wrongful image on gahmen etc, then can use pofma?",
                        "comment-author": "matey1982",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Thanks random Facebook user, Rich Sng, for triggering those ministers into actions that bring more attention to their saga!",
                "comment-author": "Murky_Rough_4110",
                "replies": [
                    {
                        "body": "Thanks to him too because we can finally bring attention to him and his unethical business practices as well!!!",
                        "comment-author": "RegisterEducational9",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Imagine the aftermath if this happens in America...",
                "comment-author": "nestturtleragingbull",
                "replies": [
                    {
                        "body": "You become the president",
                        "comment-author": "laynestaleyisme",
                        "replies": []
                    }
                ]
            },
            {
                "body": "By the way, can they sue or POFMA users on Reddit?",
                "comment-author": "resetsgs",
                "replies": [
                    {
                        "body": "of course they can. Probably a whole team monitoring reddit comments 24/7 :)",
                        "comment-author": "Nefarious312",
                        "replies": [
                            {
                                "body": "Always thought in a channel like this, we are exempted from their claws. Just saw Ho Ching’s comment on this issue and just wanted to tell her to STFU.",
                                "comment-author": "resetsgs",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "123",
                "comment-author": "Superhero_Anonymous",
                "replies": []
            }
        ]
    },
    {
        "title": "Does this lift landing violate some kind of fire code? There is no staircase access or anyway to escape if the lift breaks down.",
        "post-author": "785909620",
        "text": "",
        "comments": [
            {
                "body": "I think these type of units have a back door that is accessible via the staircase",
                "comment-author": "vachelon",
                "replies": [
                    {
                        "body": "Oh that's interesting. Technical they have 2 entrances to their house then.",
                        "comment-author": "Jay-ay",
                        "replies": [
                            {
                                "body": "yes, this kind of house design is from the mid 80s-early90s, hdb doesn't build this kind of layout anymore",
                                "comment-author": "vachelon",
                                "replies": [
                                    {
                                        "body": "The original layout was only 1 main door at the staircase. This layout of 2 doors is not there originally.\n\nThe 2nd door at the lift lobby was only built when these blocks were having their lift upgrading program. The 2nd door leads to the balcony of the house.",
                                        "comment-author": "myshoesss",
                                        "replies": [
                                            {
                                                "body": "yes, indeed this was the case of a post-lift upgrading layout.",
                                                "comment-author": "vachelon",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Yes, there are 2 entrances to these houses. I had been to one, they have 2 main doors :)",
                                "comment-author": "Kaoru_Too",
                                "replies": [
                                    {
                                        "body": "Sounds great - open both to get amazing ventilation",
                                        "comment-author": "kwijibokwijibo",
                                        "replies": [
                                            {
                                                "body": "Both main doors are extreme ends of a u shape, ie not opposite each other and hence forming a wind channel",
                                                "comment-author": "_mochacchino_",
                                                "replies": []
                                            },
                                            {
                                                "body": "Meanwhile, my landlords insist on closing all openings as much as possible. Haiyah.",
                                                "comment-author": "nokman013",
                                                "replies": []
                                            },
                                            {
                                                "body": "My friend bought a resale flat in Yishun like that, but the second one is covered up and in their store room, so kind of defeats the purpose I guess?",
                                                "comment-author": "avilsta",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Yes",
                                "comment-author": "pat-slider",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "These type are usually low storey hdb units(3-4storey type).",
                        "comment-author": "charliebwangzi",
                        "replies": [
                            {
                                "body": "Nope. I'm not quite sure but this might be Yishun. Anyways there are also 12 storeys of this kind of layout.",
                                "comment-author": "Fun-Eye3535",
                                "replies": [
                                    {
                                        "body": "some of the older blks at AMK side also have such unit layout",
                                        "comment-author": "matey1982",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "not really, there's a few blocks near my housing area with such double doors (post lift-upgrading) and at least 13 storeys",
                                "comment-author": "vachelon",
                                "replies": []
                            },
                            {
                                "body": "The blocks are 11 storeys high in my parents' estate, which had these lifts installed 12 years ago.",
                                "comment-author": "bargeboards",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "It does, that’s what u see in the background",
                        "comment-author": "casper_07",
                        "replies": []
                    },
                    {
                        "body": "Yep, it’s true. My relative live in such unit",
                        "comment-author": "tallandfree",
                        "replies": []
                    },
                    {
                        "body": "Yea they do. Ik someone who live in these kinda units.",
                        "comment-author": "GAYBOISIXNINE",
                        "replies": []
                    },
                    {
                        "body": "If any non house owner stuck at that level in the lift + fire + no one at home = GGG",
                        "comment-author": "xDraGonSaInTx",
                        "replies": []
                    }
                ]
            },
            {
                "body": "These flats have two doors. The one you're looking at was retrofitted when the lift was added. The original door is on the far side, that's where the stairs are.\n\nIf you're not a resident of either flat then you can indeed be trapped, but that's not required within fire code.",
                "comment-author": "threesls",
                "replies": [
                    {
                        "body": "My house has two doors, one to the lift and another to the stairs. But I think this can be a hazard and can be feedback to the authorities because in case of emergency, one should be able to exit to the stairs without going thru somebody’s house. Even as a resident, I have to unlock my lift door then my stairs door.\n\nFor my block, there is a door on the metal grill, with no lock. We can exit from the lift to the stairs thru the door without access any houses",
                        "comment-author": "Vjanett",
                        "replies": [
                            {
                                "body": "There's diminishing returns to this kind of regulation; no non-resident is expected to be loitering in this space and all the buildings involved are midway through their useful life anyway. A cost-benefit analysis of retrofitting fire escapes to each landing would be difficult to pass. \n\nThat doesn't mean the scenario is impossible, but all risk management is a matter of probabilities.",
                                "comment-author": "threesls",
                                "replies": [
                                    {
                                        "body": "Fair but now that deliveries are common, they probably use these lift more than us residents. We perhaps use it twice a day, once to head out and once to head home, commute to our levels only. But these deliverymen will stop at most levels etc. \n\nBut again, even as resident, in case of fire, and I’m at the lift, I wouldn’t want to be unlocking my lift door then run in to unlock my stairs door. Every seconds count. (My mum was one of workers at the warehouse fire at Tampines a few days ago and she said if she was just a few min later, she would’ve inhaled an insane amt of smoke). \n\nBut as said, not a regulation so things maybe not done, but no harm to have this brought up to relevant authorities",
                                        "comment-author": "Vjanett",
                                        "replies": [
                                            {
                                                "body": "If you look carefully, there are many areas in single stair point blocks which would be cut off in the event of a large fire too. \n\nResidential units aren't expected to be hoarding commercial quantities of combustible materials, in fairness. Fire rated lifts and fire doors are their main defense against fire. \n\nI do expect eventually tighter regulation on charging PMDs upstairs, even licensed UL2272 PMDs - the possibility of people regularly transporting a powerful electrical fire risk into their homes every day was something planners didn't see coming, I think.",
                                                "comment-author": "threesls",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "There should be another door at the stair side so your best bet is go through the resident home doors i guess.",
                "comment-author": "krcn25",
                "replies": []
            },
            {
                "body": "Because they built the lift after they built the block. The entrance of the house is actually at the staircase side and where you're entering from is actually the back door.",
                "comment-author": "sniktology",
                "replies": []
            },
            {
                "body": "due to the existing structure, HDB upgraded the lifts for some blocks like this but also added a second front gate. this should be the second front gate. the staircase at the back leads to the original front gate.",
                "comment-author": "plumerri",
                "replies": []
            },
            {
                "body": "They have 2 doors. \nI did a lift upgrading project in 2009 and i remember some units are like this at amk ave 6 there.",
                "comment-author": "Kazerin21",
                "replies": [
                    {
                        "body": "Maisonette?",
                        "comment-author": "I_love_pillows",
                        "replies": [
                            {
                                "body": "No, hdb 4 br. If u see at the picture carefully, the lift landing and the staircase landing (where the other door is) is of the same level. \n\nThis lift landing door actually leads to the balcony of the house \n\nSo they have this door opening because their main door is beside the staircase and the new lift landing cannot extend all the way to cut through the staircase hence this new lift landing and door opening.",
                                "comment-author": "Kazerin21",
                                "replies": [
                                    {
                                        "body": "I see it now thank you. Very odd but creative design solution.",
                                        "comment-author": "I_love_pillows",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Ask the house to let you pass thru? In case of fire you not suppose to use the lift anyways...",
                "comment-author": "TheMisterPotato",
                "replies": [
                    {
                        "body": "what if the house owners aren't in and the doors are locked",
                        "comment-author": "sixpastfour",
                        "replies": [
                            {
                                "body": "mati. simple as.",
                                "comment-author": "LEGAL_SKOOMA",
                                "replies": []
                            },
                            {
                                "body": "Then either to call police/SCDF or you die lor",
                                "comment-author": "TheMisterPotato",
                                "replies": []
                            },
                            {
                                "body": "That is when your parkour skills comes in handy. Parkour as in real parkour not some politicians jumping over a bench.",
                                "comment-author": "IForgetAlreadyAh",
                                "replies": []
                            },
                            {
                                "body": ">what if the house owners aren't in and the doors are locked\n\nyou jump off the landing, or you get down to the floor and pray the smoke don't suffocate you - it's the smoke that kills you more often than not.",
                                "comment-author": "neokai",
                                "replies": []
                            },
                            {
                                "body": "![gif](giphy|3CU5tmCJy8zMoN3mMD)",
                                "comment-author": "kwijibokwijibo",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I live in a similar block. Can't you just enter your unit (the 2nd entrance because of this extra lift landing) and exit from the original main entrance down the stairway? All units serviced by this lift have 2 doors. 1 to this lift and another to the common stairway.\n\nIf you're say a delivery man and the lift is stuck after you had exited and delivered the package, besides hoping that a neighbour will let you use their main entrance, the other way is to jump down the gap as shown in your 2nd photo. A little dangerous, but it's something anyone will try if they're stuck in a fire.",
                "comment-author": "Worsty2704",
                "replies": []
            },
            {
                "body": "Looks like a hdb I viewed at bedok north. There is 2 doors",
                "comment-author": "Critical_Bag1",
                "replies": []
            },
            {
                "body": "Speaking of weird HDB designs, can someone enlighten me why some old HDBs, in their original design, you need to take the main lift, go to a certain floor, walk all the way to the end of the corridor, take the staircase to go to your unit? That seems very inefficient.",
                "comment-author": "SnooChocolates2068",
                "replies": [
                    {
                        "body": "I read somewhere that in the early days they don't have the budget to have lift landing on every floor.",
                        "comment-author": "Gorjiam-Another",
                        "replies": [
                            {
                                "body": ">I read somewhere that in the early days they don't have the budget to have lift landing on every floor.\n\nThat's true, somewhat.\n\n* For the square-ish blocks there's a lift lobby every floor as it doubles as the common (central) lobby for all 4 flats at each floor.\n* For the elongated blocks the common corridors are only at the floors where the lift stops. I vaguely recall the floors were 5, 9, 13.",
                                "comment-author": "neokai",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "I live in one of these. It’s because the corner units are single storey EAs and corridor units are dual storey EMs. Odd floors line up with the EM’s second floor, and I guess concerned about privacy, cost, or both HDB decided no corridor outside the EMs second floor. \n\nMost blocks like this (inc mine) eventually get a second lift installed that services the units without direct lift access, which is kinda cool because it’s almost a private lift!",
                        "comment-author": "bubbler_crab",
                        "replies": []
                    },
                    {
                        "body": "Having the lift stop at every floor was a big deal back then. That was real HDB upgrading, people don't understand",
                        "comment-author": "tabbynat",
                        "replies": []
                    },
                    {
                        "body": "Don’t think it’s just some, should be most(/all high-rise?) HDB blocks built up to the 80s and early 90s have just the main lift shaft and the common corridors on select levels (before lift upgrading was implemented), if I’m not wrong. So lifts stopping at every floor—and also multiple lift lobbies at upgraded blocks—even though common nowadays, only started somewhere in the mid/late 90s I believe. (Someone else might know better/more accurately.)\n\nPossible explanations include earlier priority to just house the population in public housing flats as fast as possible, possibly lower budgets (as mentioned by another commenter). And—this is my guess—an efficient way for accommodating different flat types: if I’m not wrong, the common corridor floor units might be slightly smaller/fewer rooms, while the units on the floors without original lift access may be larger/more rooms. (And yes, as in u/bubbler_crab’s experience, some blocks also had dual floor executive maisonette.)\n\nLifts stopping on every floor definitely is more convenient, but also the subsequent lift upgrading for almost all older blocks would also be to take into consideration our ageing population.\n\nRelatedly, there was a recent CNA article about some remaining HDB blocks that can’t be lifted upgraded (or only partially): https://www.channelnewsasia.com/today/ground-up/hdb-lack-lift-access-every-floor-5056871",
                        "comment-author": "flatleafparsley",
                        "replies": []
                    },
                    {
                        "body": "Today lifts are common; the staircases only see use in fires or HIIT. But back when lifts were uncommon, residents on upper floors would have to pass through the staircase landings of each lower floor on the way home, possibly multiple times a day.\n\nThis gave residents on the lower floors a diminished sense of privacy and security due to the large number of people passing by their doors every day. A mitigation was to add a more circuitous route from the landing to the actual front entrance of their apartments. Even a small number of individualized stairs felt more private.\n\nOf course decades later this is generating challenges of its own: https://www.straitstimes.com/singapore/a-few-steps-hdb-to-make-homes-more-elderly-friendly",
                        "comment-author": "threesls",
                        "replies": []
                    }
                ]
            },
            {
                "body": "The doors you see here are new and installed as part of the lift upgrading. The new modern gate kinda gives it away too as being relatively new. It's a whole new extension. Inside the unit, there's another door that will lead to that staircase you see there.\n\nMy uncle stays in a HDB just like this in Chai Chee. They basically have two main doors. One for the lift, the other that has access to the stairs. Very unique indeed but doesn't violate any fire code as long as the area is clear to the stairs. Lift will not be usable during a fire or fire alarm anyway. PS: I'm in fire safety 😉",
                "comment-author": "imranbecks",
                "replies": [
                    {
                        "body": "The area is not clear to the stairs, from the perspective of an individual trapped at the lift landing when a fire occurs and the lift is home to the ground floor in.\n\nFrom pictures 2 & 3, unless one of the home owners is aware and open the doors to whoever visitor / delivery person, that individual will have a high risk of burning to death.\n\nLetting strangers through one's home (in the event of a false fire alarm) is another set of potential risks.",
                        "comment-author": "Ben_133",
                        "replies": [
                            {
                                "body": "There shouldn't be anyone trapped at that lift landing during a fire as the fire alarm bell would sound and the lift would be grounded to level 1 automatically during a fire alarm. No one would be using the lift to go up by then. That's how it all works. Standard protocol for all buildings during a fire alarm. Only way up or down would be by the stairs. In this case down as the only people going up would be firefighters. And residents of those units will exit via those doors that leads to the stairs.\n\nAnd if it's a fire lift, there'll be a key on the top at the ground floor by the lift doors which only firefighters have access to use during a fire alarm to activate the lift to go up.",
                                "comment-author": "imranbecks",
                                "replies": [
                                    {
                                        "body": "Thanks for the reply.\n\nThe fire code should not dismiss the possibility of a delivery guy / visitor waiting at the lift lobby to deliver stuff / visit someone when a fire occurs.\n\nOnce triggered, the lift will close and go to the ground floor, probably not giving the person at the lobby a chance to go down with it, or goes to the correct floor to fetch the person, if the lift's on another level.\n\nThis would mean that the person will be trapped with no plausible way of escaping without intervention?",
                                        "comment-author": "Ben_133",
                                        "replies": [
                                            {
                                                "body": "That scenario has played out as well for us. If really unlucky that were to happen to someone doing a delivery for example and the alarm suddenly sound and the lift goes down and he's stuck there, since he's doing delivery, chances are someone is in the home. And that resident will also need to exit the house to go down. He can ask the resident if he can go through the house and out the other door to the stairs. Or if that fails and no one is home for example, worst case scenario is he has to call 995, let them know where he's at and wait for rescue at the lift landing.\n\nHonestly if it were my design, I would've built a whole new staircase at this new extension as well beside the lift to prevent such a scenario from happening. But naturally HDB doesn't want to spend the extra $$$ to build a new staircase as part of the lift upgrading program 🤷🏻‍♂️",
                                                "comment-author": "imranbecks",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Yes, each unit has two doors (one front and one back). But that's why it's important to make sure both doors are working, because...just in case you find yourself in the worst scenario, with the back door lock being faulty, and being trapped on the floor if there's a fire/lift maintenance going on at the same time. GG sia",
                "comment-author": "georgeybataille",
                "replies": []
            },
            {
                "body": "Unit have 2 doors.",
                "comment-author": "Ok-Control4889",
                "replies": []
            },
            {
                "body": "Technically not a violation of fire code, assuming the units have a separate access to the staircase. The lobby only needs to be connected directly to the exit staircase if it is designated as a fire lift.\n\nThat being said, it is not the most ideal design as there is a small chance of a non-resident getting stuck in this lobby.",
                "comment-author": "joshjuggernaut",
                "replies": []
            },
            {
                "body": "Double storey hdb flats",
                "comment-author": "Few_Swim_4577",
                "replies": []
            },
            {
                "body": "tampines?",
                "comment-author": "Itaintmeboi",
                "replies": []
            },
            {
                "body": "If have 2 doors what's the issue?",
                "comment-author": "hungry7445",
                "replies": [
                    {
                        "body": "If a non resident went to the floor and the lift breaks down/goes under maintenance, the person is basically stuck, especially if there's nobody in the 2 units.",
                        "comment-author": "785909620",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Look like my current flat. Before lift upgrading, the main door leads directly to the staircase. There was no lift at all. \n\nAfter lift upgrade, they added another door to my flat with direct access to the lift. \n\nSo my house has 2 main doors. One to the staircase and another to the lift.",
                "comment-author": "invigo79",
                "replies": []
            },
            {
                "body": "Older hdb have unique designs, this is so much more interesting then the cookie cutter flats now",
                "comment-author": "yagrain",
                "replies": []
            },
            {
                "body": "![gif](giphy|t2eBr71ACeDC0)",
                "comment-author": "LinenUnderwear",
                "replies": []
            },
            {
                "body": "5 room improved slab block.\n\nSo during LUP each unit got an extra door to the lift lobby.",
                "comment-author": "Aquis_GN",
                "replies": []
            },
            {
                "body": "They have 2 doors and the other door leads to a staircase",
                "comment-author": "Regor_Wolf",
                "replies": []
            },
            {
                "body": "looks like maisonette configuration with 2 entrances",
                "comment-author": "cloud_empire",
                "replies": []
            },
            {
                "body": "Is the unit duplex (2 floors HDB) ?\nWith access from both upper and lower floors?\n\nIf yes, then it's ok.",
                "comment-author": "bigbrainnowisdom",
                "replies": []
            },
            {
                "body": "Wow HDB with private lift",
                "comment-author": "superfaroutthere",
                "replies": []
            },
            {
                "body": "Parkour",
                "comment-author": "goldenpummel",
                "replies": []
            },
            {
                "body": "is this private housing?",
                "comment-author": "yerrack",
                "replies": [
                    {
                        "body": "HDB",
                        "comment-author": "785909620",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I know Tampines has such blocks. I have always been curious about the interior.",
                "comment-author": "Ttwk88",
                "replies": []
            },
            {
                "body": "If logically possible, a small unremovable fixed/stationary-railing ladder should be installed at the railing between the 2 hdb doors leading down to the staircase area so that unfortunate visitors that are trapped during unfortunate circumstances can still possibly escape without parkour skills(lol).  \n\n(Bolted ladder starting from between railing of the 2 hdb doors leading down to the other sides staircase flat-turn section.)",
                "comment-author": "BS_MokiMoki34",
                "replies": []
            },
            {
                "body": "When the police don't have 24 hours service and a teeth come into your HOUSE! Or when the house is in fire, the fire engine and fire people.....",
                "comment-author": "guardingcat",
                "replies": []
            },
            {
                "body": "Also prerequisite: need some staircase parkour",
                "comment-author": "Moist_Nothing9112",
                "replies": []
            },
            {
                "body": "Each unit has a door at half floor.",
                "comment-author": "Oscarizxc",
                "replies": []
            },
            {
                "body": "this is an old design, residents should have no issue accessing the stairs. If u are the unlucky one using the lift in a fire (which you shouldnt), then it might be bad luck",
                "comment-author": "Zarathz",
                "replies": []
            },
            {
                "body": "Good for someone with a mistress",
                "comment-author": "Ok-Moose-7318",
                "replies": []
            },
            {
                "body": "Yes, some blocks in Yishun have this design. Wondering whether the owners paid a higher upgrading fee since the contractor had to knock down the wall to create a 2nd access, provide a new door+gate to the new lift and construct a new lift landing. Anyone who went through can share? Keen to know.",
                "comment-author": "One-Contribution2974",
                "replies": []
            },
            {
                "body": "Ah yes bedok reservoir old hdb the most bs design.",
                "comment-author": "fumoffuXx",
                "replies": []
            },
            {
                "body": "Welcome to SILENT HILL:heartlands!!!",
                "comment-author": "Jyuan83",
                "replies": []
            },
            {
                "body": "Won't the 2 doors be a headache for Feng shui?",
                "comment-author": "novablast3r",
                "replies": []
            },
            {
                "body": "You can also be trapped within the lift itself, stairs or not.",
                "comment-author": "stackontop",
                "replies": []
            },
            {
                "body": "My mum's block is like this. The flats have 2 front doors.",
                "comment-author": "Hecatehec",
                "replies": []
            },
            {
                "body": "Every floors like that? Or it is rather low rise building?",
                "comment-author": "VictorMarcWork",
                "replies": []
            },
            {
                "body": "![gif](giphy|9M5jK4GXmD5o1irGrF)",
                "comment-author": "Shoki81",
                "replies": []
            },
            {
                "body": "Is this a 5rm unit ? At shunfu?",
                "comment-author": "pat-slider",
                "replies": [
                    {
                        "body": "This particular unit is beside marsiling station. There are a few like this in serangoon and jurong east too.",
                        "comment-author": "785909620",
                        "replies": [
                            {
                                "body": "Aha. Perfect for extra income",
                                "comment-author": "pat-slider",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "People living in this 2 units must be certified in parkour 🤣",
                "comment-author": "helloween123",
                "replies": []
            }
        ]
    },
    {
        "title": "Man taken to hospital after fire at Jalan Kayu HDB block; power disrupted",
        "post-author": "Iridiumstuffs",
        "text": "",
        "comments": [
            {
                "body": "The moment I saw Jalan Kayu in the headlines I knew I had to dive into the comments section to get myself entertained.",
                "comment-author": "IForgetAlreadyAh",
                "replies": [
                    {
                        "body": "NCM NCM NCM NCM!!!!",
                        "comment-author": "MadeByHideoForHideo",
                        "replies": []
                    },
                    {
                        "body": "Thats right! And they didn't disappoint",
                        "comment-author": "CharacterQuit848",
                        "replies": []
                    },
                    {
                        "body": "All I can say is im entertained 😁🍿",
                        "comment-author": "LegendNumbSkull",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Time for NCM to show concern for this residents.",
                "comment-author": "Automatic_Win_6256",
                "replies": [
                    {
                        "body": "Tomorrow Brother Ng will wayang with a hospital visit",
                        "comment-author": "Tiny-Significance733",
                        "replies": [
                            {
                                "body": "This man had better get up from his bed to greet NCM",
                                "comment-author": "User96198820",
                                "replies": [
                                    {
                                        "body": "Better stand by bed to greet the Sir",
                                        "comment-author": "me_is_KK",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "Better be wearing that Kayu tshirt!",
                                "comment-author": "jmzyn",
                                "replies": []
                            },
                            {
                                "body": "Probably have to invite every media known to existent to join him too",
                                "comment-author": "Rockylol_",
                                "replies": []
                            },
                            {
                                "body": "Did the residents conspire against the MP?",
                                "comment-author": "ZeroPauper",
                                "replies": []
                            },
                            {
                                "body": "“Uncle you gotch buy NTUC insulance?”",
                                "comment-author": "merelyok",
                                "replies": [
                                    {
                                        "body": "“Uncle, your insurance is fiction or serious one?\"",
                                        "comment-author": "Personal-Shallot1014",
                                        "replies": [
                                            {
                                                "body": "\"Uncle your insurance want to change Allianz one or not?\"",
                                                "comment-author": "Purpledragon84",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "A lot of strangers at hospital.",
                                "comment-author": "Tastytwo_toes",
                                "replies": []
                            },
                            {
                                "body": "He'll bring a book to the hospital, possibly ask the victim to stand up.",
                                "comment-author": "Aphelion",
                                "replies": []
                            },
                            {
                                "body": "at least not funeral visit with pap banner",
                                "comment-author": "idiotxd",
                                "replies": [
                                    {
                                        "body": "Liddat the ghost will haunt NCM liao",
                                        "comment-author": "Tiny-Significance733",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Ncm will ask if its fiction or serious injury",
                "comment-author": "AnotherSadLad",
                "replies": [
                    {
                        "body": "If injury wasn't too bad kena Malingering aka sent to DB",
                        "comment-author": "Tiny-Significance733",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Brother Ng time for you to shine",
                "comment-author": "Spiritual_Doubt_9233",
                "replies": []
            },
            {
                "body": "NCM better not ask the poor injured man to stand up when he go for hospital visit",
                "comment-author": "alearningcat",
                "replies": []
            },
            {
                "body": "Ding Dong NCM your time to shine liao\n\n![gif](giphy|DQcqDjL0vcxz7lEhNT)",
                "comment-author": "Shoki81",
                "replies": []
            },
            {
                "body": "First was at Tampines,\n\nNow Jalan Kayu..\n\nEast coast next?  Odd coincidence xD",
                "comment-author": "swimmingpineapple",
                "replies": [
                    {
                        "body": "Punggol also got chance.",
                        "comment-author": "unbeautifulmind",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Wah morning fire, NCM noontime post on FB about it. I’m surprised he’s aware lol.\n\nCalling it now, he’s going to visit the hospitalized guy in his Jalan Kayu tshirt.",
                "comment-author": "ClaudeDebauchery",
                "replies": [
                    {
                        "body": "Never miss an opportunity to wayang",
                        "comment-author": "Tiny-Significance733",
                        "replies": [
                            {
                                "body": "Because only Pritam and gang serve residents with heart. Got it.",
                                "comment-author": "delicious_me",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Lol in before \"who did he vote for\" comments.",
                "comment-author": "jh8223",
                "replies": []
            },
            {
                "body": "Jalan kayu, the new yishun of news",
                "comment-author": "novablast3r",
                "replies": []
            },
            {
                "body": "Chia lat, most comments are talking about ncm instead of the victim 😂",
                "comment-author": "Cm_onster",
                "replies": [
                    {
                        "body": "The victim is the whole of SG man",
                        "comment-author": "Little_Discount4043",
                        "replies": []
                    }
                ]
            },
            {
                "body": "What an unlucky coincidence.\n\nOr lucky opportunity depending on the person",
                "comment-author": "chkmcnugge6",
                "replies": []
            },
            {
                "body": "is it the curse of Bro NCM?",
                "comment-author": "matey1982",
                "replies": []
            },
            {
                "body": "Back to back fires with koh poon koon and now ncm. Fire in flat, fire outside flat and both took pics. Wherever they go, sure got taiji.",
                "comment-author": "Altruistic-Beat1503",
                "replies": []
            },
            {
                "body": "Seems nowadays everyone pay full attention to anything involve with Jalan Kayu, me too. Are we crazy ? 🤣🤣",
                "comment-author": "Recent-Dress-4253",
                "replies": []
            },
            {
                "body": "Jalan Kayu headlines? Better check comments for memes.",
                "comment-author": "etulf",
                "replies": []
            },
            {
                "body": "\"You better stand up when talking to your MP\"\n\nAnyway get well soon.",
                "comment-author": "Careful_Class_4684",
                "replies": []
            },
            {
                "body": "Mr Brother Ng, time for you to shine and show your care for residents!",
                "comment-author": "17122021",
                "replies": []
            },
            {
                "body": "At this rate, I don’t know whether :\n\nA) Jalan Kayu will be synonymous with NCM or \n\nB) NCM will be synonymous with KAYU.\n\n😬",
                "comment-author": "jmzyn",
                "replies": [
                    {
                        "body": "C) NCM will be synonymous with fujian gang money launderer",
                        "comment-author": "Little_Discount4043",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Apparently this is not the first fire of this kind at Jalan Kayu.\n\nhttps://www.straitstimes.com/singapore/2-taken-to-hospital-after-electrical-riser-fire-at-jalan-kayu-hdb-block\n\nMakes you wonder about the upkeep and maintenance of facilities in Jalan Kayu.",
                "comment-author": "mumofevil",
                "replies": [
                    {
                        "body": "NCM already promise to fix all the estate issue left by the predecessor (also PAP)",
                        "comment-author": "Little_Discount4043",
                        "replies": []
                    }
                ]
            },
            {
                "body": "NCM your residents needs you",
                "comment-author": "divergenced",
                "replies": []
            },
            {
                "body": "NCM got learn the ropes from Victor Lye a not? Must rush to the scene and take photos of him with the firemen looking concerned.",
                "comment-author": "Spartandemon88",
                "replies": []
            },
            {
                "body": "Stand by Hospital Bed",
                "comment-author": "Remarkable_Art5221",
                "replies": [
                    {
                        "body": "Victim gets 2 day LD",
                        "comment-author": "Little_Discount4043",
                        "replies": []
                    }
                ]
            },
            {
                "body": "William Lim told Brother NCB to call fire peoples so that brother NCB can shine",
                "comment-author": "Party_Process_6779",
                "replies": []
            },
            {
                "body": "Hospital sianzzzz liao… NCM coming, need to stand by bed….",
                "comment-author": "Viperyeo",
                "replies": [
                    {
                        "body": "Simi hospital, 2 day LD, back to training",
                        "comment-author": "Little_Discount4043",
                        "replies": []
                    }
                ]
            },
            {
                "body": "One of the many mundane things.",
                "comment-author": "Mrtwinkles87",
                "replies": []
            },
            {
                "body": "Ng don’t have the mandate of Jalan kayu",
                "comment-author": "Fakerchan",
                "replies": []
            },
            {
                "body": "don't play play, NCM also worked hard on a public holiday, rushed down to stand in rain & shake hand take photo with SCDF fireman, provide live updates on social media, talk to people & also give orders for RC to open rest & electrical area for affected residents.  \n  \nseems like the electrical box was on fire, and it wasn't the first time in that estate. (previously was at fernvale lodge 447A in March this year)\n\n[https://www.straitstimes.com/singapore/2-taken-to-hospital-after-electrical-riser-fire-at-jalan-kayu-hdb-block](https://www.straitstimes.com/singapore/2-taken-to-hospital-after-electrical-riser-fire-at-jalan-kayu-hdb-block)",
                "comment-author": "meister00",
                "replies": []
            },
            {
                "body": "Everybody bring your helmet, whistle, pail and ID tag down!",
                "comment-author": "divergenced",
                "replies": []
            },
            {
                "body": "So means everyday he camping at some coffeeshop in fernvale?",
                "comment-author": "Iselore",
                "replies": [
                    {
                        "body": "No lah he setup OP/LP at the CC and the RCs",
                        "comment-author": "Little_Discount4043",
                        "replies": []
                    }
                ]
            },
            {
                "body": "The fire in NCM belly overflowing! It's a win for jalan kayu residents!",
                "comment-author": "TheEDMWcesspool",
                "replies": []
            },
            {
                "body": ">fire involved the contents inside an electrical riser\n\nSomeone using it to store items or there was an issue with the electric/electronic equipment itself ?",
                "comment-author": "nextlevelunlocked",
                "replies": []
            },
            {
                "body": "There was also a fire incident that happened in the same area at block 447A, likely from an electric riser.\n\nhttps://www.straitstimes.com/singapore/2-taken-to-hospital-after-electrical-riser-fire-at-jalan-kayu-hdb-block",
                "comment-author": "Beetcoder",
                "replies": []
            },
            {
                "body": "NCM better be doing ops briefing now, and then read serious books",
                "comment-author": "fredredding",
                "replies": []
            },
            {
                "body": "See lah, never properly do guard duty and fire watch. NCM about to tekan you better stand up",
                "comment-author": "Little_Discount4043",
                "replies": []
            },
            {
                "body": "STAND BY HOSPITAL INCOMING 🚨🚨🚨🏥 #STANDUP",
                "comment-author": "Melodic_Main7069",
                "replies": []
            },
            {
                "body": "_All stand by power understand!_",
                "comment-author": "cum_in_peace",
                "replies": []
            },
            {
                "body": "NCM will ask him to come camp and RSI",
                "comment-author": "elalexsantos",
                "replies": []
            },
            {
                "body": "Ask NCM to sayang the resident",
                "comment-author": "NutKrackerBoy",
                "replies": []
            },
            {
                "body": "Yishun residents: Ho sei liao everyone \neyeballs else on Jln KayU!",
                "comment-author": "Hunkfish",
                "replies": []
            },
            {
                "body": "Quality of the average redditporean on full display in this thread",
                "comment-author": "tabbynat",
                "replies": [
                    {
                        "body": "Massive Reddit moment to complain about politics when someone’s life is literally at stake",
                        "comment-author": "CommieBird",
                        "replies": []
                    }
                ]
            },
            {
                "body": "That night, a caped man tells NCM \"You're the symbol of hope I could never be.\"",
                "comment-author": "hugthispanda",
                "replies": []
            },
            {
                "body": "Jalan Kayu is not Kampung lah NCM. Won't burn down. Wayang for what. Never even see my PAP MP make an appearance when there was a fire in my area.",
                "comment-author": "Whiskerfield",
                "replies": []
            },
            {
                "body": "Good to see NCM on the ball.",
                "comment-author": "HeySuckMyMentos",
                "replies": []
            },
            {
                "body": "65% voted for this",
                "comment-author": "gydot",
                "replies": []
            }
        ]
    },
    {
        "title": "McDonald’s to launch first McSpicy Museum at Bugis Junction from May 13",
        "post-author": "Angjigai",
        "text": "",
        "comments": [
            {
                "body": "Ok no but hear me out. Imagine a pop-up event showcasing all the limited time burgers that have ever been released in SG. Each visitor has one token they can use to vote for their favourite, with the winner either making a special comeback, or even a permanent place, on the mcmenu.",
                "comment-author": "Isares",
                "replies": [
                    {
                        "body": "##Make Seaweed Shaker Permanent",
                        "comment-author": "RedditLIONS",
                        "replies": [
                            {
                                "body": "overrated",
                                "comment-author": "banned_salmon",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "No sure how they would even do it, the older burgers are bigger in size. Would they shrinkflate or keep the winners the same as in the old days?\n\nMcdonalds have never responded to shrinkflation claims but from sources like video footage can see that they practise both.",
                        "comment-author": "QzSG",
                        "replies": [
                            {
                                "body": "Just re-price them accordingly",
                                "comment-author": "rieusse",
                                "replies": [
                                    {
                                        "body": "They will reprice up and size down. And maybe even butcher the OG much like McCrispy",
                                        "comment-author": "QzSG",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Bring back kiasu burger.",
                        "comment-author": "CisternOfADown",
                        "replies": []
                    },
                    {
                        "body": "Teppanyaki Chicken McGrill was AMAZING",
                        "comment-author": "trueum26",
                        "replies": [
                            {
                                "body": "Hands down the best menu item I've ever had from Mcd sg. I still think about that sauce sometimes.",
                                "comment-author": "Dovahsheen",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "I never got a chance to try those rice(?) burgers when I was younger. Will definitely vote for that to come back, although I’ve been told I didn’t miss much.",
                        "comment-author": "Prov0st",
                        "replies": [
                            {
                                "body": "MOS burger still makes them",
                                "comment-author": "A_extra",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "What if it gets gerrymandered? /s",
                        "comment-author": "Fearless_Help_8231",
                        "replies": []
                    },
                    {
                        "body": "Bring back the nasi lemak, bolognese and porridge from early 2000s!!",
                        "comment-author": "kopi_siewdai",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Tribute to the unofficial national burger of the country!!",
                "comment-author": "frozen1ced",
                "replies": []
            },
            {
                "body": "National Burger of Singapore",
                "comment-author": "divergenced",
                "replies": []
            },
            {
                "body": "Japan got poop museum. Sg got McLaosai museum",
                "comment-author": "Shoki81",
                "replies": []
            },
            {
                "body": "McLaosai at its glory days",
                "comment-author": "kpopsns28",
                "replies": []
            },
            {
                "body": "I hope bugis junction toilets can handle the increased crowd and loads resulting from this",
                "comment-author": "Emotional_Isopod_126",
                "replies": []
            },
            {
                "body": "Are you ready for the long queue at the toilet due to this museum?",
                "comment-author": "talliepolie",
                "replies": [
                    {
                        "body": "Only give out free 50 mcspicy",
                        "comment-author": "FlipFlopForALiving",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Does McSpicy have so much history that they can setup a museum?",
                "comment-author": "DeeKayNineNine",
                "replies": [
                    {
                        "body": "Culturally sure",
                        "comment-author": "chicasparagus",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Funny that they chose Bugis Junction, a really undersized store relative to the footfall. The aircon there is terrible too.",
                "comment-author": "lesspylons",
                "replies": []
            },
            {
                "body": "Does it include commemorative toilet paper?",
                "comment-author": "gjloh26",
                "replies": []
            },
            {
                "body": "This is just macs trying to distract from the fact that all mccafe is being removed from sg along with most of its drinks and deserts.",
                "comment-author": "DaMonehhLebowski",
                "replies": []
            },
            {
                "body": "Do they have a toilet bowl installed in it as well? To show how our asses spit fire after one Mcspicy",
                "comment-author": "JayKayLay",
                "replies": []
            },
            {
                "body": "Will they showcase the initial size of mcspicy when it was launched",
                "comment-author": "happyluckyme",
                "replies": []
            },
            {
                "body": "\"the first toilet bowl that got destroyed after a mcspicy meal\"",
                "comment-author": "jollyseaman",
                "replies": []
            },
            {
                "body": "Laosai Museum",
                "comment-author": "arunokoibito",
                "replies": []
            },
            {
                "body": "Interesting. Didn't know there is enough history to make a museum. I'm only aware of the downsizing of the patty",
                "comment-author": "Awkward-wine",
                "replies": []
            },
            {
                "body": "The mcspicy museum is the toilet",
                "comment-author": "lozo",
                "replies": []
            },
            {
                "body": "How many toilet bowl in that vicinity though....",
                "comment-author": "tom-slacker",
                "replies": []
            },
            {
                "body": "Tagline: \"Feel the burn ❤️‍🔥❤️‍🔥❤️‍🔥\"",
                "comment-author": "rekabre",
                "replies": []
            },
            {
                "body": "Oh boy there will be free McSpicy\n\nCan imagine the queue already even though it's limited amount hahaha",
                "comment-author": "lead-th3-way",
                "replies": []
            },
            {
                "body": "PLEASE SOMEHOW MAKE SPICY NUGGETS PERMANENT and spicier..",
                "comment-author": "RearryNehnard",
                "replies": []
            },
            {
                "body": "first? like they're going to make more?\n\nidk who asked for this but sure i guess",
                "comment-author": "FdPros",
                "replies": []
            }
        ]
    },
    {
        "title": "'Being underestimated fuels me': Meet the Singapore female race car driver with 30 races under her belt",
        "post-author": "Valuable-Path9747",
        "text": "Wow! Didn’t know we have our own first female racer! Hopefully one day can see her at F1 race! ",
        "comments": [
            {
                "body": "Nice, gonna underestimate her so that she gets fueled!!",
                "comment-author": "MeeKiaMaiHiam",
                "replies": [
                    {
                        "body": "Lmao the title is pretty bad",
                        "comment-author": "Intentionallyabadger",
                        "replies": []
                    }
                ]
            },
            {
                "body": "> If you spot Gladys Lam in her Suzuki Swift Sport on the roads, resist the urge to challenge her to a race. She will not take you on, not because she might lose, but on the contrary, she will outpace you.\n\nNot how anyone makes friends nor is it a strategy to a longer life.",
                "comment-author": "Imperiax731st",
                "replies": []
            },
            {
                "body": "Sadly she is too old and too poor to get to F1",
                "comment-author": "Jammy_buttons2",
                "replies": [
                    {
                        "body": "Not the right discipline either - F1 drivers start open wheel/karting before they’re even teenagers.\n\nSeeing her in a GT4/GT3 endurance race would be a success.",
                        "comment-author": "EAlootbox",
                        "replies": [
                            {
                                "body": "There's been quite a lot of push for female F1 drivers since they should be lighter, therefore more more efficient fuel wise too, but bone density and musculature gets in the way of their success too unfortunately.\n\nAny other race series like you mentioned, is fair game. One more local name to root for in the international sphere at the very least 😄",
                                "comment-author": "LegacyoftheDotA",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Gladys Lam’s passion for cars started when she was a teen. Racing was never part of the plan but her love for driving naturally evolved into competitive motorsports. She is now Singapore’s only active female race car driver.",
                "comment-author": "Valuable-Path9747",
                "replies": []
            },
            {
                "body": "\\>she will never amount to anything\n\n\\>becomes F1 driver",
                "comment-author": "deangsana",
                "replies": [
                    {
                        "body": "Too old and too poor unfortunately",
                        "comment-author": "Significant_Set2996",
                        "replies": [
                            {
                                "body": "you are only going to add more fuel",
                                "comment-author": "deangsana",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I love a ride from her",
                "comment-author": "pat-slider",
                "replies": []
            }
        ]
    },
    {
        "title": "Koufu founders' family buying Caldecott Hill GCB site for S$58 million",
        "post-author": "helloween123",
        "text": "",
        "comments": [
            {
                "body": "No wonder the never ending hikes after hikes in their food and drink prices. Founder family is shopping for GCB..",
                "comment-author": "linkin2999",
                "replies": [
                    {
                        "body": "We're paying for their cost of living 😂",
                        "comment-author": "Grilldieker",
                        "replies": []
                    },
                    {
                        "body": "According to our wise ministers, price hikes are not because of high rentals.",
                        "comment-author": "ziggyyT",
                        "replies": [
                            {
                                "body": "Tired of seeing this thrown around. The original statement was that rentals aren't a significant portion of food prices at NEA hawkers.",
                                "comment-author": "loveforSingapore",
                                "replies": [
                                    {
                                        "body": "So you think that's true?",
                                        "comment-author": "Wheewheewhee",
                                        "replies": [
                                            {
                                                "body": "Yes it’s true, unless the Hawker themselves stupiak over bid",
                                                "comment-author": "helloween123",
                                                "replies": []
                                            },
                                            {
                                                "body": "NEA rental is heavily subsidized.",
                                                "comment-author": "The9isback",
                                                "replies": []
                                            },
                                            {
                                                "body": "Yups. NEA rentals are generally cheap.",
                                                "comment-author": "loveforSingapore",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "You have a choice not to eat their food. I have not eaten at Koufu since Jan 2020.",
                        "comment-author": "DullCardiologist2000",
                        "replies": []
                    },
                    {
                        "body": "Kouf... Kouf..., it is just your imagination.",
                        "comment-author": "fawe9374",
                        "replies": []
                    }
                ]
            },
            {
                "body": ">The property is located less than 400m from Caldecott MRT station. \n\nOrh",
                "comment-author": "gydot",
                "replies": [
                    {
                        "body": "I'm sure easy MRT access is extremely important for these folks",
                        "comment-author": "fateoftheg0dz",
                        "replies": [
                            {
                                "body": "So their servants can work longer and won't get to rest inside the house",
                                "comment-author": "Elifgerg5fwdedw",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Why is this even news?",
                        "comment-author": "anonymous_bites",
                        "replies": []
                    }
                ]
            },
            {
                "body": "This is why a koufu chicken rice stall in an elderly estate’s  hdb shopping center has a rent of 15k per month",
                "comment-author": "helloween123",
                "replies": [
                    {
                        "body": "Looks like the meme, \"how else will the poor landlord afford their next Merc G wagon/yacht/GCB\" is really true.",
                        "comment-author": "nonametrans",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Who knew being a landlord could make so much money. Waiting for the trickledown economics to kick in any day now. /s",
                "comment-author": "law90026",
                "replies": [
                    {
                        "body": "It's dripping into my kopi o kosong.",
                        "comment-author": "potatoesbydefault",
                        "replies": [
                            {
                                "body": "Sir, that's.... the rat pee dripping from the ceiling.\n\nI'll get you a cup elsewhere, we should go. Now. 😥",
                                "comment-author": "LegacyoftheDotA",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Hallelujah! 🙌 \n\nI got a job as a cleaner at the Koufu.\n\nThank you big boss for the job. That salary is so good that i get govt aid, etc Chas, Workfare. Free money \n\n/s",
                        "comment-author": "mystoryismine",
                        "replies": []
                    },
                    {
                        "body": "Reaganomics 101",
                        "comment-author": "FuckYouPayMeRN",
                        "replies": []
                    },
                    {
                        "body": "sorry, you get trickle up instead",
                        "comment-author": "FitCranberry",
                        "replies": []
                    },
                    {
                        "body": "Trickledown economics is not designed to make an average Reddit commentor like you to be multi-millionaire overnight.",
                        "comment-author": "fhjjjjjkkkkkkkl",
                        "replies": []
                    }
                ]
            },
            {
                "body": "no wonder the food in koufu is extremely expensive for no reason.",
                "comment-author": "h0tchoco",
                "replies": [
                    {
                        "body": "The reason is in the headline",
                        "comment-author": "ThetaSalad",
                        "replies": []
                    },
                    {
                        "body": "Not only expensive. Its often mediocre at best.",
                        "comment-author": "pangkydory",
                        "replies": []
                    },
                    {
                        "body": "What do you mean no reason? The reason is literally slapping you in the face",
                        "comment-author": "anonymous_bites",
                        "replies": []
                    }
                ]
            },
            {
                "body": "So this is what my $2 teh o peng is funding",
                "comment-author": "AdministrativePapaya",
                "replies": []
            },
            {
                "body": "Koufu my ass.. took away so many coffee shop and sell my kopi for $2 plus. Their kopi pricing is the most cunning thing they ever did and sadly I have not much choice due to convenience sake but to patronise their overpriced kopi….",
                "comment-author": "TheBoogerMen369",
                "replies": [
                    {
                        "body": "Life hack, go Sheng Siong buy the 50pack tub of Ah Heng kopi-o kosong packs for $7.50, add milk/sugar to taste, save much money. For extra gao-ness in ice coffee, use 2 packs per cup",
                        "comment-author": "anonymous_bites",
                        "replies": [
                            {
                                "body": "Ya man I do that too. I can't cook but beverage is the one thing I can make for myself.",
                                "comment-author": "Far_Bodybuilder_3909",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Why? Since when kopi is a must buy",
                        "comment-author": "feralflace",
                        "replies": [
                            {
                                "body": "It’s a must for me to get to work.. I always pass by coffee shops and try to avoid Koufu ones.. sometimes it’s hard to avoid them since they can be everywhere",
                                "comment-author": "TheBoogerMen369",
                                "replies": [
                                    {
                                        "body": "Just nescafe lo",
                                        "comment-author": "Changosu",
                                        "replies": [
                                            {
                                                "body": "Obligatory /r/fucknestle they're more evil than GCB buying rent seekers \n\nTry another brand",
                                                "comment-author": "livebeta",
                                                "replies": [
                                                    {
                                                        "body": "Aye yes, so many instant coffee options now.",
                                                        "comment-author": "stockflethoverTDS",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "body": "Subscription every month 70 dollars also cheaper if you drink more than one a day",
                                                "comment-author": "iamjt",
                                                "replies": [
                                                    {
                                                        "body": "Instant coffee lol",
                                                        "comment-author": "inspektordi",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "body": "Eh bro actually this problem is more easily solved. \n\nMaybe you are renting and landlord don't allow kettle. But since you're working, I am sure there's a hot water dispenser somewhere. Even blue collar workers I know (retail staff) inside the mall, nursing room have hot water. If you're guy, thick skin a bit, enter when it is empty and get the hot water and gtfo. \n\nI personally like Old Town white coffee. Or I go 7 eleven and get the coffee in a can (sometimes 1 dollar) if I am in a rush",
                                        "comment-author": "mystoryismine",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "No choice leh...",
                        "comment-author": "tabbynat",
                        "replies": []
                    }
                ]
            },
            {
                "body": "koufu really 很有口福",
                "comment-author": "tom-slacker",
                "replies": []
            },
            {
                "body": "Oh... no wonder rental keeps going up.....cool cool",
                "comment-author": "LegPristine2891",
                "replies": []
            },
            {
                "body": "Actually I feel those in malls like City Plaza, etc. They charge cheaper prices compared to malls under those big property developers like Capitaland/CDL/UOL/Far East, etc.\n\n\nThese kind of malls usually have a bit olden feels because the tenants all reject renovation, thus their rental costs are lower and able to afford not charging high prices like regular malls.\n\n\nI got chit-chat with City Plaza tenants before, think they got mention that their rental costs is cheaper by quite a bit than nearby PLQ/PLS/Singpost and Kinex.\n\n\nFor their pricing, and also with air cons overall is good deal for the customers, etc",
                "comment-author": "krikering",
                "replies": []
            },
            {
                "body": "Change to strawless cup, save on straws and add the additional cost of drinks",
                "comment-author": "BakeMate",
                "replies": []
            },
            {
                "body": "Koufu founds probably: Yall dont anyhow say, we increase prices cuz gahmen increase GST, we got no choice, raw materials also increase (ignore what my suppliers say below ok), we already thinking of buying this GCB decade ago so unrelated to increased prices and below average food arh.\n\nStall renters: Our rent increase but raw materials only abit leh still can absorb, but the rent helps\n\nRaw material suppliers: No leh only some food items increase, got some drop quite a bit, across the board not much difference leh, KOUFU even told us they got many outlets tell us charge cheaper.\n\n# Obligatory mega big /s",
                "comment-author": "QzSG",
                "replies": []
            },
            {
                "body": "No wonder. I seldom patronise koufu already for quite some time unless no choice e.g hospital only has koufu",
                "comment-author": "Accomplished-Let4080",
                "replies": []
            },
            {
                "body": "Looks like now we know rent control helps. The margins go to these purchases anyway.",
                "comment-author": "fishblurb",
                "replies": []
            },
            {
                "body": "Ahhh I am sure store rental does not contribute to this purchase",
                "comment-author": "Imaginary_Scholar_86",
                "replies": []
            },
            {
                "body": "Coffee n tea price to go up soon.",
                "comment-author": "creativenomadjukebox",
                "replies": []
            },
            {
                "body": "#Koufuckyourself🥰",
                "comment-author": "Plane-Hurry-2822",
                "replies": []
            },
            {
                "body": "65% voted for it",
                "comment-author": "Puzzleheaded-Cup-251",
                "replies": []
            },
            {
                "body": "Ah, living the dream next to a very busy road and a major highway.",
                "comment-author": "CaravelClerihew",
                "replies": []
            },
            {
                "body": "Must buy from minister, more huat.",
                "comment-author": "Zantetsukenz",
                "replies": []
            },
            {
                "body": "My uni classmate married into that family. Not close to her but will always remember her comment back when we were undergrads - “oh, I didn’t even need to go for an interview” when a couple of us were talking about internships (which she got into one of the firms that we were talking about). Though this was before she met the husband.",
                "comment-author": "c_itylight",
                "replies": []
            },
            {
                "body": "Imagine a hawker husband and wife couple in a hawker stall selling Bee Hoon and Nasi Lemak in 1990 in Hougang have built a remarkable business. Well done.",
                "comment-author": "MolassesBulky",
                "replies": [
                    {
                        "body": "Life in SG is like a Monopoly game.\n\nExcept for Gen Zoomers who is very stupid, choose to join the game late and all the properties on the board already snapped up by other players le.\n\nI can't wait for foreigners to join the SG monopoly.\n\n![gif](giphy|3ohhwFTjV7GPoEqfm0|downsized)",
                        "comment-author": "mystoryismine",
                        "replies": []
                    },
                    {
                        "body": ">1992, when the government launched the Sale of Tenanted Shop Scheme, which gave business owners operating out of shops leased from the Government in the public housing estate to buy over their shops instead of renting them, resulting in more business owners renting out the newly bought shops.\n\nthey transitioned from fnb into a property business off the liberalisation of state assets back then too",
                        "comment-author": "FitCranberry",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "Over $50k in gold coins, cash stolen from veteran artist Koeh Sia Yong’s home while he was in Bali",
        "post-author": "Jammy_buttons2",
        "text": "",
        "comments": [
            {
                "body": "looks like a targeted attack",
                "comment-author": "gydot",
                "replies": [
                    {
                        "body": "Combine that with rather lax security due to Singapore’s low crime rate. \n\nMy relatives don’t even bother to lock doors, just shut the gate.",
                        "comment-author": "t_25_t",
                        "replies": [
                            {
                                "body": "We need to bring back \"low crime doesn't mean no crime\"",
                                "comment-author": "sixpastfour",
                                "replies": [
                                    {
                                        "body": "Yeah I know. But this is the same type of people who use $2k bags, or smartphones to chope seats at a hawker centre. \n\nI was like wtf?! You try that shit anywhere else and your bag/smartphone is gone before you reach the hawker.",
                                        "comment-author": "t_25_t",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "One day they're gonna learn the hard way when an opportunistic thief or a siao long enters their home",
                                "comment-author": "MadKyaw",
                                "replies": [
                                    {
                                        "body": "I always remember the case when the robbers stuff like 9 people in a small bathroom with little ventilation and 6 pass away during a landed property robbery.",
                                        "comment-author": "Brief_Worldliness162",
                                        "replies": [
                                            {
                                                "body": "when was this?",
                                                "comment-author": "MissLute",
                                                "replies": [
                                                    {
                                                        "body": "https://youtu.be/YXz-4mlCaM4?si=vshdlLaKdW0NZkow\n\nI believe 2016",
                                                        "comment-author": "Brief_Worldliness162",
                                                        "replies": [
                                                            {
                                                                "body": "chey i thought happened in sg how come never heard of it",
                                                                "comment-author": "MissLute",
                                                                "replies": [
                                                                    {
                                                                        "body": "Oh sorry it was in Indonesia",
                                                                        "comment-author": "Brief_Worldliness162",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "In my neighbourhood, theres a ground floor house whose windows are always wide open with no grilles, even at night. The front door is also always open with just the gate shut. The family living there like really bochap about security.",
                                "comment-author": "helzinki",
                                "replies": []
                            },
                            {
                                "body": "Amazing security",
                                "comment-author": "pat-slider",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Same thoughts. Someone knew he was away for months and exactly where the valuables were.",
                        "comment-author": "Lhjw3",
                        "replies": []
                    }
                ]
            },
            {
                "body": "must be heartbreaking that they took the cash and gold but not the art",
                "comment-author": "deangsana",
                "replies": [
                    {
                        "body": "They went straight for the valuables.",
                        "comment-author": "loveforSingapore",
                        "replies": []
                    },
                    {
                        "body": "Even burglars have standards ok",
                        "comment-author": "UnintelligibleThing",
                        "replies": []
                    },
                    {
                        "body": "Ouch",
                        "comment-author": "Direwulven",
                        "replies": []
                    },
                    {
                        "body": "Art harder to conceal. Gold and cash cna just put in bag nobody would know",
                        "comment-author": "tallandfree",
                        "replies": []
                    },
                    {
                        "body": "Shows you that whatever the dealers and auctioneers say, art is not an investment",
                        "comment-author": "avatarfire",
                        "replies": [
                            {
                                "body": "A lot more difficult to fence something that is unique, recognisable, easily identified as stolen. ",
                                "comment-author": "ponkanpinoy",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Sounds like the thief broke in just for the gold coins and knew exactly where it was! I bet it was an inside job.",
                "comment-author": "TheFearlessCow",
                "replies": []
            },
            {
                "body": "........ Mr Koeh’s partner, who wanted to be known only as Annie, said Mr Koeh’s son-in-law had stopped by at the end of February to drop off some books at their home, but he did not notice anything amiss.......\n\nHmmm....... hmmm.......",
                "comment-author": "Nnmeer",
                "replies": []
            },
            {
                "body": "sounds like an inside job. my bet is Annie is in on it",
                "comment-author": "dibidi",
                "replies": [
                    {
                        "body": "Annie are you okay, are you okay Annie",
                        "comment-author": "LinenUnderwear",
                        "replies": [
                            {
                                "body": "You've been hit by, you're been struck by ",
                                "comment-author": "pzshx2002",
                                "replies": [
                                    {
                                        "body": "A family member",
                                        "comment-author": "Party-Ring445",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "![gif](giphy|lGkUyj3IrEcvu)",
                        "comment-author": "junglejimbo88",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Likely a targeted attack. Wouldn't be surprised if the thief is linked to someone he knows.",
                "comment-author": "loveforSingapore",
                "replies": []
            },
            {
                "body": "Everything untouched except the coins and cash in that room and in a condo. 100% Inside job.\n\nHousebreakers ransack every room as they have no clue what valuables are available. And they don’t attempt to put back things nicely. If no other units in the Condo have been touched it is very clear.\n\nFeel sorry for him.",
                "comment-author": "MolassesBulky",
                "replies": []
            },
            {
                "body": "POLICE! DO NOT HAVE 24 HOURS SERVICE! AND A THIEF! ENTERS YOUR HOUSE!!!",
                "comment-author": "InvestigatorNew7226",
                "replies": []
            },
            {
                "body": "Most of the condo security in this kind of non atas condo are so fixated on stopping delivery personnel doing work ,making life difficult for delivery personnel with their non exhausting list, rather than to buck up on security checks because they themselves just sit at the guardhouse whole day that is all .\n\nWhereas u see security at Ardmore park will instead guide u where to go and have extra security at each block to ensure that the delivery personnel know where to park and so",
                "comment-author": "Agile_Ad6735",
                "replies": [
                    {
                        "body": "Stayed in a Manila condo/service apt before and the security screening for visitors are a whole different level compared to Singapore \n\n(Although whether one of the security guards would eventually be in cahoots with a criminal syndicate to burgle the residents, is a whole other matter lol)",
                        "comment-author": "Sea_Consequence_6506",
                        "replies": [
                            {
                                "body": "I think the best that condo maybe can do is to like have personal concierge that send small things up like for example I know the orchard residence at ion can does that or either setia at Evelyn road will call the resident to come down n pick up themselves .\n\nThis should be the best for all so that no strangers will go up.",
                                "comment-author": "Agile_Ad6735",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Interlace not considered atas? I have a feeling the victim like to flaunt his wealth and valuables until people or thieves target him.",
                        "comment-author": "blitzmango",
                        "replies": [
                            {
                                "body": "If you are in the world of the rich, The Interlace would be akin to a slum. 1000 units densely packed together with little privacy.",
                                "comment-author": "UnintelligibleThing",
                                "replies": []
                            },
                            {
                                "body": "Atas is like when the condo has units selling at 10m and above .\n\nMaybe insider because even staircase need access card to access",
                                "comment-author": "Agile_Ad6735",
                                "replies": []
                            },
                            {
                                "body": "Far from it. Think Leedon Heights vs Leedon Residence which has Bentleys perma parked in the basement.",
                                "comment-author": "Iselore",
                                "replies": [
                                    {
                                        "body": "you mean Leedon Green? no condo called leedon heights",
                                        "comment-author": "UserWhateu",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Confirm people whom he noe his movements",
                "comment-author": "Swimming_Echidna8966",
                "replies": []
            },
            {
                "body": "Inside job. Jet fuel can't melt gold coins.",
                "comment-author": "EnycmaPie",
                "replies": []
            },
            {
                "body": "Please remember to securely lock your doors and windows if you're leaving your home for an extended period of time.\n\nLow crime doesn't mean no crime",
                "comment-author": "MadKyaw",
                "replies": [
                    {
                        "body": "tbh  if they can get into my high floor HDB window, power to you man",
                        "comment-author": "gydot",
                        "replies": [
                            {
                                "body": "At that point they deserve something for their efforts 😂",
                                "comment-author": "loveforSingapore",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Lesson: get a safe , cheaper than safe deposit in banks",
                "comment-author": "Automatic_Win_6256",
                "replies": []
            },
            {
                "body": "Uncle should have kept his valuables in a safe deposit box instead.",
                "comment-author": "shapebloom",
                "replies": []
            },
            {
                "body": "“While many residents would likely assume that security officers are responsible for keeping intruders out, in practice, it can be difficult for security officers to prevent unauthorised people from entering a condo development.\n\n“At automated access entry points, the ‘unauthorised persons’ can easily follow after or ‘tailgate’ residents,” Mr Chen said.\n\n“And at manned entry points, the ‘unauthorised persons’ can say they are visiting a certain unit and are usually granted entry on that basis, because the security officer may not have the time or capacity to hold the person at the entry point until the visit is confirmed with the resident of the unit.””\n\nOkay, that’s nonsense. Can’t believe I’m supporting the “rich”, but then at unmanned points, you augment with double-door system, or some other means to ensure no tailgating.\n\nFor manned points, you jolly well make sure you get a response from the resident before you let the visitor in. That is the entire point of security. It sounds like this Mr Chen is advocating shirking of responsibility.\n\nWhat next, hiring MPs who don’t speak up in Parliament? Typists who don’t type? Security guards who don’t provide security?",
                "comment-author": "princemousey1",
                "replies": [
                    {
                        "body": "I would like to say tailgating or even just walking into condos is extremely easy. Actually it's the same as walking to a hdb void deck.\n\n\nCondos now just rely on elevator card access lol",
                        "comment-author": "AyysforOuus",
                        "replies": [
                            {
                                "body": "Yes, that’s my experience also. And I feel that even with a double-door system, it will already vastly improve security compared to the single-gantry system.",
                                "comment-author": "princemousey1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Sometimes Singaporeans too naive already, let their guard down too much, no wonder always get scammed or get their stuff stolen",
                "comment-author": "ImpressiveStrike4196",
                "replies": []
            },
            {
                "body": "Inside job",
                "comment-author": "TheBoogerMen369",
                "replies": []
            },
            {
                "body": "Goldmember:\n\nmmm.....I love Ggggoooollllddd.......",
                "comment-author": "tom-slacker",
                "replies": []
            },
            {
                "body": "i cant help but notice how he got 2 aircon in the same room.",
                "comment-author": "jcheonma",
                "replies": []
            },
            {
                "body": "Real question is why did he have $50K worth of cash and gold coins just laying about his home?",
                "comment-author": "aRandomFox-II",
                "replies": [
                    {
                        "body": "is it really a real question?",
                        "comment-author": "gydot",
                        "replies": [
                            {
                                "body": "You telling me you *don't* find that weird in the slightest?",
                                "comment-author": "aRandomFox-II",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "He’s an ah pek who probably doesn’t believe in banks ",
                        "comment-author": "avatarfire",
                        "replies": []
                    }
                ]
            },
            {
                "body": "50k is should not be too much to him, it is probably a year of condo maintenance fees.",
                "comment-author": "rockbella61",
                "replies": []
            },
            {
                "body": "Lucky I keep my coins in my crypto wallet.",
                "comment-author": "accessdenied65",
                "replies": [
                    {
                        "body": "Instructions unclear, crypto wallet got hacked and drained of its funds.",
                        "comment-author": "cinnabunnyrolls",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "'Deep sadness': Doctors, nurses recall intensity of treating victims from River Valley fire",
        "post-author": "Krazyguylone",
        "text": "",
        "comments": [
            {
                "body": "Kudos to the doctors, nurses and those who helped the kids to escape",
                "comment-author": "divergenced",
                "replies": []
            },
            {
                "body": "What a horrible thing to happen to such young children…",
                "comment-author": "Special-Pop8429",
                "replies": []
            },
            {
                "body": "Thanks to the healthcare professionals and the workers and passerbys who helped the burn victims \n\nAnyone knows \n- What the cause of fire is \n- how bad the injuries are for the victims? \n- Is the school making reparations or rendering help to the victims?",
                "comment-author": "FancyCommittee3347",
                "replies": [
                    {
                        "body": "https://mothership.sg/2025/05/river-valley-fire-school-no-explanation/",
                        "comment-author": "InterTree391",
                        "replies": []
                    },
                    {
                        "body": "Accident.\n\nDied.\n\nThe individual is UHNI, don’t need your money.",
                        "comment-author": "princemousey1",
                        "replies": [
                            {
                                "body": "How did the accident happen?\n\nHow bad did they die?\n\nHow much their net worth?",
                                "comment-author": "thrway699",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "No one is hold accountable for this horrific incident?",
                "comment-author": "Far_Car430",
                "replies": []
            }
        ]
    },
    {
        "title": "Commentary: What happened to Singapore’s stock market?",
        "post-author": "risingsuncoc",
        "text": "",
        "comments": [
            {
                "body": "Nothing happened.\n\nAnd that's the problem.\n\nNothing ever happens.",
                "comment-author": "tom-slacker",
                "replies": [
                    {
                        "body": "b-but chud, what if—",
                        "comment-author": "LEGAL_SKOOMA",
                        "replies": []
                    }
                ]
            },
            {
                "body": "This is SG. Capital appreciation is done through real estate. Stocks are “gambling”. ",
                "comment-author": "Maximum_Crazy_8888",
                "replies": [
                    {
                        "body": "Oh my sweet summer child. If only you knew how many Singaporeans were heavily invested in the stock markets outside of Singapore…",
                        "comment-author": "rieusse",
                        "replies": []
                    }
                ]
            },
            {
                "body": "People are buying and holding sg stocks for dividends hence very little trading.",
                "comment-author": "Kind_Badger5971",
                "replies": []
            },
            {
                "body": "I thought this columnist is also the very same person who gave some positive outlook for SGX in another ST article, just barely a month ago?\n\nUnfortunately, the ST article is behind paywall:\n\nhttps://www.straitstimes.com/business/companies-markets/opportunity-knocks-for-s-pore-to-forge-a-healthy-stock-market-to-bolster-its-financial-hub-ambitions",
                "comment-author": "frozen1ced",
                "replies": [
                    {
                        "body": "he's a confused bagholder fudding his own bags or he's already sold at a loss and is just bitter.",
                        "comment-author": "alterise",
                        "replies": [
                            {
                                "body": "Can definitely feel signs of either self-censorship or delusion lol. Asking GIC to invest in the sgx stock market has like a 1 in 10 chance of it happening given it's investment strategy.",
                                "comment-author": "singletwearer",
                                "replies": [
                                    {
                                        "body": "i believe a PAP MP also called for it. quite daft.",
                                        "comment-author": "faptor87",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "He's pissed because he's long the Singapore market and his net worth isn't doing shit... Plus also if you look at certain stocks he writes on, you know which ones he's holding...",
                        "comment-author": "Milk_Savings",
                        "replies": []
                    },
                    {
                        "body": "hoping for a bailout from the peoples wallet",
                        "comment-author": "FitCranberry",
                        "replies": []
                    },
                    {
                        "body": "Archive link is here: https://archive.is/2024.04.20-010511/https://www.straitstimes.com/business/companies-markets/opportunity-knocks-for-s-pore-to-forge-a-healthy-stock-market-to-bolster-its-financial-hub-ambitions",
                        "comment-author": "risingsuncoc",
                        "replies": []
                    }
                ]
            },
            {
                "body": "the lot sizes certainly dont help",
                "comment-author": "scumspork",
                "replies": [
                    {
                        "body": "Yup, it is an obsolete oddity that has no reason to exist besides making the market more complicated. \n\nThis should have been removed 2 decades ago when computer trading became ~~iniquitous~~ ubiquitous",
                        "comment-author": "bitflag",
                        "replies": [
                            {
                                "body": "You mean ubiquitous?",
                                "comment-author": "nicholas294",
                                "replies": [
                                    {
                                        "body": "Ah yes sorry",
                                        "comment-author": "bitflag",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Use Poems Share Builder Plan. Set an amount, and it will invest in the counters you selected.",
                        "comment-author": "Aphelion",
                        "replies": []
                    }
                ]
            },
            {
                "body": "It's full of family-owned businesses that have little interest in increasing the share price or returns to shareholders (in fact it seems that often, keeping the stock cheap is a benefit to them since they can make a low-ball privatization offer down the road)",
                "comment-author": "bitflag",
                "replies": [
                    {
                        "body": "You are right here. This was addressed by a video discussion by the Fifth Person. Listed companies treat investors like ATM machines. When company does well, instead of good capital allocation to make business perform better, they do share buybacks and sabo the shareholders depriving them of dividends and growth in the company's value. It is changing but too slow.",
                        "comment-author": "jinngeechia",
                        "replies": [
                            {
                                "body": ">they do share buybacks and sabo the shareholders depriving them of dividends and growth in the company's value. \n\nHuh? What's the difference between share buybacks and dividends? Buybacks increase share price - you can sell part of your shares to get a \"dividend\".",
                                "comment-author": "troublesome58",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Fucking 25 dollar transaction fee with dbs Vickers for one purchase",
                "comment-author": "unreservedlyasinine",
                "replies": [
                    {
                        "body": "Tbf, if you use cash upfront it’s $10.90, and you do not need to pay custodian fee and you get the stock held under CDP.",
                        "comment-author": "Pretend-Cap-1191",
                        "replies": [
                            {
                                "body": "The expectations today is free. The lot minimum not helping as well. People are even doing fractional shares. Exchange is backwards and is cooked",
                                "comment-author": "Soldierducky",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Nonsense argument. Such stupid fees exist on the New York stock exchange too, point is you need to look for low cost brokers.",
                        "comment-author": "rieusse",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Odd \"first world\" country, top financial centre, with lacklustre equity listings.\n\n  \nSG is just a playground for old money. low tax regime + good infra. that's it. nothing innovative about the governance here. don't be misled",
                "comment-author": "faptor87",
                "replies": []
            },
            {
                "body": "Feels like a self perpetuating problem where the low volumes and undervaluation of non banks makes local tech companies (sea group, grab) seek hk or us markets to ipo, which makes the market lack volume and capital.\n\n\nIf the government is really serious about making it more attractive, it needs a combination of GIC investment into the market like Australia, but also pushing all brokers especially the banks to reduce their commissions in a digital world where the high transaction fees don’t make sense anymore. Make the market as accessible as possible, reduce lot sizes to one, and allow faster settlement of T+1. ",
                "comment-author": "lesspylons",
                "replies": []
            },
            {
                "body": "One word: reputation. \n\n\nThe old timers who have been burnt will know. And so the reputation has gone down the drain.\n\n\nAll the problems from liquidity to lack of listings can be traced to this one problem. ",
                "comment-author": "Available-Log6733",
                "replies": [
                    {
                        "body": "what happened to cause it's reputation to go down?",
                        "comment-author": "singletwearer",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Singapore stock market used to be hot. I recall my mother buying NOL at IPO and held on for a number of years, a journey of $4 to $0.40 before she gave up. I believe my father bought some too, but he was too impatient to hold and he wouldn't discuss these stuff with me. \n\nThen when the former NOL MD became PM, he wanted to share the stock market success with everyone, and overnight, everyone became Singtel shareholders. 1993 was a crazy year. And all bubbles comes to an end, so that bubble ended with 1993, and everyone chased the other bubble, real estate, until the up and coming PM in waiting instituted what was then the first property cooling measures of recent era in 1996.\n\nI always thought it was curious nobody credited him for bursting the bubble before the Asian Financial Crisis. Or perhaps I am ignorant, he caused unnecessary pain to the real estate speculators then?\n\nAnyway, at this point of time, Singapore stock exchange was still hot, and a lot of attention was on Malaysian stocks on what was known as the CLOB.\n\nThen AFC happened, Mahathir fired his Finance and Deputy Prime Minister, some guy named Anwar, instituted currency controls on the ringgit and declared the CLOB illegal and froze all trading and all shares registered on the CLOB would be transferred to a guy named Khan. Singaporean investors were basically Khannibalised, and had to patiently wait for him to transfer the proceeds as he list and sell those shares on the Malaysian exchange.\n\nSo, a hot part of Singapore stock exchange died right there.\n\nThose who think Singapore market lacked volatility are clearly young and not familiar with names like IPC or Soh Chee Wen. Its almost like he would be charged with stock manipulation every few years.\n\nFor a few years, Singapore exchange was full of what we will call meme stock today, stocks that trade with zero bearing to their underlying businesses, and the stock exchange seems confused when it should behave like an exchange and when it should behave like a regulator.\n\nLong story short, a lot of hot stocks will suddenly fail, suddenly fundamentals would matter and Singaporeans start to understand that besides a small number of blue chips, most companies are no better bet than a casino.\n\nAnd as liquidity dried up, even genuinely good growing companies will trade at a discount compared to other exchanges and taking the company private to list in Hong Kong or US was a no brainer, and you can see many successful local names completely skip the listing in Singapore stage.\n\nWorse yet, even if you have a keen eye at stock picking, the inevitable delisting means you will be forced out well before the company can grow 4-10x.  Often, 2-3x is the best one can hope for.\n\nSGX, minus a handful of blue chips, is basically capped upside, and very high chance of 100% loss. Time in this market is almost guaranteed money losing.\n\nThat said, I believe DBS is doing well enough to make US big tech envious.... DBS even had a $1+ dividend payout that coincided with the post liberation day low, which made it looked like it crashed more than it actually did.\n\nI always believe one should only invest in what one knows, and the Singaporean blue chips arent bad investments, esp given the high tax free dividends compared to the US.",
                "comment-author": "red_flock",
                "replies": [
                    {
                        "body": "Good history, and I'll add on the Penny Stock Saga which was probably the final nail in the coffin. I believed the market never fully recovered from this.\n\n[https://www.channelnewsasia.com/singapore/penny-stock-crash-john-soh-chee-wen-quah-su-ling-mastermind-2013-penny-stock-crash-jail-market-manipulation-8-billion-3170531](https://www.channelnewsasia.com/singapore/penny-stock-crash-john-soh-chee-wen-quah-su-ling-mastermind-2013-penny-stock-crash-jail-market-manipulation-8-billion-3170531)",
                        "comment-author": "ZeeZee86",
                        "replies": [
                            {
                                "body": "That's quite recent.\n\nPan Electric saga would be what comes to mind for the prev generation.",
                                "comment-author": "Neptunera",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "SGX is for buy n hold esp the banks/reits. You want to have fun, go to the US.",
                "comment-author": "Altruistic-Beat1503",
                "replies": []
            },
            {
                "body": "It's never on discount. You know how long I have to wait for the stocks to be on discount. In the US it's very often, and I get better yield for the cheap.",
                "comment-author": "ChardAccomplished689",
                "replies": []
            },
            {
                "body": "Poor liquidity and dominated by REITs and banks\n\nOh yeah. Plus many Temasek shitcos \n\nAs minority shareholder, prepare to get FUCKED with no recourse because corp governance here is dogshit.",
                "comment-author": "GlumCandle",
                "replies": []
            },
            {
                "body": "Our leaders keep warning us not to rest on our laurels, yet that's what they're doing. Any surprise?",
                "comment-author": "fitzerspaniel",
                "replies": []
            },
            {
                "body": "Why read this article when you can follow Mak Yuen Teen’s rants on LI",
                "comment-author": "Mynxs",
                "replies": []
            },
            {
                "body": "Any sgx stocks doing well other than banks and reits ?",
                "comment-author": "nextlevelunlocked",
                "replies": []
            },
            {
                "body": "Its closed for vesak day tats what…..",
                "comment-author": "Tictactoe1000",
                "replies": []
            },
            {
                "body": "and the article get things completely wrong. \n\nas if low liquidity has no causes.",
                "comment-author": "faptor87",
                "replies": []
            },
            {
                "body": "More attractive and easier to invest overseas. Don’t even know how to buy sg shares…? Poems or some shit is still a thing ?",
                "comment-author": "wirexyz",
                "replies": []
            },
            {
                "body": "Closed. It's Vesak Day!",
                "comment-author": "cinnabunnyrolls",
                "replies": []
            }
        ]
    }
]