[
    {
        "title": "Am I in the wrong?",
        "post-author": "bear423423",
        "text": "Just today I asked my boss if I could work 25-30 hours per week during the upcoming summer season. I figured 25-30 hours a week would give me enough social time (I am a graduating high school senior), and enough time to do some side hustles I usually do each summer. He told me no, and instead said I would be working 40 hours every week, even though I am considered a part time employee. We got into a bit of an argument, to the point of me saying that I would rather just switch jobs to a place that would respect my time and availability, rather than work full time. Of course I got the “you’re entitled” talk, but I’m not entirely sure if I am or not in this situation. Am I in the wrong?",
        "comments": [
            {
                "body": "Presumably since you're a high school student this is an entry level retail or food service type job? And it sounds like this is also not a job you desperately need? Cool, time to practice assertiveness! Don't quit and don't ask permission. Let your boss know, in writing if possible, that your availability is no more than 30 hours per week. If he schedules you for more than that, remind him (again, in writing, texting is fine) that you're only available for X number of shifts and ask which day/s he'd like you to drop. When he says you have to work all of them, let him know that that's unfortunately not possible and ask again if he'd like to decide which shift to reschedule or if he'd rather you pick. Depending on how desperate they are for people and how power trippy he is this will either result in grudging capitulation or an invitation to find a new place of employment, which you were planning to do anyway. Whatever you do, do NOT roll over and work the extra shifts unless you want that to become a pattern in your life.",
                "comment-author": "LuckyHarmony",
                "replies": [
                    {
                        "body": "Why give himself the headache engaging in a back and forth battle where the manager will probably be doing whatever he can to guilt OP into working 40 hours a week even though he's considered part-time. Why do that extra battling?\n\nQuit, find another job where the manager will respect OP's time.",
                        "comment-author": "Goat_boy67",
                        "replies": [
                            {
                                "body": "Because this is a kid who has no idea how to stand up for themself and this is a perfect, low-risk situation in which to build that muscle. Ultimately they will probably end up having to find another job, but in the meantime they're learning how to respectfully draw a reasonable boundary.",
                                "comment-author": "LuckyHarmony",
                                "replies": [
                                    {
                                        "body": "Nice, great advice!",
                                        "comment-author": "Odd-Entrepreneur-449",
                                        "replies": []
                                    },
                                    {
                                        "body": "I really don't think the kid should be worrying or thinking about battling a manager for life experience as some ultimate objective.\n\nQuitting with your dignity intact, with your self-assurance intact and with the character building aspect of finding a better job, knowing that you had the courage to leave a lesser one. This is much more valuable than engaging in some Phantom character building life lessons in forcing oneself to stay at a demeaning job with a demeaning manager.",
                                        "comment-author": "Goat_boy67",
                                        "replies": [
                                            {
                                                "body": "So next time (and there will be a next time cuz lots of leaders will be like this), at a job OP wants to keep, they will have the tools to set boundaries and talk thru issues like a reasonable adult. Negotiating is a needed skill that is fine tuned thru each of these convos. Think of your dignity when you learn to ask for what you want and actually get it. This is such a great opportunity to be a little uncomfortable in a personal growth building moment.",
                                                "comment-author": "beccabebe",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "I’m not a labor lawyer but it seems to me that if you worked 40 hours a week you would be full time, no? That sounds dodgy, and I would not hesitate to find a job that fits your needs better. Congratulations on graduating!",
                "comment-author": "citygirl_M",
                "replies": [
                    {
                        "body": "Probably counts as a temp.",
                        "comment-author": "Megalocerus",
                        "replies": []
                    },
                    {
                        "body": "It's common practicen unfortunately. Keeps them from paying benefits and getting 40hrs from people who don't know better.",
                        "comment-author": "KingGinger3187",
                        "replies": []
                    },
                    {
                        "body": "Many years ago I worked for the post office, I was part-time working 72 hours a week",
                        "comment-author": "Spirited_Statement_9",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Ok, here's one big life pro tip: never telegraph your next move when someone is being a jerk to you. So, in this situation, don't tell your boss he's making you think about quitting. Just find the new part-time job and quit. If a boyfriend is yelling at you, get yourself to a safe place and then dump him. If a friend is suddenly undermining you, ghost the crap out of them.\n\nIn any situation where a person is treating you with such disrespect, and calling you names (YOU'RE entitled? I think he was projecting), end the relationship. Telling them \"stop being disrespectful or I'm ending this\" only gives them the chance to argue, call you more names, or worse, plan ways to harm you (professionally, emotionally, reputationally, physically). Get yourself away from the MF er and end it from a distance. \n\nIn your entire life you might be in a situation where you \"owe\" someone an explanation once or twice. This ain't one of those times.",
                "comment-author": "BitterDoGooder",
                "replies": [
                    {
                        "body": "I agree don't overshare",
                        "comment-author": "R0ck3tSc13nc3",
                        "replies": []
                    },
                    {
                        "body": "This is great advice if you want to die alone and friendless.",
                        "comment-author": "barclay3t",
                        "replies": []
                    }
                ]
            },
            {
                "body": "You are entitled! Entitled to make your own decisions on work!",
                "comment-author": "Mindless_Road_2045",
                "replies": []
            },
            {
                "body": "In life, you are entitled to what you want badly enough to go after. You tried going after the hours you want with your current job. It didn't work!\n\nYou are entitled to go after a different job that better suits your needs! If you focus and interview well, you are entitled to that job. \n\nYou are not entitled in general for asking for what you want. But you are still able to find what you want. \n\nGo out and do it! You're not obligated to keep that job. Get one that has hours that work for you. \n\nYanw!",
                "comment-author": "fromhelley",
                "replies": []
            },
            {
                "body": "Also, consider contacting the Department of Labor in your state, to inquire if an employer forcing you to work 40 hours a week entitles you to benefits.",
                "comment-author": "Happy-Maintenance869",
                "replies": [
                    {
                        "body": "Is this legal?",
                        "comment-author": "Friendly-Channel-480",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Just tell him you can work part time or no time.",
                "comment-author": "landonburner",
                "replies": []
            },
            {
                "body": "It sounds like you were aware summertime meant full time hours, or why did you have to raise the 25-30 hours for summer?",
                "comment-author": "cowgrly",
                "replies": [
                    {
                        "body": "Bringing up the 25-30 hours during school holidays is normal for kids where I live, because they're letting their employers know how much their availability is increasing during the break.",
                        "comment-author": "Boofy_Boofhead",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Nope. Find something else",
                "comment-author": "Rough-Flower8580",
                "replies": []
            },
            {
                "body": "I did this in HS. Don't let them push you around. They get what you give them or they get nothing.",
                "comment-author": "Trees_are_cool_",
                "replies": []
            },
            {
                "body": "Just go find another job. You might be behaving entitled but you are in fact entitled to your time. No job is worth your boss ignoring your availability, especially at your age. Don’t use them as a reference and let any potential employer know your availability upfront. Good luck.",
                "comment-author": "Playful-Web2082",
                "replies": []
            },
            {
                "body": "Sometimes the answer is that you each have a valid opinion.  You don't want to work more than 25-30 hours a week.  That's fine.  Your employer wants people who can work 40 hours a week.  That's also fine.  You're not wrong for wanting more free time.  They're not wrong for wanting to fully staff their place.  So quit, and go work for a place that only needs you for the 25 hours a week that you want to work.  Let your current place hire in somebody who is willing to work more.",
                "comment-author": "sephiroth3650",
                "replies": []
            },
            {
                "body": "You are allowed to decide these things for yourself. A part time summer job in/fresh out of high school doesn't have rights to your time.",
                "comment-author": "IHateLovingSilver",
                "replies": []
            },
            {
                "body": "Start looking now.  \n\nHit up his biggest competitor with your scheduling needs. \n\nTell your current boss, in writing that you need what you need.  \nIf he says no, be prepared to hand him your resignation, and go directly “across the street”.",
                "comment-author": "Old-guy64",
                "replies": []
            },
            {
                "body": "Check the Labor laws for where you live. In many places, full time hours means full time benefits, even if they want to class you as 'part time'. Assuming you are covered by such legislation, ask him about your full time benefits, and he'll back down quickly, but then also probably fire you. Basically, find another job.",
                "comment-author": "Boofy_Boofhead",
                "replies": []
            },
            {
                "body": "No one can \"force\" you to work any more than you choose to work.  There are always consequences to your choices.  You can check your local labor laws about what is required at certain hour/employment levels.  Most places consider 38-40 hours as full time and that comes with benefits.  Keep looking for a place of employment that more fits what you are looking for.  Good luck!",
                "comment-author": "wannagetcock2",
                "replies": []
            },
            {
                "body": "How many hours were you hired to work?",
                "comment-author": "0bxyz",
                "replies": []
            },
            {
                "body": "Over 30-35 hours is considered full time in some areas so I hope your getting bennifits if not look up you local labor laws and you contract with the company to see what your rights are. I bet you if you demand full time benifits he’ll shorten your hours all right",
                "comment-author": "Hellswolf08",
                "replies": []
            },
            {
                "body": "If in the US then yes, you would be considered in the wrong for refusing the hours.  US employers generally set work schedules and hours and for the reasons you describe, they don't have to accommodate you.  On the other hand, and again if you are in the US, for benefits purposes (and if there are 50+ employees), 30 hrs a week is considered full time.",
                "comment-author": "SpecialKnits4855",
                "replies": []
            },
            {
                "body": "No, you’re not wrong. There are other jobs.",
                "comment-author": "OfferMeds",
                "replies": []
            },
            {
                "body": "No, but you better look for a job that will allow those hours",
                "comment-author": "DrMindbendersMonocle",
                "replies": []
            },
            {
                "body": "You're absolutely not entitled.  Doesn't it kind of sound like he is?  He assumes he can dictate your hours when you've already mentioned you have other jobs lined up?  \n\n\nThink of the definition of entitlement.  What exactly makes him presume that you're entitled?  Are you asking for more pay?  Prime time hours?  More overtime?\n\n\nA working relationship goes both ways.  You sound like you want to make the most of your summer and any senior should want to.\n\n\nWhat entitlement is is grown adults intimidating teenagers for less pay and more hours.\n\n\nYou will lose nothing by very respectfully quitting and finding another part time job that coincides with your side gigs and social life.  You'll do just fine.  He now, has to replace you.  Oh well 🤷‍♀️",
                "comment-author": "Miserable_Pea_733",
                "replies": []
            },
            {
                "body": "You are hired as part time, he can’t make you a full time employee at his will. That’s not how that works, he can however let you go if your labor laws cover it.",
                "comment-author": "FlounderAccording125",
                "replies": []
            },
            {
                "body": "He is abusing your rights as an employee. Full time hours means medical benefits. He is the entitled one. You are not being entitled!",
                "comment-author": "Ecstatic_Pepper_7200",
                "replies": []
            },
            {
                "body": "You need to understand. During the summer, and you don’t want to work that much us you’re decision. Just realize you may not get hired elsewhere. Every summer I worked 40-60 hours based on my profession and my desire to have cash during my school year.",
                "comment-author": "indyarchyguy",
                "replies": [
                    {
                        "body": "They're a high school senior. That's their profession.",
                        "comment-author": "Boofy_Boofhead",
                        "replies": []
                    }
                ]
            },
            {
                "body": "you’re literally a kid. he’s taking advantage of you. make sure you’re getting paid for every single hour and if not report him to the dept of labor. he sounds like a shitbag",
                "comment-author": "EvenSkanksSayThanks",
                "replies": []
            },
            {
                "body": "Your a fucking kid…. Quit. This is a high school job nobody is going to care.",
                "comment-author": "DSMRob",
                "replies": []
            },
            {
                "body": "How many hours a week were you hired to work?",
                "comment-author": "fabyooluss",
                "replies": [
                    {
                        "body": "They're in high school, so it wouldn't be 40.",
                        "comment-author": "Boofy_Boofhead",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "Boss wants me to write bullying incident.",
        "post-author": "HikerZe",
        "text": "I've been at this company for a couple months now. After being hired by my boss he took a step back and an interim manager took over. Initially we got on fine but since then she has gotten frustrated when I ask for support and tells me to 'get on with it' or 'figure it out'. \n\nThe other week I had a telling off for helping a client who came to me. This client used to be my managers but no longer because they didn't get the help they needed. It seemed like a massive overreaction to me. My colleagues were within ear shot and I felt humiliated.   \n  \nI went to my boss with my concerns of this hostile behavior and mentioned he has issues with her before. In fact one of my colleagues contacted my boss about my manager yelling at me. My boss now wants me to write a short statement about any of the bullying behaviors. He said he wants a record to keep track of any incidents. I'm worried if I do it's going to fall badly on me somehow. My boss is head of department and one of the senior leaders in the company. I kinda just want to move on and keep my head down but not sure what the right thing to do is.  ",
        "comments": [
            {
                "body": "Don’t feel bad about telling the truth. You’ve been invited to make a record of the hostile behaviour which should tell you that you have support and care from those higher than this person. \n\nYou will probably find the manager acts nicer to you (even if it’s fake) if they know their card is marked. If they are stupid and carry on the behaviour then they are just validating the evidence and pretty much signing their own death warrant.\n\nYou have done nothing wrong and nothing to fear.",
                "comment-author": "tetsu_fujin",
                "replies": []
            },
            {
                "body": "You need to write down what you told your boss, then record any future incidents.  It’s a direct ask so refusing would not only be insubordination, but disrespecting him by asking for him to intervene without you giving him what he needs to do so. Without a record of incidents, you look like a complainer making trouble. If your records turn out to be used as evidence against you, it could be that you are indeed the trouble maker.\n\nIf you “just want to move on and keep [your] head down,” you don’t go bringing complaints to your boss, you shut up and keep taking shit until you lose all self-respect and  any respect from your colleagues until you’re eventually bullied into quitting or terminated for cause after your bully wages a campaign of character assassination and turns everyone against you.",
                "comment-author": "texcleveland",
                "replies": []
            }
        ]
    },
    {
        "title": "I think i have strep throat but my employer is extremely strict with everyone calling out even if were sick. what should i do",
        "post-author": "Super_Aioli",
        "text": "i started having a sore throat this afternoon around 12 and it just keeps getting progressively worse it feels like i’m swallowing shards of glass and i just keep sweating or getting freezing really fast my employer sucks and gets mad or asks for a drs note if we call out even though it’s not company policy and it’s money that comes out of my pocket. i don’t wanna go into work sick and infect all of my patients because i work in healthcare and im really just stuck on what to do? any advice?",
        "comments": [
            {
                "body": "Strep can be quite severe if you get it as an adult and don't take care of it quickly. If you can't get to your primary care doc, see if there's a \"doc in the box\" (aka: urgent care) that has online appointments and sign up for one asap. You need antibiotics. \n\nStrep killed my mother's kidneys, and put a friend into a coma for 4 months. DO NOT ignore it!\n\nIt's often quite minor in kids but quite severe in adults.\n\nThe doc should be able to give you a letter to download and print for work.",
                "comment-author": "mataliandy",
                "replies": [
                    {
                        "body": "Scarlet fever is no joke",
                        "comment-author": "Man_under_Bridge420",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Take this seriously; see a doctor. And make sure the doctor writes you a note. Then inform your employer that strep is contagious and you might infect the entire company and have the entire business shut down, so as a responsible employee you need to stay out until it’s over.",
                "comment-author": "ktappe",
                "replies": []
            },
            {
                "body": "Go to the doctor. Get a test, note and antibiotics. If positive, you are contagious and need to have at least 24 hours of antibiotics and no fever before returning to work.",
                "comment-author": "Sorcha9",
                "replies": []
            },
            {
                "body": "If you think it’s strep you really should do yourself a favor and go to the doctor. Antibiotics will make this whole thing so much better and you will get well in days instead of weeks and weeks and weeks.",
                "comment-author": "RedApplesForBreak",
                "replies": []
            },
            {
                "body": "I can't believe you are even questioning it. And you're in healthcare? \n\nStrep throat is extremely contagious, not to mention you can't function properly when you can't talk or swallow. \n\nGoing into work knowing this is putting the entire staff, and It's patients, in harm's way. It's not an option, you HAVE to stay home, come back when you are healthy.",
                "comment-author": "TheGhostWalksThrough",
                "replies": [
                    {
                        "body": "i’m questioning it because im pretty sure it’s my coworker who gave it to me last week she came in with it unmasked because they forced her too now i did call out they said only for today bc they can’t find coverage but that really isn’t my fault at all",
                        "comment-author": "Super_Aioli",
                        "replies": [
                            {
                                "body": "They didnt force her ",
                                "comment-author": "Man_under_Bridge420",
                                "replies": [
                                    {
                                        "body": "they definitely did they threatened firing her over it",
                                        "comment-author": "Super_Aioli",
                                        "replies": [
                                            {
                                                "body": "Fired for what?",
                                                "comment-author": "Man_under_Bridge420",
                                                "replies": [
                                                    {
                                                        "body": "Not showing up to work most likely.  Sounds like an at will employer in the U.S.  I’ve heard of local employers firing people even when they have a doctors note.",
                                                        "comment-author": "ItaJohnson",
                                                        "replies": [
                                                            {
                                                                "body": "Its a sick day. A short staffed employer isnt going to fire an employee for a sick day\n\nGotta learn to call bluffs and brush up on employment law",
                                                                "comment-author": "Man_under_Bridge420",
                                                                "replies": [
                                                                    {
                                                                        "body": "Employers in Oklahoma have been known to do so.  One being a health insurance company.  This state is at will, and my employers have been more than happy to rub that in my face.",
                                                                        "comment-author": "ItaJohnson",
                                                                        "replies": []
                                                                    },
                                                                    {
                                                                        "body": "it happens all the time in florida it has happened to me already before",
                                                                        "comment-author": "Super_Aioli",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "body": "i’m in an at will state they can fire us for no reason or just whenever they want",
                                                        "comment-author": "Super_Aioli",
                                                        "replies": [
                                                            {
                                                                "body": "What state, some have protection laws for sick leave",
                                                                "comment-author": "Man_under_Bridge420",
                                                                "replies": [
                                                                    {
                                                                        "body": "florida most definitely doesn’t other then fmla but you have to be at my company 12 months before eligible",
                                                                        "comment-author": "Super_Aioli",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "it’s not my boss that’s the issue tbh it’s the upper levels like HR",
                "comment-author": "Super_Aioli",
                "replies": []
            },
            {
                "body": "Give it to them",
                "comment-author": "FlounderAccording125",
                "replies": []
            },
            {
                "body": "You need to go see a DR. promptly.",
                "comment-author": "SadLeek9950",
                "replies": []
            },
            {
                "body": "Go to Dr get a note and a script. Strep is awful! Feel better.",
                "comment-author": "Sleepygirl57",
                "replies": []
            },
            {
                "body": "If you are in the US, what state?",
                "comment-author": "SpecialKnits4855",
                "replies": [
                    {
                        "body": "florida",
                        "comment-author": "Super_Aioli",
                        "replies": [
                            {
                                "body": "Your employer can require the doctor's note before you can return.  For the reasons others stated, stay out of work until you are no longer contagious.  You could look into short term disability if your employer offers it, but most policies have a 7 day waiting period.  I realize this all sucks, but this is the best you can hope for in FL.",
                                "comment-author": "SpecialKnits4855",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "If it’s strep, you need to go to the doctor anyway.  So do that and get your note AND (more importantly) antibiotics.",
                "comment-author": "ThisTimeForReal19",
                "replies": []
            },
            {
                "body": "go to dr get dr note your state employment dept will adhere to unlawful termination",
                "comment-author": "rmpbklyn",
                "replies": []
            },
            {
                "body": "i’m in an at will state so they can fire me for any reason",
                "comment-author": "Super_Aioli",
                "replies": []
            },
            {
                "body": "Just go to the doctor, get a strep test, and get a note.",
                "comment-author": "Munchkin_Media",
                "replies": []
            },
            {
                "body": "This is how Covid began in a lot of cases. Super sore throat. It will progress quickly!",
                "comment-author": "Common-senseuser-58",
                "replies": []
            }
        ]
    },
    {
        "title": "Depressed in corp work due to work changes. Would love to hear thoughts on what I should do?",
        "post-author": "eitherrideordie",
        "text": "Work in a corporate environment, usually a place deemed as very secure/safe. But recent changes (not political US) have meant a large number of the workforce has been placed on redundancy. I do the configuration of these two systems. And my manager, architect and Project manager have all been moved off.\n\nI was already a few levels (pay wise like $30K) like under them, and now I'm having to do a large part of their work. While my new manager just hands off every and any new stuff partly because he doesn't know much about it.\n\nBefore it was just configuration but now its the whole thing, the business requirements, the development, the testing the customer discussion. All of it.\n\nMy new manager looks after like 4 teams (full teams) so he's busy and I feel any time I even try to ask what new thing he's giving me or what its about it comes off like I'm being difficult.\n\nTo be honest I'm also just sad because I worked with my manager for 5 years and the architect for 2 and the way they got rid of them like it was nothing. They also do and know so much stuff that now people seem think I'm supposed to somehow pick up all that management shit?\n\nMorale is also very low department wide, every person I talk to is unhappy or feel like they got screwed over bad enough they just bailed. Others treat you with this air of \"do whatever I say\" because they are worried about their roles too and so are trying to appease management.\n\nPart of me wonders whether I should look at getting out, but its about now I'm realising I'm not well placed Resume wise, not many places configure this system on its own. And jobs aren't huge right now either. I'm getting a new manager in a month and I'm not sure if thats a good or bad thing (depends what they are like I guess). But of course the idea that it means they can replace me worries me. Though I guess management was okay getting rid of everyone around me purely because they knew I was staying and I'm the only one that knows how the system is set up currently.\n\nBut actions aside, I just went into work today feeling super depressed today, depressed about the future, depressed about my life. I don't even feel like hussling, i know I should get certs, training, experience, but I just want it to stop for a bit and everyone to stop being shitty when they message me on Teams LOL.",
        "comments": [
            {
                "body": "Honestly, you should update your resume and start looking. You will at least feel more in control of the situation if you’re causally job searching and on the way out. Plus it gives you time to look at your resume and start working to improve any gaps",
                "comment-author": "Ok_Platypus3288",
                "replies": [
                    {
                        "body": "Thanks for this, maybe your right, it will at least make me see what I need to be more \"employable\" and give me some idea that I'm actually doing something or working towards it. At least I will have that backup ready to go too if all gos south to just apply, apply, apply.",
                        "comment-author": "eitherrideordie",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "title": "How to tell my work I want to quit?",
        "post-author": "mind_thoughts",
        "text": "Sorry in advance for a long post. I need some advice. Im a part-time employee, and the other part-time student. Thought my school year I wanted to find a job in my field and I found a good enough at the time. It offered flexible hours. I’ve been working at this job for 8 months and I hate it. The job description was not accurate. I though I would be an assistant but Im doing my project managers work. I though maybe ir was normal because all the assistants that work with me are doing the same but as I’ve heard from my friends that are in the same field its not normal. Im constantly stressed and I hate going to work. Recently they let go of one of the assistants and the work load got bigger. I was debating on quitting next month but my project manager is asking when my school year is ending, because she want me to work full time. I dont know what to do. I dont know how and who to tell that I want to quit. I dont know if I should quit because its pretty hard to find a part time position as a student in my field and I kind of need the money. Also I dont really have a good enough reason to quit. Also I feel bad because recently they paid for a work vacation kind of thing. I just need some advice please im so depressed and desperate ",
        "comments": [
            {
                "body": "Wanting to quit is a good enough reason to quit. That's all the reason you need, and that's the only reason you need to give.  I'm an employer, people move on.",
                "comment-author": "oyecomovaca",
                "replies": []
            }
        ]
    },
    {
        "title": "Hostile Work Environment",
        "post-author": "SomePollution2815",
        "text": "Hey guys, I’ve been dealing with some issues in my job that relate to the above header. I work for a retailer, starting off in a retail job and then applied for a job on the e-commerce side of it at their head offices. I did this for job security as me and my partner are saving for a mortgage and it will improve our chances of I’m shown working for the same company for so many years. The company has always had this air of “casualness” about it, promoting itself as a cool business where cool people work, and encouraging staff to be outwardly friendly. In the head office, it’s kind of the same. It’s got the “Google offices” treatment where there’s fairy lights everywhere, posters on the walls, a diverse cast of employees, and we even have a fun atmosphere. I’ve been here now for almost a year, and I still feel extremely othered by my coworkers. They all have their friend groups, which is fine but when it’s such a small team it’s left me on my own in the corner sometimes. I don’t mind this too much, I’ve always been socially awkward and I just keep my head down and do my work. When I chat to them it’s always friendly, and they do talk to me — except when my boss just decides to not like me. I was sick for a few weeks and when I came back I got the silent treatment from him. And when my coworkers see him deliberately walling me off it’s like they follow suit without needing to be told. It’s now three weeks since I was on sick leave, and my boss is still being passive aggressive towards me. Any time I speak he interrupts me or cuts in to put me down and end the discussion. It’s like I’m constantly getting shut down, and I’ve just started not talking at all when there’s a conversation going because it’s better than getting hurt. The only thing is, this is all really affecting my mental health. I come into work now everyday happy and cheerful, and leave defeated with a low self esteem. I’ve tried so hard to overcome it but it really hurts feeling so belittled every single day. I feel like I can’t talk to anyone about it at work because we don’t really have a HR department in our territory, and even then I would be forwarded to talk to my boss about it. To involve another HR department from the main territory is more hassle than it’s worth because they are utterly useless. \nDoes anyone have any advice on how to deal with something like this? I’m just at such a loss for words. ",
        "comments": [
            {
                "body": "The legal definition of HWE in the workplace is harassing behavior due to your race, gender, disability, and other protected classes.\n\nBeing \"othered\" by your coworkers and getting the silent treatment from them doesn't meet that definition, nor does your boss being PA towards you and interrupting you.  This is a management, not an HR problem (unless you were on FMLA leave and this behavior is solely in retaliation for that).",
                "comment-author": "SpecialKnits4855",
                "replies": []
            }
        ]
    },
    {
        "title": "At work with no work.",
        "post-author": "soooonotlele",
        "text": "I’ve been a support worker since Jan of this year, and been moved around to different client teams quite a lot. \n\nLast week we devastatingly had a client pass, who happened to be the lady i had been solely working with since March. This has resulted in many staff members being moved to different teams aside from me, or being sent to other residential sites, under our company, in other areas. I don’t drive so this hasn’t been assigned to me either. \n\nI’ve been classed as a “float” worker. I do 12 hour days, 7am-7pm, three days a week. \nFloating entails walking around aimlessly, asking if other members of staff need help, a break or anything from our stock cupboard. Most of our residents are assigned two staff members meaning there’s always extra support. \n\nFor the last 5 of my shifts, and the next three this week i’ve been assigned to float. I’ve been requested to sit in an empty house and wait until i’m needed. Am i wrong in thinking that i shouldn’t be here? I’m technically getting paid to do nothing but not being productive is eating me alive! … \n\nAny advice? ",
        "comments": [
            {
                "body": "Find a way to improve yourself or your skills while you get paid to do nothing. Or at least use the time to update your resume and hunt for a new job and have something lined up before they catch on and either lay you off. Fly under the radar and get paid.",
                "comment-author": "42Changes",
                "replies": []
            }
        ]
    },
    {
        "title": "My boss fired my manager for not agreeing with new policies",
        "post-author": "Minigoat_19",
        "text": "Hello, I’m not very fluent with reddit but I need some advice. My boss fired my manager, who is also a good friend, for what seems like very out of the blue to the rest of us. \n\nFor some context, our job is pretty high security and we tend to keep staffing as minimal as possible so it’s already a very competitive work environment, but those who stick around end up being really close as the years go by. My boss has often prided us on our great work culture and everyone getting along. Most of us have worked closely together for at least 2 years now, and are good friends. We’ve celebrated life events together, helped each other outside of work, attended parties together, etc. I’m sure corporate hates seeing employees spending time outside of work with the managers. But there has never been a rule against that, and would be difficult because often times friends/family are hired on to help keep the job low profile. \n\nI really enjoy my job, but the last 6 months or so have been feeling harder and harder. I used to feel that the company really cared of their employees, but lately it feels like we’re just numbers and they care more about profit than us. My manager who was fired always advocated for us. She would listen to our complaints and go straight to management to make our voices heard as well as her own in a very direct and honest way. \n\nA big change that has been challenging for the employees is the changes to the attendance and time off policy. It used to be kind of an unspoken rule that you should not call out more than once in a 30 days period. If you were sick too many days too closely together, that was enough grounds for termination. We are all well aware that attendance is the reason (at least legally) that most people get fired. \n\nThe policy changed after an employee was terminated after not making it to work due car issues. The employee was later hired back after contacting the CEO about their wrongful termination due to a strict policy. The policy was rewritten to be more lenient as long at the employee was communicating with management. \n\nFor some reason, after that the policy changed again stating that because employees only accrue 2 sick days a year, no one should not be missing anymore days than that. My manager was given a warning that she could not miss anymore days for the year since she had already missed 3 days. In a room with a couple other employees, as well as myself, she was complaining to her co-manager her frustration that 2 out of the 3 days she was absent, she had turned in a doctor’s note for. Stating that if she needed to “fight it” she would, but she is monitoring her attendance going forward. Our boss happened to walk in at that moment and overheard the conversation. He immediately pulled her aside to talk to her about being professional in front of employees. She stated, “I don't have to like the policy I just have to follow it\".  \n\nThis did not sit well with our boss because it led to her getting fired a couple weeks later. I have pretty good attendance, but I don’t have children, sick parents, or car issues that would make my attendance suffer like I’ve seen with some of my other colleagues. So the new policies haven’t affected me too much, but it doesn’t seem right to me at all. I’m very upset about my friend losing her job, but my boss seems pretty firm that he will not be changing his mind. \n\nDoes anyone have any advice how I can advocate for my coworkers and myself against what I feel is a very strict policy?",
        "comments": [
            {
                "body": "My employer doesn’t even track sick time.  The policy is if you are sick, please do not come into the office and get everyone else sick to.  And we are a huge company in the top 50 of the Fortune 500.",
                "comment-author": "AcidReign25",
                "replies": [
                    {
                        "body": "Wow… shocking because it sounds so reasonable. Common sense in the workplace. Lucky you.",
                        "comment-author": "DearEnergy4697",
                        "replies": [
                            {
                                "body": "It’s been like that in the 30 yrs I have been there.    It’s great that pretty much all our HR policies are essentially “we are all adults and professionals.  You do stupid shit then it likely impacts your performance as well.”  I have been a manager of others for 20 yrs and have never had a single discussion with an employee about attendance.  I have had to ask people to go home so they don’t get others sick.  Sick time is paid.",
                                "comment-author": "AcidReign25",
                                "replies": []
                            },
                            {
                                "body": "I work for a small business and was expected to work with the flu",
                                "comment-author": "ArkAbgel059",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "Same for me.  I was out for 6 months for a treatment that made me very ill.  My boss didn’t even put me on medical leave. All was good. She sent me flowers and candy. My whole team sent me a care package.  Still got my full paycheck.  Top 20 Fortune 500 corporation.",
                        "comment-author": "Desert-Monsoons",
                        "replies": []
                    },
                    {
                        "body": "As long as people don’t abuse it, that’s the way it should be. Just handle it with the ones abusing the policy. You could be a model employee and get the flu that could take you out for a week! The last time I had COVID, I spent 10 full days in bed! \n\nI don’t think it’s legal to fire someone solely for missing 3 days of work if you’re legit sick! I suspect there was other circumstances (like a mgr complaining about policy to an employee in earshot of others,) that caused the mgr’s firing.",
                        "comment-author": "Commercial-Push-9066",
                        "replies": [
                            {
                                "body": "A YEAR! 3 days in a YEAR! I’m a pretty reliable employee, but that’s insane.",
                                "comment-author": "Beautiful_Pizza9882",
                                "replies": []
                            },
                            {
                                "body": "Sadly, though, too many abuse it.",
                                "comment-author": "Jitterbug26",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "body": "I work in a hospital… if we call it sick, we have to go see employee health and get a note, then go see our personal doctor and get a note. We literally have to be bleeding from the eyes and ears and then we’re still expected to show up. But goodness gracious the hoops Employee Safety will jump through to preach hand washing, masking, gloving, etc…then expected to do your job plus 3 others jobs too. Then again, I guess that’s everywhere. Do way more with way less.",
                        "comment-author": "AppointmentTasty7805",
                        "replies": [
                            {
                                "body": "Stop complaining, or you're next.  /s",
                                "comment-author": "HamsterWoods",
                                "replies": [
                                    {
                                        "body": "Oh I’ve learned that….it’s called ‘speaking it into existence’…..also, even though I work full time hours, I’m classified as PRN, so I don’t get sick time",
                                        "comment-author": "AppointmentTasty7805",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "You can say you work for a Fortune 50 company. It's common vernacular",
                        "comment-author": "maryjayjay",
                        "replies": []
                    },
                    {
                        "body": "As it should be.",
                        "comment-author": "green-gray",
                        "replies": []
                    },
                    {
                        "body": "same 100,000 employees. please stay home if you’re sick - thanks for not infecting the rest of us.",
                        "comment-author": "semiotics_rekt",
                        "replies": []
                    },
                    {
                        "body": "Tried the unlimited sick time. Someone missed 200 hours last year. Now, they ruined it for everyone.",
                        "comment-author": "UncomfortableBike975",
                        "replies": []
                    }
                ]
            },
            {
                "body": "If you get 2 sick days a year the company doesn't care about employees at all.",
                "comment-author": "uffdagal",
                "replies": [
                    {
                        "body": "I get PTO and no sick days. Yes I am very aware this sucks. Go USA! /s",
                        "comment-author": "wkendwench",
                        "replies": [
                            {
                                "body": "Depends on the amount of PTO, I get 216 hours a year.",
                                "comment-author": "JunkmanJim",
                                "replies": [
                                    {
                                        "body": "We have to preschedule PTO we are not allowed to use it if we are sick.",
                                        "comment-author": "wkendwench",
                                        "replies": [
                                            {
                                                "body": "That's terrible.",
                                                "comment-author": "JunkmanJim",
                                                "replies": [
                                                    {
                                                        "body": "Yep and unfortunately it is the norm were I live now. The businesses down here don’t pay what you are worth and the benefits are nearly non existent.",
                                                        "comment-author": "wkendwench",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "Do you work for the railroad?",
                                "comment-author": "stuckbeingsingle",
                                "replies": [
                                    {
                                        "body": "No but the railroad used to be a great place to work years ago. I had an uncle who was an engineer.",
                                        "comment-author": "wkendwench",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "It seems lots of people from Mexico and Guatemala don't mind.",
                                "comment-author": "JacqueShellacque",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "What advice are you looking for?   Keep your head down and don't miss work unless you are on death's door?\n\nThe boss will feel the heat if too many employees get let go.  But he MIGHT have put her on the shitlist for insubordination (failure to follow orders).  Or if you are in state/country that allows it, at-will.",
                "comment-author": "3xlduck",
                "replies": []
            },
            {
                "body": "I think your manager is the lucky one.",
                "comment-author": "MantuaMan",
                "replies": []
            },
            {
                "body": "Higher ups make the policy, we follow or apply elsewhere.\n\nSounds like your manger had more issues than that, if they fired her over talking trash about policy, but there are places that will get you later, maybe that was her.",
                "comment-author": "tikisummer",
                "replies": [
                    {
                        "body": "the business of advocating for everyone leads me to wonder what she was advocating for - she got fired for a series of buildups not just this day off thing",
                        "comment-author": "semiotics_rekt",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Run screaming.",
                "comment-author": "themcp",
                "replies": []
            },
            {
                "body": "LMFAO, two sick days a year?! I get 2 weeks of sick time a year. Start stealing from work.",
                "comment-author": "Slow_Balance270",
                "replies": [
                    {
                        "body": "2 days a year  is mighty stingy.\n\nI get 8 hours per month, and it accrues. I used to have 9 months accrued.  Surgery and physical therapy used 3 months.",
                        "comment-author": "RevolutionaryGuess82",
                        "replies": [
                            {
                                "body": "I’ve a neighbour who works in a production plant. Very stringent policy on sick time, though the plant is unionized.  Zero sick time, no accrual.  You don’t work, you don’t get paid.",
                                "comment-author": "curveofthespine",
                                "replies": [
                                    {
                                        "body": "Your neighbor pay dues for someone to negotiate *THAT* deal? What the actual fuck!",
                                        "comment-author": "Defiant_Review1582",
                                        "replies": []
                                    },
                                    {
                                        "body": "If you're saying you just don't go to work and you don't get paid for it, I'd be fine with that. My company calls that \"Company Time Off\" and they almost never give it out.",
                                        "comment-author": "Slow_Balance270",
                                        "replies": [
                                            {
                                                "body": "I’m certain he’d trade you in a heartbeat for a job with paid sick time.  \n\n\nDental appointments, kids parent teacher interviews, broken arm?  No beuno",
                                                "comment-author": "curveofthespine",
                                                "replies": [
                                                    {
                                                        "body": "That isn't what we are talking about. If they are working for a union they are making it sound much worse than it likely is.",
                                                        "comment-author": "Slow_Balance270",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": "I don't understand getting a fixed amount of sick time. I live in Spain and if you're sick, you get a doctor's note and go back when you're better. Obviously if people take the piss it can become an issue, but generally people don't. Firing someone for being off sick is a legal minefield here.",
                                "comment-author": "EducationalRiver1",
                                "replies": [
                                    {
                                        "body": "I'm in America.  We have a union contract. We get a contractual amount of sick leave and vacation.  Sick leave is a benefit if you are sick or family sick leave. It's not the employee's time perse but only if needed. Once we retire, if there is more sick leave accrued than a certain amount, the employee is paid a small percentage. \n\nI think if you have 1000 hours accrued, you get 25% of your wage for 1000- 750 hours. So, if you make $20 per hour, your retirement bonus will be $5 (25%) times 250 hours. It's not a lot but better than a kick in the pants.\n\nNot everyone gets this. Usually, a retiring employee only gets his last paycheck and whatever he has saved for retirement. Plus, there is Social Security. \n\nThere are many times when one is not fit for duty, but a doctor's care is not needed. We need a doctor's note if we are out for more than 3 days. If you have a virus, no one wants you infecting others. A doctor is not needed because there is no cure other than letting your body fight it.\n\nNot everyone here gets this as each business makes its own policy.\n\nI work a safety sensitive job. If you have brain fog or you can't see because a headache affects your vision, we need to be off. Wrecking machinery and injuring people is not an option.",
                                        "comment-author": "RevolutionaryGuess82",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "body": "Classic",
                        "comment-author": "DearEnergy4697",
                        "replies": []
                    }
                ]
            },
            {
                "body": "I don’t know the whole story obviously, only what you’ve said here, but based only on that, it seems like the issue was not her adherence to the policy, it was being unprofessional and bad mouthing the policy in front of her subordinates, which is not appropriate for someone in a supervisory capacity no matter how you slice it. That doesn’t mean that the policy isn’t also ridiculous, the two can be true at the same time. But I would guess that this isn’t the first time that she had been unprofessional in that way and I get why that would be a dealbreaker for upper management.",
                "comment-author": "Brilliant_Desk5729",
                "replies": []
            },
            {
                "body": "Shrugs in corporate America. We have 10 days paid sick leave per year and any unused leave can accumulate to up to 20 days per year maximum by law or more if your contract allows for it. I can't believe how corporate friendly to laws are over there and how little protection is afforded to employees",
                "comment-author": "KAYO789",
                "replies": [
                    {
                        "body": "I think I technically have something like 6 months of sick leave. It’s accrued on the books, but doesn‘t get cashed out when you leave.",
                        "comment-author": "ThisTimeForReal19",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Other places are run by more compassionate people. \n\nThe leaders in your company suck. Start looking elsewhere. Get out and don't look back.",
                "comment-author": "g33kier",
                "replies": []
            },
            {
                "body": "I get the bosses perspective. She really shouldn’t have been complaining in front of her team. How is she going to enforce policy if the workforce knows she objects and tried to wheedle her way around the policy? She needed to talk privately. But 2 days? Find another job.",
                "comment-author": "Lilly6916",
                "replies": []
            },
            {
                "body": "OP sounds like a pretty toxic work environment. Life happens, kids get sick, people get sick, cars break down, people have family members pass. I’m shocked at your company’s attendance policies are archaic. “A bad Manager can take a good staff and destroy it, causing the best employees to flee and the remainder to lose all motivation.”",
                "comment-author": "Buckeyebean",
                "replies": []
            },
            {
                "body": "Is your bosses last name Trump?",
                "comment-author": "IntentionUsed8474",
                "replies": []
            },
            {
                "body": "2 sick days a year? It’s time to find a new job.",
                "comment-author": "IntrovertsRule99",
                "replies": []
            },
            {
                "body": "Wow, I don’t even thinks that’s legal. I have a chronic illness that requires me to go to the doctor once a month. \n\nIt’s illegal to discriminate against someone for health reasons, so I just let my boss know a month ahead of time when my next appointment is and submit my time off request.",
                "comment-author": "CLPDX1",
                "replies": [
                    {
                        "body": "Seriously. Just put in a half day (2nd shift) because they only do this particular ultrasound guided anesthetic/steroid injection on Monday/Tuesday afternoons. Boss approved it asap. He knows I'm not messing around if I'm out.",
                        "comment-author": "sweetmusic_",
                        "replies": [
                            {
                                "body": "This is exactly what I do.",
                                "comment-author": "CLPDX1",
                                "replies": [
                                    {
                                        "body": "Sorry wasn't trying to tell you to do that. The seriously was ment in agreement with you. I'm fortunate my boss knows anything with my ankle is important and needs accommodation though I feel bad taking ½ of Monday and all of Wednesday off (scheduled that day months ago Friday saw my orthopedic and he wanted an injection based on what caused it to get flared up)",
                                        "comment-author": "sweetmusic_",
                                        "replies": []
                                    },
                                    {
                                        "body": "Sorry wasn't trying to tell you to do that. The seriously was ment in agreement with you. I'm fortunate my boss knows anything with my ankle is important and needs accommodation though I feel bad taking ½ of Monday and all of Wednesday off (scheduled that day months ago Friday saw my orthopedic and he wanted an injection based on what caused it to get flared up)",
                                        "comment-author": "sweetmusic_",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "But boss guy takes a half a day every Wednesday to play 18 holes right? Rules for thee, but not for me. Only an idiotic company wants sick people coming to work. Draconian PTO policies actually hurt productivity and are just hard R.\n\nI always told my people to call out when sick, we will figure out the attendance stuff after. My view was always that you can make up lost time (stay late/weekends)as long you are productive and not just doom scrolling at work.",
                "comment-author": "Deplorable1861",
                "replies": []
            },
            {
                "body": "What's the actual question?",
                "comment-author": "z-eldapin",
                "replies": []
            },
            {
                "body": "They've got things the way they want them, at least for now. If you try to speak up, the only change you'll effect is to lose your job sooner than you had planned.",
                "comment-author": "Useless890",
                "replies": []
            },
            {
                "body": "2 sick days a year seems pretty unreasonable to me. Have you considered changing jobs?",
                "comment-author": "Azlazee1",
                "replies": []
            },
            {
                "body": "A company would be lucky if each if its staff only had 2 days sickness in a year. A bout of flu puts you diwn for 5-7 days.\nThe policy is unrealistic.\nYour manager was wrong to verbalise her disagreement with policy with another manager in front of staff. That is undermining the management if which she is a part.\nYou cannot advocate for her. The decision is made and they wouldn't take her back.",
                "comment-author": "Capital-Wolverine532",
                "replies": []
            },
            {
                "body": "A novel written.",
                "comment-author": "Scrappy001",
                "replies": []
            },
            {
                "body": "Sounds pretty draconian to me. I think your manager was fired due to her attitude and over sharing her frustrations with the team. \n\nPersonally I prefer honest dialogue with my manager. However I have seen effective managers lose their job over stuff like this before.",
                "comment-author": "UseObjectiveEvidence",
                "replies": []
            },
            {
                "body": "GET OUT OF THAT TOXIC WORK ENVIRONMENT NOW!  Also encourage your old boss to initiate legal proceedings against the company.  People and their families are often sick for a few days in a row and outlawing it will not force compliance!",
                "comment-author": "Belle-llama",
                "replies": []
            },
            {
                "body": "I hated it when my employees came in sick. I always caught whatever they had. I could understand why your mgr’s boss wasn’t happy to hear a mgr complain about policy in earshot of others. I understand you are friends, but she could’ve complained after hours.",
                "comment-author": "Commercial-Push-9066",
                "replies": []
            },
            {
                "body": "That's a ridiculous policy",
                "comment-author": "SufficientCow4380",
                "replies": []
            },
            {
                "body": "In my state (Oregon) employers are legally required to provide employees with one hour of paid sick time per 30 hours worked. (Thats 9 eight hour days per year if you work 40 hrs/week.) You could contact a legislator in your state and try to get the laws changed, if they don’t already cover that. If they do cover it, your ex-manager should sue the company. Ultimately, you may need to set a healthy boundary with work, and find another place that isn’t so horrible to its workers. That policy is exploitative and dehumanizing. You aren’t robots.",
                "comment-author": "lsummerfae",
                "replies": []
            },
            {
                "body": "Employers who terminate employees for not coming in when sick are just encouraging people to come in sick and infect other people. It is an awful policy. My company is very strict in the opposite direction – you are required to work from home, even if feeling better, until you have been symptom-free for 24 hours. No ifs, ands, or buts.",
                "comment-author": "LukeSkywalkerDog",
                "replies": []
            },
            {
                "body": "Location? Some states have mandatory accrued sick time (NJ mandates 5 days in a calendar year).",
                "comment-author": "Beautiful-Vacation39",
                "replies": []
            },
            {
                "body": "Sometimes the biggest statement you can make is to find a new job and all quit the same day. All do an exit interview telling them them the exact same reason",
                "comment-author": "Conscious-Big707",
                "replies": []
            },
            {
                "body": "The way you and your coworkers handle it is by finding new jobs. Your fantasy that a company cared about you has hurt you. 2 sick days a year is bad even for the US. It isn’t that the higher ups don’t know, they do know. They reward these managers for taking the hit for enforcing what they want.",
                "comment-author": "logaruski73",
                "replies": []
            },
            {
                "body": "Was she working for employee or company? It sounds like that was her mistake mistake.",
                "comment-author": "Chemical-Tap-4232",
                "replies": []
            },
            {
                "body": "What a horrible company to work for!  I hope you find a position with a company that values employees and respects that we all have lives and at times are sick or have emergencies.  \n\nPlus, a sick day policy like this one means that everyone goes to work sick.",
                "comment-author": "New_Improvement9644",
                "replies": []
            },
            {
                "body": "You find a new job en masse that’s how",
                "comment-author": "imnotabotareyou",
                "replies": []
            },
            {
                "body": "Union.",
                "comment-author": "Maine302",
                "replies": [
                    {
                        "body": "This. Look into the union protection laws, find at least one other co-worker, and start organizing.",
                        "comment-author": "Avery_Thorn",
                        "replies": []
                    }
                ]
            },
            {
                "body": "2 sick days a year? Are you a slave? Why do think this is great company to work for? All of you should start looking for new work, they don't give a shit about you!",
                "comment-author": "AnGof1497",
                "replies": []
            },
            {
                "body": "Assuming there wasn’t some kind of bad blood. For starters, the policy came from further up. But if the one who got fired was a manager it could be that her boss wanted her to show a unified front because they knew it was gonna be unpopular. If they had this conversation and agreed, and then he saw her undermining that effort then that’s why he did it. When you get a policy change like that you’re better off just playing ball for a month until everybody relaxes. When you start accepting titles like manager and director, you agree to repeating the corporate line. Even if you don’t  like it you save your complaints for private time. That was office time. \n\nIf they give you two sick days a year they just tell you you’re great to keep you from leaving . It might be high security, but they haven’t managed their company to handle contingencies issues.",
                "comment-author": "HateMeetings",
                "replies": []
            },
            {
                "body": "Man, 2 sick days a year? I accrue sick days based on hours worked, and sick days build up incredibly fast, but I would build that up in like 2 weeks maybe 3?",
                "comment-author": "junesjive",
                "replies": []
            },
            {
                "body": "Sounds like a lawsuit coming",
                "comment-author": "dannyocean2011",
                "replies": []
            },
            {
                "body": "This place sounds like a FMLA nightmare. \n\nI just want to put it out there that if the business can’t absorb illnesses as a random attendance issue, then that business itself is mismanaged, overly reactive, and restrictive. These are all very high red flags for me. The last one being micromanaged. This is clearly a top down issue.\n\nIt’s woefully mismanaged and a toxic work culture. Stop thinking about the good times. Those times are over. When a CEO starts getting this way, I immediately suspect underperforming financials. It’s never a good sign.",
                "comment-author": "funsado",
                "replies": []
            },
            {
                "body": "she was fired because she was talking about it in front of staff - I don't think it's because she disagreed with it.  \n\n  \nShe's right; she doesn't have to agree with it, but she does need to uphold it and enforce it with her staff.  Your manager wasn't doing this.\n\nBTW, it's a dumbass policy.",
                "comment-author": "Annie354654",
                "replies": []
            },
            {
                "body": "Setting aside the asinine policy.  Your manager was trashing that policy to other team members; a policy they are obligated to follow and arguably defend.   When reminded that wasn’t professional, the response itself wasn’t professional.\n\nBest way to change the policy — feedback during exit interviews.",
                "comment-author": "tropicaldiver",
                "replies": []
            },
            {
                "body": "2 days sick leave a yr seems really harsh. Especially with a Md's excuse. No PTO plan that includes vacation?  Without your former manager to advocate in your behalf, immediately call your network friends and look for a better job.  This one isn't going to end well.",
                "comment-author": "ratherBwarm",
                "replies": []
            },
            {
                "body": "Get covid, then request a private meeting with your boss.",
                "comment-author": "bk4lf1",
                "replies": []
            },
            {
                "body": "Is this in the states? That doesn't even sound legal. Every employee that works over 30 hrs gets up to 5 sick days a year, it was passed during Obama's first term, I think.",
                "comment-author": "NorwalkAvenger",
                "replies": []
            },
            {
                "body": "Let’s hope no one gets the flu, or cancer, or Covid, or pneumonia, or, or, or…",
                "comment-author": "Commercial_Fun_1864",
                "replies": []
            },
            {
                "body": "Two sick days a year is ridiculously low. They’re going to churn through a lot of employees with that rule.",
                "comment-author": "TripMaster478",
                "replies": []
            },
            {
                "body": "You and your coworker should be job searching and putting your energies there. 2 days sick leave a year is from a company who doesn’t care about its employees’ wellbeing. Doesn’t give a crap about them. Expect policies to get worse there and any dissenters will be terminated or retaliated against.",
                "comment-author": "AuthorityAuthor",
                "replies": []
            },
            {
                "body": "Work environments change, it might be time for you to move on.",
                "comment-author": "Brokenclavicle17",
                "replies": []
            },
            {
                "body": "Bad policy but always remember at work know your role and shut your hole or you are next",
                "comment-author": "smudgeadub",
                "replies": []
            },
            {
                "body": "I would bet serious money this happened in the US. Their worker protection rights are non-existent.",
                "comment-author": "TJ_Blues18",
                "replies": []
            },
            {
                "body": "I can't give you specific advice because I'm not in your location.\n\nI will say I think you have been misled - just as they intended. The company doesn't care about you and has a history of happily terminating people who have minor infractions for time off. I suspect you would find there are ulterior motives for the other reasons like hiring family that benefit the company more than you. The idea that the company looks after its long term employees may be true but I guarantee it comes with some serious catches.\n\nYou might pay to remember than your workmates are rarely your friends either - if it comes down to your job or theirs, or them using information they've gained in a conversation they've had with you to get ahead, they'll use it. Your workmates are not your friends.\n\nTwo years sounds about right as timeframes go. You've been there long enough that you are beginning to see the cracks and you are beginning to asking questions. Keep your head down.  Your friend didn't get fired because of poor attendance, she got fired for questioning the system.",
                "comment-author": "Old_Leather_Sofa",
                "replies": []
            },
            {
                "body": "That is the worst attendance policy I've ever heard of, your company must hate their employees,, holy shit. 2 days a year is ridiculous,  the flu lasts longer than that.",
                "comment-author": "MonsterOfTheMidway",
                "replies": []
            },
            {
                "body": "Your company doesn't and has never ever cared about any employee whatsoever. These attendance policies are illegal in the civilized world.",
                "comment-author": "ctriis",
                "replies": []
            },
            {
                "body": "\"Does anyone have any advice how I can advocate for my coworkers and myself against what I feel is a very strict policy?\" ... sounds like your only solution will be to find another job.",
                "comment-author": "k23_k23",
                "replies": []
            },
            {
                "body": "You've worked many years for a company that will fire you after 2 sick days, and you've generally felt this is a good company all these years?",
                "comment-author": "JackDaWackOG",
                "replies": []
            },
            {
                "body": "It's not your job to advocate for your coworkers, unless you are their manager. As to protecting yourself, knowledge is your first and best defense: what do employment laws in your jurisdiction say about attendance, sick days, etc.",
                "comment-author": "JacqueShellacque",
                "replies": []
            },
            {
                "body": "Only 2 sick days per year is ridiculous! It takes a week to get over COVID and - CRITICALLY - no longer being infectious. Find a new employer.",
                "comment-author": "Responsible-Tailor83",
                "replies": []
            },
            {
                "body": "Three sick days a year seems like an average, but as a maximum or you will be fired it seems harsh and unrealistic.  But it’s management’s decision. Just start looking for a new job.  If the tide is changing there are likely more negative changes on the horizon.",
                "comment-author": "ReaderReacting",
                "replies": []
            },
            {
                "body": "Are you in the US? Sounds like you're not. We have as many sick days as we need, we only get paid for X number of them though.\n\nTo have a manager rapping crap about company policy tears the business down. It created an us against them atmosphere that a manager could be fired for. Though I would think he would get a warning first. \n\nThis is not a good, or secure place to work, if you're in the US. I would be looking for a new job!",
                "comment-author": "fromhelley",
                "replies": []
            },
            {
                "body": "Every time I read a post like this I’m glad I’m represented by a union. People: stop taking this horrible behaviour from companies. Join a union.",
                "comment-author": "velo_zebra",
                "replies": [
                    {
                        "body": "hardly a reasonable solution with what absolutely little we know about this company - op said security- if is mall security guards then yes absolutely- if it’s brinks armoured cars then by all means - if it’s remote high tech antivirus and coding who knows",
                        "comment-author": "semiotics_rekt",
                        "replies": []
                    }
                ]
            },
            {
                "body": "Find a new job and help them get out of there as well.",
                "comment-author": "justaman_097",
                "replies": []
            },
            {
                "body": "Workplaces like yours need a union.",
                "comment-author": "Dismal_Reference3906",
                "replies": []
            },
            {
                "body": "How do you hire a new employee ensuring they won't also take sick days? What is the quality they would hire for? Such a low IQ boss.",
                "comment-author": "Additional_Goat9852",
                "replies": []
            },
            {
                "body": "Everything you have said breaks multiple labour laws. \n\nIn my country you are a literal slave. Why tf do you put up with this shit?",
                "comment-author": "Lopsided-Head4170",
                "replies": []
            },
            {
                "body": "Unionize.",
                "comment-author": "keats8",
                "replies": []
            },
            {
                "body": "I’ve never had a job with less than 5 sick days and I’d never work for any company that offered less.",
                "comment-author": "unimpressed-one",
                "replies": []
            },
            {
                "body": "Don't!",
                "comment-author": "Own_Tumbleweed_9978",
                "replies": []
            },
            {
                "body": "What do you expect here?  Provided they are all local laws there isn't anything you can do.",
                "comment-author": "NCC1701-Enterprise",
                "replies": []
            },
            {
                "body": "its a fcked up place no matter how much u sugercoat the workers bond there just gtfo asap",
                "comment-author": "fwd079",
                "replies": []
            },
            {
                "body": "You don't list where you're at.  Laws for these thing will vary from state to state, or country to country.  So it's very hard to give you any specific advice w/o knowing that.  Most states in the US do not require an employer to provide any PTO.  So the company is only required to stay consistent with their policy.  If it's strict, then it's strict.  But some states do have set minimums for earned sick time.  So that could factor in.\n\nBy the same token, 49 out of the 50 states in the US are at-will employment states.  Meaning they can fire you at any time, for nearly any reason.  So speaking generally....sure.  The boss could fire somebody if they are outspoken about their dislike of new policies at work.  It's shitty, but in most states, it's legal.  So in terms of you advocating for yourself and coworkers against this policy.....I'd suggest you tread carefully.  The boss has already set the tone here.  They fired one person for complaining about the policy.  My gut says they probably won't hesitate to fire another.",
                "comment-author": "sephiroth3650",
                "replies": []
            }
        ]
    },
    {
        "title": "Management is openly racist in their hiring policies",
        "post-author": "redditreader_aitafan",
        "text": "My son works as a manager at McDonald's.  He recommended someone for hire after an interview and was later told by the GM, assistant store manager, and a regular manager that the man recommended \"wouldn't fit in here\" and it was made very clear that it was because of his skin color. Who do we tell?! My son was very upset and thinks this is ridiculous but we don't know who to tell. As far as I know, it would be on the applicant who would need to bring suit, but there's no way to contact the man to tell him this is why he wasn't hired. ",
        "comments": [
            {
                "body": "How did they make it clear that it was because of skin? What did they say exactly? \n\nWhether this can be escalated successfully depends on what your son actually heard.\n\nAlso - how is there no way to contact the man? He applied for a job. Your son should have his contact info?",
                "comment-author": "peachypapayas",
                "replies": [
                    {
                        "body": "I don't know the exact wording but son asked when he's starting, was told he wasn't hired, son asked why, they said \"he wouldn't fit in here\", son asked what do you mean, they said because he's black and then \"we don't hire black people\". Son then backed away from the conversation because he was dumbfounded.\n\nETA after seeing your edit - he does not have access to applications after the interview is conducted and I'm sure they disposed of it anyway. The interview was a couple weeks before this conversation. It didn't occur to son to take note of any personal information because he was sure the guy would be hired. He remembers the guy's first name, but no last name or address information or a phone number or anything.",
                        "comment-author": "redditreader_aitafan",
                        "replies": [
                            {
                                "body": "I still don’t understand how your son doesn’t have this guy’s contact info? how did he recommend the job to him in the first place?",
                                "comment-author": "texcleveland",
                                "replies": [
                                    {
                                        "body": "The guy put in an application like anyone else. My son conducted his interview. My son was impressed with him and recommended him for hire, as is part of his regular duties as manager - conduct interviews when asked to do so, give recommendations or impressions on whether or not the candidate is right for the job. He had a handful of interviews that day, one no show with a couple \"ok\" candidates but said definitely hire this guy. Then son went on about his duties and gave it no more thought, as usual. At some point it came up again, I'm unsure of the exact details, but when it came up again he was told in no uncertain terms that the man was not hired because he is black. The recommendation for the job was just based on the interview, my son said he seemed like a cool guy who would actually do his job and not cause drama or quit a week later, son does not know the man personally.",
                                        "comment-author": "redditreader_aitafan",
                                        "replies": [
                                            {
                                                "body": "Hang on. Your son is a manager and he hasn’t got enough gumption to call the person who said this out in their shit?  I’d have been telling them right there and then that I was making a complaint to higher up the chain. What a disgusting attitude they have!",
                                                "comment-author": "Pollyputthekettle1",
                                                "replies": [
                                                    {
                                                        "body": "Higher up the chain are more assholes who probably agree with this decision. He didn't say anything because he was outnumbered and needs this job for now.",
                                                        "comment-author": "redditreader_aitafan",
                                                        "replies": [
                                                            {
                                                                "body": "When I say higher up the chain, I mean McDonalds head office. The guys who know how this would look if it got in the press. If there are no black people working in head office anywhere (I’m assuming you are in America here as most seem to be) I’d be extremely shocked. I bet their legal team would be all over this.",
                                                                "comment-author": "Pollyputthekettle1",
                                                                "replies": []
                                                            },
                                                            {
                                                                "body": "One of the things they are paying managers for is to have the balls to point out when the company is doing something they could get sued over. This is one.",
                                                                "comment-author": "Pollyputthekettle1",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Franchise or corporate?\n\n\nYour son should leave, immediately as soon as work is available elsewhere.",
                "comment-author": "ComprehendReading",
                "replies": [
                    {
                        "body": "Franchise. He's leaving at the end of the month. He just doesn't want this to happen again.",
                        "comment-author": "redditreader_aitafan",
                        "replies": [
                            {
                                "body": "There is probably a corporate ‘compliance hotline’. Consider reporting the incident there. Should be anonymous (often managed by a third-party), but confirm that if worried about blowback. \nIt’s a legal and PR liability to the company for a franchisee to behave like that, so perhaps Corporate will act without needing to go through lawyers & courts. Consequences may be lesser for the franchisee, but it could at least mean some form of accountability, and better than doing nothing.\n\n(IIRC “Compliance” means both violations of the law, and of company policies.)",
                                "comment-author": "TheHerringIsMightier",
                                "replies": [
                                    {
                                        "body": "I was writing this up too before I saw your post. Yes this is something he should bring to corporate. If this is in the US, the  race is a protected class. Its illegal to not hire someone based on being black",
                                        "comment-author": "misterclean101",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "body": "if leaving he should raise it with the district team _ local owner who said “blacks do t fit in” will fire  your son for raising it - son should gather all the info from the applicant, date / time / duration of interview his notes for his reasons for recommending the hires etc.\n\nit’s highly likely that local store manager and owners will deny it but the only way corporate can deal with this is if they can get some data and here is one piece of data for them to build a case - franchisee is risking his store being like this",
                                "comment-author": "semiotics_rekt",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "So the right way to fight this is to continually suggest good black candidates and document the reasons they get rejected.",
                "comment-author": "ACriticalGeek",
                "replies": []
            },
            {
                "body": "As a manager, your son can contact corporate and file a complaint against the GM. Even if that location is a franchise, McDonald’s will want to save its own butt by fixing this problem before it becomes publicly known and tarnishes their reputation.",
                "comment-author": "IcyManipulator69",
                "replies": []
            },
            {
                "body": "Large companies, so McDonald's for sure, have internal processes for illegal and unethical behavior complaints. These can be called Ethics hotlines, or Whistleblower lines or Compliance hotlines for example: your son should should report what happened using it, in as much details as possible (dates, names, exactly what happened). \n\n  \nEven if your son does not have the candidate's information anymore, the department handling the investigation will be able to pull it from the recruitment system, as well as other information they might need like the location's hiring history.",
                "comment-author": "Upbeat-Perception264",
                "replies": []
            },
            {
                "body": "McDs has a holiness for employees. He needs to report this and keep a written record of what day(s). Time. Quotes of what the manager said. \n\nThis stuff happens all the time and not many people report it. That's a first step that COULD lead to change but he has to do his part.",
                "comment-author": "mousemarie94",
                "replies": []
            },
            {
                "body": "mcdonald’s doesn’t stand for this BS. son has to escalate this to the district team at mcd head office. son will get fired for doing this tho.",
                "comment-author": "semiotics_rekt",
                "replies": []
            },
            {
                "body": "The applicant would need to file a lawsuit or an EEOC complaint but honestly, it wouldn’t amount to anything; he’d need clear proof that were it not for his race, he would have been hired. \n\nEven if your son went on record that his bosses all said it was because the candidate “would be a poor fit”, that doesn’t actually prove it’s a matter of race. The thing is, even when it’s about race, it’s easy to make the case that it isn’t. It’s not because the candidate is black! Oh my, what an idea! Lord, no, it’s just because their speech is too urban, their hair style doesn’t fit with what the customers at this location like to see! And at that location across town? We didn’t reject that woman because she’d have been the only white or female manager, it was just because she was too soft spoken and sensitive!\n\nTrust me, I’m an area manager for another fast food brand and I can tell you that yes, race is sometimes a factor but these companies provide way too much training on how to cover your ass for you to be able to bring a case. On the other hand, being a poor fit for a location is also a very real thing, and it can be tough to distinguish the two. \n\nI hired a woman my age as a manager for one location. She was very qualified and clearly good at her job but she had constant friction with her GM, other managers and crew at that location - even customers complained about her attitude. I didn’t see any attitude problem in her, but I did notice that her speech and mannerisms were different from mine and from all the white people in her store. All the issues were vague and subtle, impossible to define, open to interpretation. \n\nLegally I could have let her go, told her she was a poor fit - because she WAS. She was a poor fit just like I was when I was 18 and got put in an all black store, and I had a steep learning curve before I fit into that culture. I didn’t think she’d hang in there for a year while they all got to know each other, so I offered her a transfer to a different store. The other store was much more diverse, had several black female leaders, and everyone loved her there. They didn’t see disrespect in the way she moved her head when she talked, the customers weren’t bothered by her hair and nails, and the crew listened to her. \n\nThe real world isn’t that simple. Race matters, indirectly, because it is tied to culture. Culture matters, so in a way, race matters. Of course it also matters in ways it shouldn’t, discrimination is real too, but it’s very fucking hard to tell, let alone prove, when it’s racism and when it’s cultural differences. \n\nYour son will have a very tough time in life if he is ready to do all out battle over suspected discrimination that didn’t directly affect him. Instead of trying to fight the system, he can change it from within by rising up and making smarter staffing decisions.",
                "comment-author": "NikkiNeverThere",
                "replies": [
                    {
                        "body": "OP clarified that the GM directly said they don't hire Black people.",
                        "comment-author": "CustomerOutside8588",
                        "replies": [
                            {
                                "body": "OP clarified that they hear this second hand. OP didn't hear the GM say a single thing.",
                                "comment-author": "ninjaluvr",
                                "replies": []
                            },
                            {
                                "body": "No OP said “they made it clear”, which would be an odd way to put it if they’d heard the GM say: “This is my implicit bias at work guys”",
                                "comment-author": "NikkiNeverThere",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "body": "Weird, because the implausible story you’ve told is not only in direct contradiction to the reality of McDonald’s hiring processes, it’s also told without any first-hand experience. \n\nRage bait should be fun.",
                "comment-author": "Stunning-Field-4244",
                "replies": [
                    {
                        "body": "It all happened as I said. My son told me the story himself as it happened to him. McDonald's hires people who are responsible for hiring other people, and people can be racist.",
                        "comment-author": "redditreader_aitafan",
                        "replies": []
                    }
                ]
            },
            {
                "body": "As a general rule, it should be turned into the EEOC.  However, given how actively racist the current administration is,  doubt that anything would be done about it.",
                "comment-author": "justaman_097",
                "replies": []
            },
            {
                "body": "Why would this individual want to work at a company that, according to you, is openly racist?",
                "comment-author": "Agitated_Goat_5987",
                "replies": []
            },
            {
                "body": "There's nobody to tell unless you can prove it happened.",
                "comment-author": "gevander2",
                "replies": []
            },
            {
                "body": "Well… since the people running the government are openly racist there isn’t much that will be done",
                "comment-author": "stevegannonhandmade",
                "replies": [
                    {
                        "body": "Your political commentary is unnecessary and unhelpful.\n\nSince you edited your comment, I will too. No one is \"playing the race card\". The managers and GM explicitly said the man was not hired because he is black.",
                        "comment-author": "redditreader_aitafan",
                        "replies": [
                            {
                                "body": "While I would generally have a tendency to agree with you, the unfortunate truth is that this is our current reality. \n\nI’m a Title IX Officer in post-secondary education. The Department of Education’s entire Office for Civil Rights has been fired. Not some of them, *all of them.* I have open cases that there is no one to respond to. Emails to contacts are just bouncing back. Emails to general department boxes get an automated response but no follow up. \n\nI’m also in HR and the same thing is happening with the EEOC. So justice is not readily available from the hands of this federal government. \n\nIt would be one thing to scale back operations and wrap up open cases already on the docket. But it is another thing altogether to shut the doors and walk away while people are waiting for their day in court. 😔",
                                "comment-author": "certainPOV3369",
                                "replies": []
                            },
                            {
                                "body": "Not ‘political’ at all. \n\nMy intention was to describe our current reality. \n\nAND the reality in which the OP must live, and with the consequences of their decisions and actions. \n\nGovernmental agencies that may once have ensured protections against discrimination have been directed to stop doing that. \n\nSo… this new reality should be taken into consideration by the OP, informing their decisions.",
                                "comment-author": "stevegannonhandmade",
                                "replies": [
                                    {
                                        "body": "I am the OP. Your political opinions are unnecessary and unhelpful and it is not reality.",
                                        "comment-author": "redditreader_aitafan",
                                        "replies": [
                                            {
                                                "body": "If you are living in the states, this is the new reality.  If you choose to ignore, then all the necessary help will not matter.",
                                                "comment-author": "OldAngryWhiteMan",
                                                "replies": []
                                            },
                                            {
                                                "body": "The reality is that yes this admin has openly stated that they do not believe that racial discrimination exists, and they have gotten rid of the dept that investigated this.",
                                                "comment-author": "420Middle",
                                                "replies": []
                                            },
                                            {
                                                "body": "OP, the reality is that the current administration has been implementing policies that make open discrimination in hiring acceptable again.  If you don’t see the connection, why are you posting about this?  Or tell your son to open an EEOC case and see how far it goes.",
                                                "comment-author": "Alert-State2825",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "body": "So your son is upset that someone he liked as a candidate waa passed by higher ups. \n\nThats going to happen all the time in his life. \n\nSo you think a good reaponse ia to play the they are racist card over an claimed he said/she said comment. \n\nUnless your son has a lot more then 1 person not being hired it will go no where. \n\nEspecially since he isnt the qpplicant.",
                "comment-author": "Face_Content",
                "replies": []
            },
            {
                "body": "Seriously maybe he just wouldn’t fit in there owners prerogative",
                "comment-author": "Oedipus____Wrecks",
                "replies": []
            }
        ]
    },
    {
        "title": "Not sure what to do.",
        "post-author": "IronmanR2025",
        "text": "Basically I am being treated unfair at work. I was hoping for a change in the company but that seems not to be happening. The 2nd of may I was put on a job all week but with the wrong pay so I mentioned this and got told well that’s what it is.. but it states different in my contract. So come the Saturday I felt stressed and my mental health took over. I let my managers aware on the Saturday and put a few days annual leave in and on the day I was ment to be in work I rang in but no one answered.. I have to ring if I am not well etc and followed company policy. The managers went ahead and cancelled the holidays I put in to cover pay as I was told I need to give them a weeks notice? Also never rang me back or responded to a text I sent as no one answered. In the text I also stated the day I would be back in work and also told them a 2nd time a few days before the new week. They have not contacted me about anything and they have now left me with no work for all week this week even through I told them I’ll be back.. I am contracted to 40+ hours a week and employed. Why are they doing this and this really isn’t helping my mental health. :( I have been here for 3 years+ and based in the UK England",
        "comments": []
    }
]